posts/java-cheat-sheet.org
#+title: Java CheatSheet
# +subtitle: /---An Old-School-Cool Language---/
#+macro: blurb Quick reference for an old-school-cool high-level language ^_^
#+author: Musa Al-hassy
#+email: alhassy@gmail.com
#+property: header-args :results none :exports code :eval never-export
#+filetags: java cheat-sheet
#+fileimage: modern-java.png 88% 88%
#+description: Quick reference for an old-school-cool high-level language ^_^

#+macro: src @@latex: \mintinline{java}{$1}@@ @@html: <code class="src src-java"><span style="color: #98971a; font-weight: bold;">$1</span></code>@@

# MA: Remember to invoke “blog/preview/disable” before running “C-c C-e l o”!
# MA: Comment-out #+date for PDF generation.
# +date: <2023-05-10 Wed>
#
# MA: Comment-out the #+include for HTML Generation
# +include: CheatSheet/CheatSheetSetup.org

* COMMENT Stuff to relocate to AlBasmal.org :noexport:

#+macro: begin-ignore-html #+html: <!--
#+macro: end-ignore-html #+html: -->

:details: makes a <details> block in HTML, and produces no contents in LaTeX.
#+begin_src emacs-lisp
(org-deftag details (anchor color)
   "HTML export a heading as if it were a <details> block; ANCHOR & COLOR are optional
   arguments indicating the anchor for this block as well as the background colour of the resulting block.

For example, in my blog, I would use :details_rememberthis_#F47174: to mark a section as
friendly-soft-red to denote it as an “advanced” content that could be ignored
on a first reading of my article.
Incidentally, `orange' and `#f2b195' are also nice ‘warning’ colours.

Sections with this tag are simply hidden for LaTeX exports.
"
   (insert "\n#+latex: \\iffalse \n#+html:"
           (format "<div>%s <details class=\"float-child\" style=\"background-color: %s\">"
                   (if anchor (format "<a style=\"width: 1%%;float: left; padding: 0px\" id=\"%s\" href=\"#%s\">🔗</a>" anchor anchor) "")
                   color)
           "<summary> <strong> <font face=\"Courier\" size=\"3\" color=\"green\">"
           (s-replace-regexp "^\** " "" o-heading)
           "</font> </strong> </summary>")
   (org-next-visible-heading 1)
   (insert "#+html: </details> </div> \n#+latex: \\fi\n"))
#+end_src

:centerline: Centerlines a section's title (LaTeX only)
#+begin_src emacs-lisp
(org-deftag centerline (NO_ARGS) ;; TODO: FIXME: The org-deftag macro requires there to be at least one arg, due to how args are looked-up. Fix that to avoid creating a “let” when there are no args!
   "Centerlines a section's title (LaTeX only); otherwise the title is left alone for non-LaTeX backends."
   ;; WARNING: There cannot be a space between “\n%s” otherwise Org wont recognise the section heading.
   (insert (format "\n#+latex: \\textbf{\\centerline{%s}} \\iffalse \n%s \n#+latex: \\fi \n"
                   (s-replace-regexp "^\** " "" o-heading)
                   o-heading)))
#+end_src

:noexport_BACKEND: noexport's a section's title for a given backend
#+begin_src emacs-lisp
(org-deftag noexport (backend)
   "noexports a section's title for a given backend (defaulting to HTML)."
   (unless backend (setq backend "html"))
   (let (begin-ignore end-ignore)
     (if (equal backend "pdf")
         (setq begin-ignore "\\iffalse" end-ignore "\\fi"))
     (if (equal backend "html")
         (setq begin-ignore "<!--" end-ignore "-->"))
   (insert (format "\n#+%s: %s\n" backend begin-ignore))
   (insert o-heading)
   (org-next-visible-heading 1)
   (insert (format "\n#+%s: %s\n" backend end-ignore))))
#+end_src

# Remove a org-deftag via
# (pop org-export-before-parsing-hook)
# Make this into a macro: org-deftag-remove

