java-cheat-sheet.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.57 in css mode. -->
<html>
  <head>
    <title>java-cheat-sheet.org</title>
  </head>
  <body>
    <pre>
<span class="org-document-info-keyword">#+title:</span> <span class="org-document-title">Java </span><span class="org-document-title"><span class="flyspell-duplicate">CheatSheet</span></span><span class="org-document-title">
</span><span class="comment"># +subtitle: /---An Old-School-Cool Language---/</span>
<span class="org-meta-line">#+macro: blurb Quick reference for an old-school-cool high-level language ^_^</span>
<span class="org-document-info-keyword">#+author:</span> <span class="org-document-info">Musa Al-hassy
</span><span class="org-document-info-keyword">#+email:</span> <span class="org-document-info">alhassy@gmail.com
</span><span class="org-meta-line">#+property: header-args :results none :exports code :eval never-export</span>
<span class="org-meta-line">#+filetags: java cheat-sheet</span>
<span class="org-meta-line">#+fileimage: modern-java.png </span><span class="org-meta-line"><span class="writegood-duplicates">88% 88%</span></span>
<span class="org-meta-line">#+description: Quick reference for an old-school-cool high-level language ^_^</span>

<span class="org-meta-line">#+macro: src @@latex: \mintinline{java}{$1}@@ @@html: &lt;code class="</span><span class="org-meta-line"><span class="writegood-duplicates">src src</span></span><span class="org-meta-line">-java"&gt;&lt;span style="color: #98971a; font-weight: bold;"&gt;$1&lt;/span&gt;&lt;/code&gt;@@</span>

<span class="comment"># </span><span class="comment"><span class="hl-todo"><span class="custom-2">MA</span></span></span><span class="comment">: Remember to invoke &#8220;blog/preview/disable&#8221; before running &#8220;C-</span><span class="comment"><span class="writegood-duplicates">c C</span></span><span class="comment">-e l o&#8221;!</span>
<span class="comment"># </span><span class="comment"><span class="hl-todo"><span class="custom-2">MA</span></span></span><span class="comment">: Comment-out #+date for PDF generation.</span>
<span class="comment"># +date: &lt;2023-05-10 Wed&gt;</span>
<span class="comment">#</span>
<span class="comment"># </span><span class="comment"><span class="hl-todo"><span class="custom-2">MA</span></span></span><span class="comment">: Comment-out the #+include for HTML Generation</span>
<span class="comment"># +include: CheatSheet/CheatSheetSetup.org</span>

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Stuff to relocate to AlBasmal.org </span><span class="org-level-1"><span class="org-tag">:noexport:</span></span>

<span class="org-meta-line">#+macro: begin-ignore-html #+html: &lt;!--</span>
<span class="org-meta-line">#+macro: end-ignore-html #+html: --&gt;</span>

<span class="org-special-keyword">:details:</span> <span class="org-property-value">makes a &lt;details&gt; block in HTML, and produces no contents in LaTeX.</span>
<span class="org-block-begin-line">#+begin_src emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">org-deftag</span></span><span class="org-block"> details (anchor color)
   </span><span class="org-block"><span class="string">"HTML export a heading as if it were a &lt;details&gt; block; ANCHOR &amp; COLOR are optional
   arguments indicating the anchor for this block as well as the background colour of the resulting block.

For example, in my blog, I would use :details_rememberthis_#F47174: to mark a section as
friendly-soft-red to denote it as an &#8220;advanced&#8221; content that could </span></span><span class="org-block"><span class="string"><span class="writegood-passive-voice">be ignored</span></span></span><span class="org-block"><span class="string">
on a first reading of my article.
Incidentally, `</span></span><span class="org-block"><span class="string"><span class="constant">orange</span></span></span><span class="org-block"><span class="string">' and `#f2b195' are also nice &#8216;</span></span><span class="org-block"><span class="string"><span class="constant">warning</span></span></span><span class="org-block"><span class="string">&#8217; colours.

Sections with this tag are </span></span><span class="org-block"><span class="string"><span class="writegood-weasels">simply</span></span></span><span class="org-block"><span class="string"> hidden for LaTeX exports.
"</span></span><span class="org-block">
   (insert </span><span class="org-block"><span class="string">"\n#+latex: \\iffalse \n#+html:"</span></span><span class="org-block">
           (format </span><span class="org-block"><span class="string">"&lt;div&gt;%s &lt;details class=\"float-child\" style=\"background-color: %s\"&gt;"</span></span><span class="org-block">
                   (</span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> anchor (format </span><span class="org-block"><span class="string">"&lt;a style=\"width: 1%%;float: left; padding: 0px\" id=\"%s\" href=\"#%s\"&gt;&#128279;&lt;/a&gt;"</span></span><span class="org-block"> </span><span class="org-block"><span class="writegood-duplicates">anchor anchor</span></span><span class="org-block">) </span><span class="org-block"><span class="string">""</span></span><span class="org-block">)
                   color)
           </span><span class="org-block"><span class="string">"&lt;summary&gt; &lt;strong&gt; &lt;font face=\"Courier\" size=\"3\" color=\"green\"&gt;"</span></span><span class="org-block">
           (s-replace-regexp </span><span class="org-block"><span class="string">"^</span></span><span class="org-block"><span class="string"><span class="warning">\</span></span></span><span class="org-block"><span class="string">** "</span></span><span class="org-block"> </span><span class="org-block"><span class="string">""</span></span><span class="org-block"> o-heading)
           </span><span class="org-block"><span class="string">"&lt;/font&gt; &lt;/strong&gt; &lt;/summary&gt;"</span></span><span class="org-block">)
   (org-next-visible-heading 1)
   (insert </span><span class="org-block"><span class="string">"#+html: &lt;/details&gt; &lt;/div&gt; \n#+latex: \\fi\n"</span></span><span class="org-block">))
</span><span class="org-block-end-line">#+end_src
</span>
<span class="org-special-keyword">:centerline:</span> <span class="org-property-value">Centerlines a section's title (LaTeX only)</span>
<span class="org-block-begin-line">#+begin_src emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">org-deftag</span></span><span class="org-block"> centerline (NO_ARGS) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="warning"><span class="hl-todo"><span class="custom-1"><span class="hl-todo"><span class="custom-1">TODO</span></span></span></span></span></span><span class="org-block"><span class="comment">: </span></span><span class="org-block"><span class="warning"><span class="hl-todo"><span class="custom-1"><span class="hl-todo"><span class="custom-1">FIXME</span></span></span></span></span></span><span class="org-block"><span class="comment">: The org-deftag macro requires there to be at least one arg, due to how args </span></span><span class="org-block"><span class="comment"><span class="writegood-passive-voice">are looked</span></span></span><span class="org-block"><span class="comment">-up. Fix that to avoid creating a &#8220;let&#8221; when there are no args!
</span></span><span class="org-block">   </span><span class="org-block"><span class="string">"Centerlines a section's title (LaTeX only); otherwise the title </span></span><span class="org-block"><span class="string"><span class="writegood-passive-voice">is left</span></span></span><span class="org-block"><span class="string"> alone for non-LaTeX backends."</span></span><span class="org-block">
   </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">WARNING: There cannot be a space between &#8220;\n%s&#8221; otherwise Org wont recognise the section heading.
</span></span><span class="org-block">   (insert (format </span><span class="org-block"><span class="string">"\n#+latex: \\textbf{\\centerline{%s}} \\iffalse \n%s \n#+latex: \\fi \n"</span></span><span class="org-block">
                   (s-replace-regexp </span><span class="org-block"><span class="string">"^</span></span><span class="org-block"><span class="string"><span class="warning">\</span></span></span><span class="org-block"><span class="string">** "</span></span><span class="org-block"> </span><span class="org-block"><span class="string">""</span></span><span class="org-block"> o-heading)
                   o-heading)))
</span><span class="org-block-end-line">#+end_src
</span>
<span class="org-special-keyword">:noexport_BACKEND:</span> <span class="org-property-value">noexport's a section's title for a given backend</span>
<span class="org-block-begin-line">#+begin_src emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">org-deftag</span></span><span class="org-block"> noexport (backend)
   </span><span class="org-block"><span class="string">"noexports a section's title for a given backend (defaulting to HTML)."</span></span><span class="org-block">
   (</span><span class="org-block"><span class="keyword">unless</span></span><span class="org-block"> backend (</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> backend </span><span class="org-block"><span class="string">"html"</span></span><span class="org-block">))
   (</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> (begin-ignore end-ignore)
     (</span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (equal backend </span><span class="org-block"><span class="string">"pdf"</span></span><span class="org-block">)
         (</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> begin-ignore </span><span class="org-block"><span class="string">"\\iffalse"</span></span><span class="org-block"> end-ignore </span><span class="org-block"><span class="string">"\\fi"</span></span><span class="org-block">))
     (</span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (equal backend </span><span class="org-block"><span class="string">"html"</span></span><span class="org-block">)
         (</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> begin-ignore </span><span class="org-block"><span class="string">"&lt;!--"</span></span><span class="org-block"> end-ignore </span><span class="org-block"><span class="string">"--&gt;"</span></span><span class="org-block">))
   (insert (format </span><span class="org-block"><span class="string">"\n#+%s: %s\n"</span></span><span class="org-block"> backend begin-ignore))
   (insert o-heading)
   (org-next-visible-heading 1)
   (insert (format </span><span class="org-block"><span class="string">"\n#+%s: %s\n"</span></span><span class="org-block"> backend end-ignore))))
</span><span class="org-block-end-line">#+end_src
</span>
<span class="comment"># Remove a org-deftag via</span>
<span class="comment"># (pop org-export-before-parsing-hook)</span>
<span class="comment"># Make this into a macro: org-deftag-remove</span>
