java-cheat-sheet.org.html

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Additions to AlBasmala</span>
<span class="org-drawer">:Add_to_AlBasmala:</span>
Speaking of local variables, let's always load ones we've already marked as safe
---see the bottom of the source of this file for an example of local variables.
( At one point, all my files had locals! )
<span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp :tangle no
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> enable-local-variables </span><span class="org-block"><span class="builtin">:safe</span></span><span class="org-block">)
</span><span class="org-block-end-line">#+END_SRC
</span><span class="org-drawer">:End:</span>

<span class="comment"># </span><span class="comment"><span class="hl-todo"><span class="custom-1">TODO</span></span></span><span class="comment">: AlBasmala's blog/publish-current-article should ensure I'm in the doom-solarized theme, since the current Emacs theme influences the HTML colouring used for code blocks.</span>

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Colourful Source Blocks        </span><span class="org-level-1"><span class="org-tag">:update_init_with_new_info_if_need_be:</span></span>

brew install pygments

<span class="comment"># Then alter path, eg in ~/.zshrc, so that the required Python version for Pygments is accessible.</span>
export PATH="/opt/homebrew/opt/python@3.11/bin/python3.11:$PATH"

--------------------------------------------------------------------------------

  Invoke the following with <span class="org-code">C-</span><span class="org-code"><span class="writegood-duplicates">c C</span></span><span class="org-code">-c</span>, or better yet place it in your <span class="org-link"><a href="https://alhassy.github.io/init/">Emacs configuration</a></span>,
  to ensure references <span class="writegood-passive-voice">are picked</span> up and source code highlighting <span class="writegood-passive-voice">is turned</span> on
  using the Minted package ---which in turn requires the pygmentize system tool.

<span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> org-latex-listings 'minted
      org-latex-packages-alist '((</span><span class="org-block"><span class="string">""</span></span><span class="org-block"> </span><span class="org-block"><span class="string">"minted"</span></span><span class="org-block">))
      org-latex-pdf-process
      '(</span><span class="org-block"><span class="string">"pdflatex -shell-escape -output-directory %o %f"</span></span><span class="org-block">
        </span><span class="org-block"><span class="string">"biber %b"</span></span><span class="org-block">
        </span><span class="org-block"><span class="string">"pdflatex -shell-escape -output-directory %o %f"</span></span><span class="org-block">
        </span><span class="org-block"><span class="string">"pdflatex -shell-escape -output-directory %o %f"</span></span><span class="org-block">))
</span><span class="org-block-end-line">#+END_SRC
</span>
For faster pdf generation, consider invoking:

<span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> org-latex-pdf-process
      '(</span><span class="org-block"><span class="string">"pdflatex -interaction nonstopmode -output-directory %o %f"</span></span><span class="org-block">))
</span><span class="org-block-end-line">#+END_SRC
</span>
By default, Org exports LaTeX using the <span class="org-code">nonstopmode</span> option,
which tries its best to produce a PDF
---which ignores typesetting errors altogether,
and therefore is not necessarily ideal when using LaTeX.

<span class="org-level-1">* LaTeX Extra, Local, Setup  </span><span class="org-level-1"><span class="org-tag">:ignore:</span></span>

<span class="comment"># Empty by default.</span>
<span class="org-meta-line">#+LATEX_HEADER: \def\cheatsheeturl{<a href="http://alhassy.com/java-cheat-sheet">http://alhassy.com/java-cheat-sheet</a>}</span>

<span class="comment"># The following are the defaults &amp; may </span><span class="comment"><span class="writegood-passive-voice">be omitted</span></span><span class="comment">.</span>
<span class="org-meta-line">#+LATEX_HEADER: \def\cheatsheetcols{2}</span>
<span class="org-meta-line">#+LATEX_HEADER: \landscapetrue</span>
<span class="org-meta-line">#+LATEX_HEADER: \def\cheatsheetitemsep{-0.5em}</span>

<span class="comment"># Example unicode declarations; see section &#8220;unicode&#8221; below.</span>
<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#119931;}{\ensuremath{T}}</span>
<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#8853;}{\ensuremath{\oplus}}</span>
<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#8776;}{\ensuremath{\approx}}</span>

<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#119978;}{\ensuremath{\mathcal{O}}}</span>
<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#120008;}{\ensuremath{\mathcal{s}}}</span>
<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#120013;}{\ensuremath{x}}</span>
<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#120014;}{\ensuremath{y}}</span>
<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#696;}{\ensuremath{^y}}</span>
<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#10214;}{\ensuremath{\llbracket}}</span>
<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#10215;}{\ensuremath{\rrbracket}}</span>
<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#8319;}{\ensuremath{^n}}</span>
<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#185;}{\ensuremath{^1}}</span>
<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#8304;}{\ensuremath{^0}}</span>
<span class="org-meta-line">#+LATEX_HEADER: \newunicodechar{&#8332;}{\ensuremath{_=}}</span>

<span class="org-meta-line">#+latex_header: \usepackage{tcolorbox}</span>

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Contents </span><span class="org-level-1"><span class="org-tag">:TOC:QUOTE:myIgnore:</span></span>
<span class="org-block-begin-line">#+BEGIN_QUOTE
</span><span class="org-quote">- </span><span class="org-quote"><span class="org-link"><a href="#extra-local-setup">Extra, Local, Setu</a><a href="#extra-local-setup">p</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#project-goal">Project Goa</a><a href="#project-goal">l</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#cheatsheet-examples">CheatSheet Example</a><a href="#cheatsheet-examples">s</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#why-learn--relearn">Why Learn &amp; Relearn</a><a href="#why-learn--relearn">?</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#getting-started">Getting Starte</a><a href="#getting-started">d</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#what-if-its-not-good-enough">What if it's not good enough</a><a href="#what-if-its-not-good-enough">?</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#what-if-i-want-n-columns-or-non-landscape-or-multiple-formats">What if I want</a><a href="#what-if-i-want-n-columns-or-non-landscape-or-multiple-formats"> </a></span></span><span class="org-quote"><span class="org-link"><span class="org-code"><a href="#what-if-i-want-n-columns-or-non-landscape-or-multiple-formats">N</a></span></span></span><span class="org-quote"><span class="org-link"><a href="#what-if-i-want-n-columns-or-non-landscape-or-multiple-formats"> </a><a href="#what-if-i-want-n-columns-or-non-landscape-or-multiple-formats">columns? Or non-landscape? Or multiple formats</a><a href="#what-if-i-want-n-columns-or-non-landscape-or-multiple-formats">?</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#colourful-source-blocks">Colourful Source Block</a><a href="#colourful-source-blocks">s</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#break">brea</a><a href="#break">k</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#basic-equational-support">Basic Equational Suppor</a><a href="#basic-equational-support">t</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#unicode">Unicod</a><a href="#unicode">e</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#parallel-environment">Parallel Environmen</a><a href="#parallel-environment">t</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#break-1">brea</a><a href="#break-1">k</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#subsection-support">Subsection Suppor</a><a href="#subsection-support">t</a></span></span><span class="org-quote">
  - </span><span class="org-quote"><span class="org-link"><a href="#a-new-child-tree">A new child tre</a><a href="#a-new-child-tree">e</a></span></span><span class="org-quote">
  - </span><span class="org-quote"><span class="org-link"><a href="#another-child-tree">Another child tre</a><a href="#another-child-tree">e</a></span></span><span class="org-quote">
- </span><span class="org-quote"><span class="org-link"><a href="#making-readmeorg">Making ~README.org</a><a href="#making-readmeorg">~</a></span></span><span class="org-quote">
</span><span class="org-block-end-line">#+END_QUOTE
</span>
<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> OG CheatSheet notes</span>
