posts/java-cheat-sheet.org
** ~LaTeX~ commands ↦ ~#+latex: \LaTeX~

  Execute the following block, with ~C-c C-c~ anywhere inside it,
  to hide all LaTeX specific items away so that, for example, the generated HTML
  does not show them.

  #+BEGIN_SRC emacs-lisp :results no
(defun my/replace-in-buffer (this that)
  "Replace every occurance of regexp ‘this’ with ‘that’
   in the current buffer."
   (interactive)
   (save-excursion
    (beginning-of-buffer)
    (while (re-search-forward this nil t)
      (replace-match that)
    ))
)

;; Replace newline, any number of space, then room or vspace with a #+latex: beforehand.
(let (this that)
  (dolist (kp '( ( "^[ ]*\\\\room" . "#+latex: \\\\room")
         ( "^[ ]*\\\\vspace" . "#+latex: \\\\vspace")
         ( "^[ ]*\\\\newpage" . "#+latex: \\\\newpage")
         ( "^[ ]*\\\\columnbreak" . "#+latex: \\\\columnbreak")
         ))
    (setq this (car kp))
    (setq that (cdr kp))
    (my/replace-in-buffer this that)
   )
)
  #+END_SRC

  #+RESULTS:

** Project Goal

  #+latex:  \hspace{-12pt}
  /Use the elegant & intuitive Org-mode syntax to produce exquisite reference sheets./

    - For example, the boxed section headers here are produced from usual Org headers,
      as in ~* my section~; and one may use [[https://github.com/jkitchin/org-ref][org-ref]] for citations, as in nameref:name

    #+latex: \vspace{-1em}
    Read [[https://orgmode.org/worg/org-tutorials/org4beginners.html][Org-mode for beginners]] for a refresher!
    - For more see [[https://orgmode.org/orgguide.pdf][The Compact Org-mode Guide]].

  Execute ~C-c C-e l o~ or ~M-x compile~ to produce a nice looking PDF of your reference sheet.
  # \newline
  # I've bound the latter command to ~C-c C-m~ in [[https://github.com/alhassy/emacs.d][my Emacs setup]] ;-)

#+latex: \vspace{-0em}
#+begin_center
/To learn more, manipulating this source is the way to go!/
#+end_center

:myIgnore:
#+latex: \vspace{1em}
Also, opening this file produces a ~README.md~ ;-)
Which can then be regenerated on-demand with ~f11~.
:End:

*** COMMENT Org-mode Basics

 Read [[https://orgmode.org/worg/org-tutorials/org4beginners.html][Org-mode for beginners]] for a refresher!
   - For more see [[https://orgmode.org/orgguide.pdf][The Compact Org-mode Guide]].

 #+latex: \vspace{1em}

 + Reloading :: To reload a file with updated org settings, press
  ~C-c C-c~ on a settings line --i.e., one beginning with a ~#+~, to reset the
   temporary file cache.

 + Inclusion :: During export, you can include the content of another file.
   - Syntax: ~#+INCLUDE: "⟨fileName⟩" [⟨markup⟩ [⟨language⟩]]~
     * ~markup ::= src | example~
     * ~language ::= C | haskell | emacs-lisp | ⋯~
     * If the markup is not given, the text will be assumed to be in
       Org mode format and will be processed normally; c.f., [[https://orgmode.org/manual/In_002dbuffer-settings.html][Setup files]].

   - To visit the file, ~C-c '~ while the cursor is on the line with the file name.

   - Include only portions of a file by appending with ~:lines "x-y"~ where ~x~ is the first
     line and ~y~ is the second-to-last line. Also ~"-y"~ for upto but not including line ~y~,
     and ~"x-"~ for taking line ~x~ until the end of the file.
      # - Include portions of a file: https://orgmode.org/manual/Include-files.html

** What if I want ~N~ columns? Or non-landscape? Or multiple formats?

 At the top, say after the ~#+INCLUDE: CheatSheet/CheatSheetSetup.org~ line, add
 the following.

#+BEGIN_EXAMPLE org :tangle no
,#+LATEX_HEADER: \def\cheatsheetcols{N}
,#+LATEX_HEADER: \landscapefalse
#+END_EXAMPLE

For example, having three narrow columns is useful for term-heavy or formula heavy sheets.
In contrast, dense sheets may appear less daunting when rendered as single-column in portrait.
Sometimes a double-column portrait is more appropriate.

Press ~C-c C-c~ on the following incantation to produce a single column portrait of the cheat sheet.
#+name: make-portrait
#+BEGIN_SRC emacs-lisp :results none
(with-temp-buffer
    (insert
    "#+EXPORT_FILE_NAME: CheatSheet_Portrait.pdf
     ,#+LATEX_HEADER_EXTRA: \\landscapefalse \\def\\cheatsheetcols{1}
     ,#+INCLUDE: CheatSheet.org
    ")

    (let ((org-export-use-babel nil))
      (org-mode)
      (org-latex-export-to-pdf)
      )
)
#+END_SRC

** spacing break                                             :myIgnore:
#+latex: \columnbreak
** spacing break               :accomodating_multiple_formats:myIgnore:

#+LATEX: \ifnum\cheatsheetcols=1 \newpage \else \columnbreak \fi

