java-cheat-sheet.org.html
<span class="org-hide">*</span><span class="org-level-2">* </span><span class="org-level-2"><span class="org-code">LaTeX</span></span><span class="org-level-2"> commands &#8614; </span><span class="org-level-2"><span class="org-code">#+latex: \LaTeX</span></span>

  Execute the following block, with <span class="org-code">C-</span><span class="org-code"><span class="writegood-duplicates">c C</span></span><span class="org-code">-c</span> anywhere inside it,
  to hide all LaTeX specific items away so that, for example, the generated HTML
  does not show them.

<span class="org-block-begin-line">  #+BEGIN_SRC emacs-lisp :results no
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">defun</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">my/replace-in-buffer</span></span><span class="org-block"> (this that)
  </span><span class="org-block"><span class="doc">"Replace every occurance of regexp &#8216;</span></span><span class="org-block"><span class="doc"><span class="constant">this</span></span></span><span class="org-block"><span class="doc">&#8217; with &#8216;</span></span><span class="org-block"><span class="doc"><span class="constant">that</span></span></span><span class="org-block"><span class="doc">&#8217;
   in the current buffer."</span></span><span class="org-block">
   (</span><span class="org-block"><span class="keyword">interactive</span></span><span class="org-block">)
   (</span><span class="org-block"><span class="keyword">save-excursion</span></span><span class="org-block">
    (beginning-of-buffer)
    (</span><span class="org-block"><span class="keyword">while</span></span><span class="org-block"> (re-search-forward this nil t)
      (replace-match that)
    ))
)

</span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">Replace newline, any number of space, then room or vspace with a #+latex: beforehand.
</span></span><span class="org-block">(</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> (this that)
  (</span><span class="org-block"><span class="keyword">dolist</span></span><span class="org-block"> (kp '( ( </span><span class="org-block"><span class="string">"^[ ]*\\\\room"</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"#+latex: \\\\room"</span></span><span class="org-block">)
         ( </span><span class="org-block"><span class="string">"^[ ]*\\\\vspace"</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"#+latex: \\\\vspace"</span></span><span class="org-block">)
         ( </span><span class="org-block"><span class="string">"^[ ]*\\\\newpage"</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"#+latex: \\\\newpage"</span></span><span class="org-block">)
         ( </span><span class="org-block"><span class="string">"^[ ]*\\\\columnbreak"</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"#+latex: \\\\columnbreak"</span></span><span class="org-block">)
         ))
    (</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> this (car kp))
    (</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> that (cdr kp))
    (my/replace-in-buffer this that)
   )
)
</span><span class="org-block-end-line">  #+END_SRC
</span>
<span class="org-meta-line">  #+RESULTS:</span>

<span class="org-hide">*</span><span class="org-level-2">* Project Goal</span>

<span class="org-meta-line">  #+latex:  \hspace{-12pt}</span>
  <span class="italic">Use the elegant &amp; intuitive Org-mode syntax to produce exquisite reference sheets.</span>

    - For example, the boxed section headers here <span class="writegood-passive-voice">are produced</span> from usual Org headers,
      as in <span class="org-code">* my section</span>; and one may use <span class="org-link"><a href="https://github.com/jkitchin/org-ref">org-ref</a></span> for citations, as in nameref:name

<span class="org-meta-line">    #+latex: \vspace{-1em}</span>
    Read <span class="org-link"><a href="https://orgmode.org/worg/org-tutorials/org4beginners.html">Org-mode for beginners</a></span> for a refresher!
    - For more see <span class="org-link"><a href="https://orgmode.org/orgguide.pdf">The Compact Org-mode Guide</a></span>.

  Execute <span class="org-code">C-</span><span class="org-code"><span class="writegood-duplicates">c C</span></span><span class="org-code">-e l o</span> or <span class="org-code">M-x compile</span> to produce a nice looking PDF of your reference sheet.
<span class="comment">  # \newline</span>
<span class="comment">  # I've bound the latter command to ~C-</span><span class="comment"><span class="writegood-duplicates">c C</span></span><span class="comment">-m~ in <a href="https://github.com/alhassy/emacs.d">my Emacs setup</a> ;-)</span>

<span class="org-meta-line">#+latex: \vspace{-0em}</span>
<span class="org-block-begin-line">#+begin_center
</span><span class="italic">To learn more, manipulating this source is the way to go!</span>
<span class="org-block-end-line">#+end_center
</span>
<span class="org-drawer">:myIgnore:</span>
<span class="org-meta-line">#+latex: \vspace{1em}</span>
Also, opening this file produces a <span class="org-code">README.md</span> ;-)
Which can then <span class="writegood-passive-voice">be regenerated</span> on-demand with <span class="org-code">f11</span>.
<span class="org-drawer">:End:</span>

<span class="org-hide">**</span><span class="org-level-3">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-3"> Org-mode Basics</span>

 Read <span class="org-link"><a href="https://orgmode.org/worg/org-tutorials/org4beginners.html">Org-mode for beginners</a></span> for a refresher!
   - For more see <span class="org-link"><a href="https://orgmode.org/orgguide.pdf">The Compact Org-mode Guide</a></span>.

<span class="org-meta-line"> #+latex: \vspace{1em}</span>

 + <span class="org-list-dt">Reloading ::</span> To reload a file with updated org settings, press
  <span class="org-code">C-</span><span class="org-code"><span class="writegood-duplicates">c C</span></span><span class="org-code">-c</span> on a settings line --i.e., one beginning with a <span class="org-code">#+</span>, to reset the
   temporary file cache.

 + <span class="org-list-dt">Inclusion ::</span> During export, you can include the content of another file.
   - Syntax: <span class="org-code">#+INCLUDE: "&#10216;fileName&#10217;" [&#10216;markup&#10217; [&#10216;language&#10217;]]</span>
     * <span class="org-code">markup ::= src | example</span>
     * <span class="org-code">language ::= C | haskell | emacs-lisp | &#8943;</span>
     * If the markup is not given, the text will <span class="writegood-passive-voice">be assumed</span> to be in
       Org mode format and will <span class="writegood-passive-voice">be processed</span> normally; c.f., <span class="org-link"><a href="https://orgmode.org/manual/In_002dbuffer-settings.html">Setup files</a></span>.

   - To visit the file, <span class="org-code">C-c '</span> while the cursor is on the line with the file name.

   - Include only portions of a file by appending with <span class="org-code">:lines "x-y"</span> where <span class="org-code">x</span> is the first
     line and <span class="org-code">y</span> is the second-to-last line. Also <span class="org-code">"-y"</span> for upto but not including line <span class="org-code">y</span>,
     and <span class="org-code">"x-"</span> for taking line <span class="org-code">x</span> until the end of the file.
<span class="comment">      # - Include portions of a file: <a href="https://orgmode.org/manual/Include-files.html">https://orgmode.org/manual/Include-files.html</a></span>

<span class="org-hide">*</span><span class="org-level-2">* What if I want </span><span class="org-level-2"><span class="org-code">N</span></span><span class="org-level-2"> columns? Or non-landscape? Or multiple formats?</span>

 At the top, say after the <span class="org-code">#+INCLUDE: CheatSheet/CheatSheetSetup.org</span> line, add
 the following.

<span class="org-block-begin-line">#+BEGIN_EXAMPLE org :tangle no
</span><span class="org-block">,#+LATEX_HEADER: \def\cheatsheetcols{N}
,#+LATEX_HEADER: \landscapefalse
</span><span class="org-block-end-line">#+END_EXAMPLE
</span>
For example, having three narrow columns is useful for term-heavy or formula heavy sheets.
In contrast, dense sheets may appear less daunting when rendered as single-column in portrait.
Sometimes a double-column portrait is more appropriate.

Press <span class="org-code">C-</span><span class="org-code"><span class="writegood-duplicates">c C</span></span><span class="org-code">-c</span> on the following incantation to produce a single column portrait of the cheat sheet.
<span class="org-meta-line">#+name: make-portrait</span>
<span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp :results none
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">with-temp-buffer</span></span><span class="org-block">
    (insert
    </span><span class="org-block"><span class="string">"#+EXPORT_FILE_NAME: CheatSheet_Portrait.pdf
     ,#+LATEX_HEADER_EXTRA: \\landscapefalse \\def\\cheatsheetcols{1}
     ,#+INCLUDE: CheatSheet.org
    "</span></span><span class="org-block">)

    (</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> ((org-export-use-babel nil))
      (org-mode)
      (org-latex-export-to-pdf)
      )
)
</span><span class="org-block-end-line">#+END_SRC
</span>
<span class="org-hide">*</span><span class="org-level-2">* spacing break                                             </span><span class="org-level-2"><span class="org-tag">:myIgnore:</span></span>
<span class="org-meta-line">#+latex: \columnbreak</span>
<span class="org-hide">*</span><span class="org-level-2">* spacing break               </span><span class="org-level-2"><span class="org-tag">:accomodating_multiple_formats:myIgnore:</span></span>

<span class="org-meta-line">#+LATEX: \ifnum\cheatsheetcols=1 \newpage \else \columnbreak \fi</span>

<span class="org-hide">*</span><span class="org-level-2">* Unicode</span>
