java-cheat-sheet.org.html

I tend to use a lot of unicode and so this project comes with a unicode
style file. We may add additional support for unicode characters as follows.
<span class="org-block-begin-line">#+BEGIN_EXAMPLE org
</span><span class="org-block">,#+LATEX_HEADER: \newunicodechar{&#8853;}{\ensuremath{\oplus}}
</span><span class="org-block-end-line">#+END_EXAMPLE
</span>
Below we demonstrate that <span class="org-link"><a href="https://frama-c.com/">loops implement finite quantifications</a></span>
by showing how the specification of a loop <span class="writegood-passive-voice">is implemented</span>, unsurprisingly,
using a loop.

<span class="comment"># latex: \vspace{0.3em}</span>
A finite quantification can <span class="writegood-passive-voice">be defined</span> axiomatically
by the empty-range rule and split-off term rules.
Together these form a recursive definition which can <span class="writegood-passive-voice">be phrased</span> as a loop.
<span class="comment">#</span>
<span class="org-block-begin-line">#+begin_parallel org
</span><span class="org-block"><span class="org-block-begin-line">#+BEGIN_SRC c
</span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">/ </span></span></span><span class="org-block"><span class="org-block"><span class="comment">For &#8853; : &#119931; &#8594; &#119931; &#8594; &#119931;,
</span></span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">/ </span></span></span><span class="org-block"><span class="org-block"><span class="comment">fold(A,a,b) &#8776; (&#8853; x:a..b-1 &#8226; A[x])
</span></span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">/*</span></span></span><span class="org-block"><span class="org-block"><span class="comment">@ axiomatic Fold {
  @
  @ logic &#119931;
  @   fold{L}(&#119931; *A, &#8484; a, &#8484; b)
  @   reads a,b,A, A[..] ;
  @
  </span></span></span><span class="org-block"><span class="org-block"><span class="warning">@ axiom foldEmptyRange{L} </span></span></span><span class="org-block"><span class="org-block"><span class="comment">:
  @   &#8704; &#119931; *A, &#8484; a, b; a &#8805; b
  @   &#8658;  fold(A,a,b) &#8801; identity(&#8853;);
  @
  </span></span></span><span class="org-block"><span class="org-block"><span class="warning">@ axiom foldSplitOffTerm{L} </span></span></span><span class="org-block"><span class="org-block"><span class="comment">:
  @   &#8704; &#119931; *A, &#8484; a, b; a &#8804; b
  @   &#8658;     fold(A, a, b+1)
  @        &#8801; fold(A, a, b  ) &#8853; A[b];
  @ }
  @</span></span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">*/</span></span></span><span class="org-block"><span class="org-block">
</span></span><span class="org-block"><span class="org-block-end-line">#+END_SRC
</span></span><span class="org-block"><span class="org-meta-line">#+latex: \columnbreak</span></span><span class="org-block">
</span><span class="org-block"><span class="org-block-begin-line">#+BEGIN_SRC c
</span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">/*</span></span></span><span class="org-block"><span class="org-block"><span class="comment">@ requires \valid(A+(0..N-1));
  @ assigns \nothing;
  @ ensures \result &#8801; fold(A,0,N);
  @</span></span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">*/</span></span></span><span class="org-block"><span class="org-block">
</span></span><span class="org-block"><span class="org-block"><span class="type">&#119931;</span></span></span><span class="org-block"><span class="org-block"> </span></span><span class="org-block"><span class="org-block"><span class="function-name">fold</span></span></span><span class="org-block"><span class="org-block">(</span></span><span class="org-block"><span class="org-block"><span class="type">int</span></span></span><span class="org-block"><span class="org-block"> </span></span><span class="org-block"><span class="org-block"><span class="variable-name">N</span></span></span><span class="org-block"><span class="org-block">, </span></span><span class="org-block"><span class="org-block"><span class="type">&#119931;</span></span></span><span class="org-block"><span class="org-block">* </span></span><span class="org-block"><span class="org-block"><span class="variable-name">A</span></span></span><span class="org-block"><span class="org-block">) {

    </span></span><span class="org-block"><span class="org-block"><span class="type">&#119931;</span></span></span><span class="org-block"><span class="org-block"> </span></span><span class="org-block"><span class="org-block"><span class="variable-name">total</span></span></span><span class="org-block"><span class="org-block"> = identity(&#8853;);

    </span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">/*</span></span></span><span class="org-block"><span class="org-block"><span class="comment">@ loop invariant
             0 &#8804; n &#8804; N
          &#8743;  total &#8801; fold(A,0,n);
      @ loop assigns n, total;
      @ loop variant N - n;
    ,</span></span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">*/</span></span></span><span class="org-block"><span class="org-block">
    </span></span><span class="org-block"><span class="org-block"><span class="keyword">for</span></span></span><span class="org-block"><span class="org-block">(</span></span><span class="org-block"><span class="org-block"><span class="type">int</span></span></span><span class="org-block"><span class="org-block"> </span></span><span class="org-block"><span class="org-block"><span class="variable-name">n</span></span></span><span class="org-block"><span class="org-block"> = 0; n != N; n++)
      total = total &#8853; A[n];
    </span></span><span class="org-block"><span class="org-block"><span class="keyword">return</span></span></span><span class="org-block"><span class="org-block"> total;
}
</span></span><span class="org-block"><span class="org-block-end-line">#+END_SRC
</span></span><span class="org-block-end-line">#+end_parallel
</span>
<span class="org-meta-line">#+latex: \vspace{-0.5em}</span>

This pseudo-code <span class="writegood-passive-voice">is reified</span> by giving concrete values
for <span class="org-code">(&#119931;, &#8853;, identity)</span> such as <span class="org-code">(int, +, 0)</span> or <span class="org-code">(bool, ||, false)</span>.
Any <span class="org-link"><a href="https://en.wikipedia.org/wiki/Monoid">monoid</a></span> will do.

<span class="comment"># We can accomodate for multiple formats.</span>
<span class="org-meta-line">#+LATEX: \ifnum\cheatsheetcols=1 \newpage \else \fi</span>

<span class="org-hide">*</span><span class="org-level-2">* Subsection Support</span>
  Ideally a cheat sheet is not too hierarchical and so a subsection, as in <span class="org-code">** child</span>,
  <span class="writegood-passive-voice">is turned</span> into a rule as follows.

<span class="org-hide">**</span><span class="org-level-3">* A new child tree</span>

  Here is the first child's content.


<span class="org-hide">**</span><span class="org-level-3">* Another child tree</span>

  Here is the sibling's content.

<span class="org-hide">*</span><span class="org-level-2">* spacing COMMENT vfill                                             </span><span class="org-level-2"><span class="org-tag">:myIgnore:</span></span>
\vfill

<span class="org-hide">*</span><span class="org-level-2">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-2"> Negative space                                            </span><span class="org-level-2"><span class="org-tag">:myIgnore:</span></span>
<span class="org-meta-line">#+latex: \vspace{-1em}</span>
<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Emacs Java Repl</span>

(use-package repl-driven-development)

;; Set &#8220;C&#173;x C&#173;j&#8221; to evaluate Java code in a background REPL.
(repl-driven-development [C-x C-j]
                         "jshell --enable-preview -R -ea" ;; enable assertions!
                         :prompt "jshell&gt;")

// Select this Java snippet, then press &#8220;C&#173;x C&#173;j&#8221; to evaluate it
import javax.swing.*;
var frame = new JFrame(){{ setAlwaysOnTop(true); }};
JOptionPane.showMessageDialog(frame, "Super nice!");

<span class="italic">/ REPL result values </span><span class="italic"><span class="writegood-passive-voice">are shown</span></span><span class="italic"> as overlays:
2 + 4 /</span> &#8658; 6

<span class="org-link"><a href="https://github.com/alhassy/repl-driven-development/blob/main/repl-driven-development.el#L31-L44">https://github.com/alhassy/repl-driven-development/blob/main/repl-driven-development.el#L31-L44</a></span>
