posts/java-cheat-sheet.org
* Abstract                                                           :ignore:
:PROPERTIES:
:CUSTOM_ID: Abstract
:END:

#+begin_center
#+html: This is a quick reference of concepts in modern Java.

badge:PDF|colorful_cheat_sheet|success|https://alhassy.com/java-cheat-sheet.pdf|read-the-docs

# badge:license|GNU_3|informational|https://www.gnu.org/licenses/gpl-3.0.en.html|read-the-docs
tweet:https://alhassy.com/java-cheat-sheet
badge:|buy_me_a_coffee|gray|https://www.buymeacoffee.com/alhassy|buy-me-a-coffee
badge:contributions|welcome|green|https://github.com/alhassy/alhassy.github.io/issues
# badge:author|musa_al-hassy|purple|https://alhassy.github.io/|nintendo-3ds
# badge:Warning|Incomplete_DRAFT|red||codeigniter
#+end_center

# @@html: <br> @@

Modern Java is a strongly-typed, eagery evaluated, case sensative, yet
whitespace insensative language. It uses hierarchies of classes/types
to structure data, but also has first-class support for
functional-style algebraic datatypes.

Java programs are made up of ‘classes’, classes contain methods, and methods contain commands.  To just try out a
snippet of code, we can
+ Open a terminal and enter ~jshell~; then enter:
     #+begin_src java
1 + 2 // The jshell lets you try things out!

// Say hello in a fancy way
import javax.swing.*;
JOptionPane.showMessageDialog(new JFrame(), "Hello, World!");

#+end_src

+ Alternatively, in IntelliJ, click /Tools/ then /Groovy Console/ to try things out!
+ Finally, [[http://alhassy.com/making-vscode-itself-a-java-repl.html][VSCode]] allows arbitrary Java code to be sent to a ~jshell~
  in the background(!) and it echoes the result in a friendly way.

# A program cannot consist of only commands. Java commands must be inside functions, and functions must be inside classes.
#
# Imagine a sofa. A sofa cannot exist on its own. It exist in a room somewhere. And a room also cannot exist on its own. A room is located in some house. Or, you could say that the house is divided into rooms, and those rooms contain things.
#
# Java programs are made up of classes, classes contain methods, and methods contain commands.

# A minimal program must consist of at least one class, which must have at least
# one method (function) that marks the program's starting point. This method must
# be named main.

:MWE:
In order to run a java program, it must have a main method as an entry point.

#+begin_src java
  public class LearnJava {
      // In order to run a java program, it must have a main method as an entry
      // point.
      public static void main(String[] args) {
          System.out.println("Hello World!");

          // Use System.out.printf() for easy formatted printing.
          System.out.printf("pi = %.5f", Math.PI); // => pi = 3.14159
      }
  }
#+end_src
:End:

** Web reference                                                     :ignore:

#+macro: begin-ignore-html #+html: <!--
#+macro: end-ignore-html #+html: -->

#+latex: \vspace{-1em}
{{{begin-ignore-html()}}}
To be terse, lots of content is not shown in this [[http://alhassy.com/java-cheat-sheet.pdf][PDF]], but is shown in the *[[https://alhassy.com/java-cheat-sheet][HTML]]*
version.
{{{end-ignore-html()}}}

