java-cheat-sheet.org.html

<span class="org-level-1">* Abstract                                                           </span><span class="org-level-1"><span class="org-tag">:ignore:</span></span>
<span class="org-drawer">:PROPERTIES:</span>
<span class="org-special-keyword">:CUSTOM_ID:</span> <span class="org-property-value">Abstract</span>
<span class="org-drawer">:END:</span>

<span class="org-block-begin-line">#+begin_center
</span>#+html: This is a quick reference of concepts in modern Java.

<a href="badge:PDF|colorful_cheat_sheet|success|https://alhassy.com/java-cheat-sheet.pdf|read-the-docs">badge:PDF|colorful_cheat_sheet|success|https://alhassy.com/java-cheat-sheet.pdf|read-the-docs</a>

# <a href="badge:license|GNU_3|informational|https://www.gnu.org/licenses/gpl-3.0.en.html|read-the-docs">badge:license|GNU_3|informational|https://www.gnu.org/licenses/gpl-3.0.en.html|read-the-docs</a>
<a href="tweet:https://alhassy.com/java-cheat-sheet">tweet:https://alhassy.com/java-cheat-sheet</a>
<a href="badge:|buy_me_a_coffee|gray|https://www.buymeacoffee.com/alhassy|buy-me-a-coffee">badge:|buy_me_a_coffee|gray|https://www.buymeacoffee.com/alhassy|buy-me-a-coffee</a>
<a href="badge:contributions|welcome|green|https://github.com/alhassy/alhassy.github.io/issues">badge:contributions|welcome|green|https://github.com/alhassy/alhassy.github.io/issues</a>
# <a href="badge:author|musa_al-hassy|purple|https://alhassy.github.io/|nintendo-3ds">badge:author|musa_al-hassy|purple|https://alhassy.github.io/|nintendo-3ds</a>
# <a href="badge:Warning|Incomplete_DRAFT|red||codeigniter">badge:Warning|Incomplete_DRAFT|red||codeigniter</a>
<span class="org-block-end-line">#+end_center
</span>
<span class="comment"># @@html: &lt;br&gt; @@</span>

Modern Java is a strongly-typed, eagery evaluated, case sensative, yet
whitespace insensative language. It uses hierarchies of classes/types
to structure data, but also has first-class support for
functional-style algebraic datatypes.

Java programs <span class="writegood-passive-voice">are made</span> up of &#8216;classes&#8217;, classes contain methods, and methods contain commands.  To just try out a
snippet of code, we can
+ Open a terminal and enter <span class="org-code">jshell</span>; then enter:
<span class="org-block-begin-line">     #+begin_src java
</span><span class="org-block">1 + 2 </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">The jshell lets you try things out!
</span></span><span class="org-block">
</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Say hello in a fancy way
</span></span><span class="org-block"><span class="keyword">import</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">javax</span></span><span class="org-block">.</span><span class="org-block"><span class="constant">swing</span></span><span class="org-block">.*;
JOptionPane.showMessageDialog(</span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">JFrame</span></span><span class="org-block">(), </span><span class="org-block"><span class="string">"Hello, World!"</span></span><span class="org-block">);

</span><span class="org-block-end-line">#+end_src
</span>
+ Alternatively, in IntelliJ, click <span class="italic">Tools</span> then <span class="italic">Groovy Console</span> to try things out!
+ Finally, <span class="org-link"><a href="http://alhassy.com/making-vscode-itself-a-java-repl.html">VSCode</a></span> allows arbitrary Java code to <span class="writegood-passive-voice">be sent</span> to a <span class="org-code">jshell</span>
  in the background(!) and it echoes the result in a friendly way.

<span class="comment"># A program cannot consist of only commands. Java commands must be inside functions, and functions must be inside classes.</span>
<span class="comment">#</span>
<span class="comment"># Imagine a sofa. A sofa cannot exist on its own. It exist in a room somewhere. And a room also cannot exist on its own. A room </span><span class="comment"><span class="writegood-passive-voice">is located</span></span><span class="comment"> in </span><span class="comment"><span class="writegood-weasels">some</span></span><span class="comment"> house. Or, you could say that the house </span><span class="comment"><span class="writegood-passive-voice">is divided</span></span><span class="comment"> into rooms, and those rooms contain things.</span>
<span class="comment">#</span>
<span class="comment"># Java programs </span><span class="comment"><span class="writegood-passive-voice">are made</span></span><span class="comment"> up of classes, classes contain methods, and methods contain commands.</span>

<span class="comment"># A minimal program must consist of at least one class, which must have at least</span>
<span class="comment"># one method (function) that marks the program's starting point. This method must</span>
<span class="comment"># </span><span class="comment"><span class="writegood-passive-voice">be named</span></span><span class="comment"> main.</span>

<span class="org-drawer">:MWE:</span>
In order to run a java program, it must have a main method as an entry point.

<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block">  </span><span class="org-block"><span class="keyword">public</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">class</span></span><span class="org-block"> </span><span class="org-block"><span class="type">LearnJava</span></span><span class="org-block"> {
      </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">In order to run a java program, it must have a main method as an entry
</span></span><span class="org-block">      </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">point.
</span></span><span class="org-block">      </span><span class="org-block"><span class="keyword">public</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">static</span></span><span class="org-block"> </span><span class="org-block"><span class="type">void</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">main</span></span><span class="org-block">(</span><span class="org-block"><span class="type">String</span></span><span class="org-block">[] </span><span class="org-block"><span class="variable-name">args</span></span><span class="org-block">) {
          System.out.println(</span><span class="org-block"><span class="string">"Hello World!"</span></span><span class="org-block">);

          </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Use System.out.printf() for </span></span><span class="org-block"><span class="comment"><span class="writegood-weasels">easy</span></span></span><span class="org-block"><span class="comment"> formatted printing.
</span></span><span class="org-block">          System.out.printf(</span><span class="org-block"><span class="string">"pi = %.5f"</span></span><span class="org-block">, </span><span class="org-block"><span class="constant">Math</span></span><span class="org-block">.PI); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">=&gt; pi = 3.14159
</span></span><span class="org-block">      }
  }
</span><span class="org-block-end-line">#+end_src
</span><span class="org-drawer">:End:</span>

<span class="org-hide">*</span><span class="org-level-2">* Web reference                                                     </span><span class="org-level-2"><span class="org-tag">:ignore:</span></span>

<span class="org-meta-line">#+macro: begin-ignore-html #+html: &lt;!--</span>
<span class="org-meta-line">#+macro: end-ignore-html #+html: --&gt;</span>

<span class="org-meta-line">#+latex: \vspace{-1em}</span>
<span class="org-macro">begin-ignore-html()</span>
To be terse, lots of content is not shown in this <span class="org-link"><a href="http://alhassy.com/java-cheat-sheet.pdf">PDF</a></span>, but <span class="writegood-passive-voice">is shown</span> in the <span class="org-link"><span class="bold"><a href="https://alhassy.com/java-cheat-sheet">HTML</a></span></span>
version.
<span class="org-macro">end-ignore-html()</span>
