posts/java-cheat-sheet.org
* The Philosophy of Classes & Interfaces

# Real life objects have properties (e.g., /name, age, etc/) and behaviour (e.g., /eat, bark, fileTaxes, etc/).
Real life objects have properties and behaviour.  For example, my cat
has the properties of /name/ and /age/, and amongst its behaviours are
/sleep/ and /meow/.  However, an apple does not have such features.
*The possible features of an object are understood when we /classify/
it;* e.g., my cat is an animal, whereas an apple is food.  In Java, a
set of features is known as a src_java[:exports code]{class} and
objects having those features are called “objects of that class”.
Just as ~int~ is the type of the value ~12~, we say a class is a
/type/ of an object.
# Or, a class is like a blueprint of an object.

We tend to think in (disjoint, hierarchical) categories; for example,
in my library, a book can be found in one section, either “Sports” or
“History” or “Trees”. So where should books on the history of football
be located? Or books on the history of trees?  My library places such
books under “Sports”, and “Tree” respecively, but then adds a
“historical” *tag* to them.  Likewise, in Java, *to say different
kinds of things have a feature in common, we “tag” them with an*
*src_java[:exports code]{interface}.* (Real life tagging is a also known
as /multi/-~class~-/ificiation/.)
#
# Technically, an interface is essentially a type for classes.  Given an
# arbitrary class, the only way to now what methods it can do is to ask
# what interfaces it performs. In other languages, /interfaces/ are also
# known as /signatures/.
# # And implementations of signatures are known as /algebras/.
#
#
# Since interfaces allow default, and static, methods they also serve as a tool for method re-use: Given implementations of some core methods, a number of derived methods can then be used.

# If private state is needed (e.g., to define a constructor), then
# /abstract classes/ can be used.
# | Abstract class ≈ interface [signatures] + class [private state] |
#
# Which is used /communicates more to others/; e.g., using an abtract
# class communicates that there is some state
#
# | Concept          | Top-level idea                                                      |
# |------------------+---------------------------------------------------------------------|
# | ~class~          | Attributes & properties, backed-up by (possibly hidden) state       |
# | ~record~         | Attributes & properties, completely exposed without any state       |
# |------------------+---------------------------------------------------------------------|
# | ~abstract class~ | Partial implementation, backed-up by state                          |
# | ~interface~      | Reusable methods derived from a handful of unimplemented signatures |
#

#+begin_box "Java's Main Organisational Mechanisms"
|                         |   | With state          | Without state  |
|-------------------------+---+---------------------+----------------|
| Attributes & properties |   | {{{src(class)}}}          | {{{src(record)}}}    |
| Partial implementations |   | {{{src(abstract class)}}} | {{{src(interface)}}} |
#+end_box

** Here is a teaser of nearly all of these packaging mechanisms :details:

#+begin_src java
interface Hospitable {
    String name();   /* unimplemented method signature */
    default void greet() { /* derived, implemented, method */
        System.out.printf("%s says “Welcome!”", name());
    }
}

////////////////////////////////////////////////////////////////////////////////

class Person implements Hospitable {
    String name;
    int age;
    public String name() { return name; }
}

// Actual usage of “Person”:
Person me = new Person();
me.name = "Musa";
me.age = 31;
me.greet();

////////////////////////////////////////////////////////////////////////////////

record Person2(String name, int age) implements Hospitable { }

// Actual usage of “Person2”:
Person2 me = new Person2("Musa", 31);
me.greet();
#+end_src

