java-cheat-sheet.org.html

<span class="org-level-1">* The Philosophy of Classes &amp; Interfaces</span>

<span class="comment"># Real life objects have properties (e.g., /name, age, etc/) and behaviour (e.g., /eat, bark, fileTaxes, etc/).</span>
Real life objects have properties and behaviour.  For example, my cat
has the properties of <span class="italic">name</span> and <span class="italic">age</span>, and amongst its behaviours are
<span class="italic">sleep</span> and <span class="italic">meow</span>.  However, an apple does not have such features.
<span class="bold">The possible features of an object </span><span class="bold"><span class="writegood-passive-voice">are understood</span></span><span class="bold"> when we </span><span class="bold"><span class="italic">classify</span></span><span class="bold">
it;</span> e.g., my cat is an animal, whereas an apple is food.  In Java, a
set of features <span class="writegood-passive-voice">is known</span> as a <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">class</span><span class="shadow"><span class="org-inline-src-block">}</span></span> and
objects having those features <span class="writegood-passive-voice">are called</span> &#8220;objects of that class&#8221;.
Just as <span class="org-code">int</span> is the type of the value <span class="org-code">12</span>, we say a class is a
<span class="italic">type</span> of an object.
<span class="comment"># Or, a class is like a blueprint of an object.</span>

We tend to think in (disjoint, hierarchical) categories; for example,
in my library, a book can <span class="writegood-passive-voice">be found</span> in one section, either &#8220;Sports&#8221; or
&#8220;History&#8221; or &#8220;Trees&#8221;. So where should books on the history of football
<span class="writegood-passive-voice">be located</span>? Or books on the history of trees?  My library places such
books under &#8220;Sports&#8221;, and &#8220;Tree&#8221; respecively, but then adds a
&#8220;historical&#8221; <span class="bold">tag</span> to them.  Likewise, in Java, <span class="bold">to say different
kinds of things have a feature in common, we &#8220;tag&#8221; them with an</span>
<span class="bold">src_java[:exports code]{interface}.</span> (Real life tagging is a also known
as <span class="italic">multi</span>-<span class="org-code">class</span>-<span class="italic">ificiation</span>.)
<span class="comment">#</span>
<span class="comment"># Technically, an interface is essentially a type for classes.  Given an</span>
<span class="comment"># arbitrary class, the only way to now what methods it can do is to ask</span>
<span class="comment"># what interfaces it performs. In other languages, /interfaces/ are also</span>
<span class="comment"># known as /signatures/.</span>
<span class="comment"># # And implementations of signatures </span><span class="comment"><span class="writegood-passive-voice">are known</span></span><span class="comment"> as /algebras/.</span>
<span class="comment">#</span>
<span class="comment">#</span>
<span class="comment"># Since interfaces allow default, and static, methods they also serve as a tool for method re-use: Given implementations of </span><span class="comment"><span class="writegood-weasels">some</span></span><span class="comment"> core methods, a number of derived methods can then </span><span class="comment"><span class="writegood-passive-voice">be used</span></span><span class="comment">.</span>

<span class="comment"># If private state </span><span class="comment"><span class="writegood-passive-voice">is needed</span></span><span class="comment"> (e.g., to define a constructor), then</span>
<span class="comment"># /abstract classes/ can </span><span class="comment"><span class="writegood-passive-voice">be used</span></span><span class="comment">.</span>
<span class="comment"># | Abstract class &#8776; interface [signatures] + class [private state] |</span>
<span class="comment">#</span>
<span class="comment"># Which </span><span class="comment"><span class="writegood-passive-voice">is used</span></span><span class="comment"> /communicates more to others/; e.g., using an abtract</span>
<span class="comment"># class communicates that there is </span><span class="comment"><span class="writegood-weasels">some</span></span><span class="comment"> state</span>
<span class="comment">#</span>
<span class="comment"># | Concept          | Top-level idea                                                      |</span>
<span class="comment"># |------------------+---------------------------------------------------------------------|</span>
<span class="comment"># | ~class~          | Attributes &amp; properties, backed-up by (possibly hidden) state       |</span>
<span class="comment"># | ~record~         | Attributes &amp; properties, </span><span class="comment"><span class="writegood-weasels">completely</span></span><span class="comment"> exposed without any state       |</span>
<span class="comment"># |------------------+---------------------------------------------------------------------|</span>
<span class="comment"># | ~abstract class~ | Partial implementation, backed-up by state                          |</span>
<span class="comment"># | ~interface~      | Reusable methods derived from a handful of unimplemented signatures |</span>
<span class="comment">#</span>

<span class="org-block-begin-line">#+begin_box "Java's Main Organisational Mechanisms"
</span><span class="org-block">|                         |   | With state          | Without state  |
|-------------------------+---+---------------------+----------------|
| Attributes &amp; properties |   | src(class)          | src(record)    |
| Partial implementations |   | src(abstract class) | src(interface) |
</span><span class="org-block-end-line">#+end_box
</span>
<span class="org-hide">*</span><span class="org-level-2">* Here is a teaser of nearly all of these packaging mechanisms </span><span class="org-level-2"><span class="org-tag">:details:</span></span>

<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="keyword">interface</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Hospitable</span></span><span class="org-block"> {
    </span><span class="org-block"><span class="type">String</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">name</span></span><span class="org-block">();   </span><span class="org-block"><span class="comment-delimiter">/* </span></span><span class="org-block"><span class="comment">unimplemented method signature</span></span><span class="org-block"><span class="comment-delimiter"> */</span></span><span class="org-block">
    </span><span class="org-block"><span class="keyword">default</span></span><span class="org-block"> </span><span class="org-block"><span class="type">void</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">greet</span></span><span class="org-block">() { </span><span class="org-block"><span class="comment-delimiter">/* </span></span><span class="org-block"><span class="comment">derived, implemented, method</span></span><span class="org-block"><span class="comment-delimiter"> */</span></span><span class="org-block">
        System.out.printf(</span><span class="org-block"><span class="string">"%s says &#8220;Welcome!&#8221;"</span></span><span class="org-block">, name());
    }
}

</span><span class="org-block"><span class="comment-delimiter">////////////////////////////////////////////////////////////////////////////////</span></span><span class="org-block"><span class="comment">
</span></span><span class="org-block">
</span><span class="org-block"><span class="keyword">class</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Person</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">implements</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Hospitable</span></span><span class="org-block"> {
    </span><span class="org-block"><span class="type">String</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">name</span></span><span class="org-block">;
    </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">age</span></span><span class="org-block">;
    </span><span class="org-block"><span class="keyword">public</span></span><span class="org-block"> </span><span class="org-block"><span class="type">String</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">name</span></span><span class="org-block">() { </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> name; }
}

</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Actual usage of &#8220;Person&#8221;:
</span></span><span class="org-block"><span class="type">Person</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">me</span></span><span class="org-block"> = </span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Person</span></span><span class="org-block">();
me.name = </span><span class="org-block"><span class="string">"Musa"</span></span><span class="org-block">;
me.age = 31;
me.greet();

</span><span class="org-block"><span class="comment-delimiter">////////////////////////////////////////////////////////////////////////////////</span></span><span class="org-block"><span class="comment">
</span></span><span class="org-block">
</span><span class="org-block"><span class="type">record</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">Person2</span></span><span class="org-block">(</span><span class="org-block"><span class="type">String</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">name</span></span><span class="org-block">, </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">age</span></span><span class="org-block">) </span><span class="org-block"><span class="keyword">implements</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Hospitable</span></span><span class="org-block"> { }

</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Actual usage of &#8220;Person2&#8221;:
</span></span><span class="org-block"><span class="type">Person2</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">me</span></span><span class="org-block"> = </span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Person2</span></span><span class="org-block">(</span><span class="org-block"><span class="string">"Musa"</span></span><span class="org-block">, 31);
me.greet();
</span><span class="org-block-end-line">#+end_src
</span>
