posts/java-cheat-sheet.org
** “Interfaces are the types of classes” :details:

A /module/ is
a bunch of utilities that can be defined from some shared set of parameters.
Those utilities can be thought of as an interface 𝑰.
/Then a module is a function from parameters to an anonymous implementation of an interface./
However, functions that return implementations are essentially records/classes that implement
the interface; i.e.,

#+begin_src java
   𝑰 R(params) { return new 𝑰() { 𝑰_𝑶𝑽𝑬𝑹𝑰𝑫𝑬𝑺 }; } // module-as-function
≈  record R(params) implements 𝑰 { 𝑰_𝑶𝑽𝑬𝑹𝑰𝑫𝑬𝑺 }; // module-as-record
#+end_src

This equation justifies the phrase “interfaces are the types of records/classes”
since a record declaration (i.e., the right side of the “≈”)
can be converted to an (abstract) module (of type 𝑰) ---i.e., the left side of the “≈”.

** Algebraic Data Types :ignore:details:

Finally, suppose there's something you want to do /and/ there are a number of
ways/configurations to get it done.  You could write it as a method in
a src_java[:exports code]{class} with a bunch of ~if~'s to account for
all of those ways.  Better would be to create an interface, then have
a bunch of classes that implement it: One class for each possible
implementation. Finally, if you know /all/ configurations, you
can move those classes /into/ the definition of the interface
and make it /sealed/: This is known as an /algebraic data-type/,
whose kill-feature is that you can use src_java[:exports code]{switch}
to pattern match on instances of the interface.

# E.g., the action could be to emit a message to the user; e.g., via dialog or via toast notice or via a notification banner.


# --------------------------------------------------------------------------------

# These days we tend to prefer interface (like-a) relationships over class hierarchy (is-a) relationships
#
# Interfaces are still inheritance and an "is a" relationship. An ArrayList 'is a' List. A HashMap 'is a' Map.
#
# While people should prefer interfaces over abstract classes for the simple reason you can't only extend a single class, it's really not a different "type" of relationship.
#
# IMO there definitely is a different 'type' of relationship with
# interface implementation - at its core it is just the decoupling of
# a commitment to a contract from implementation choices - which does
# allow a commitment to multiple contracts (by either reimplementing
# them or using composition and delegation), but it isn't the primary
# reason we use them (considering the number of types that extend
# Object and implement a single interface).

