java-cheat-sheet.org.html
<span class="org-hide">*</span><span class="org-level-2">* &#8220;Interfaces are the types of classes&#8221; </span><span class="org-level-2"><span class="org-tag">:details:</span></span>

A <span class="italic">module</span> is
a bunch of utilities that can <span class="writegood-passive-voice">be defined</span> from <span class="writegood-weasels">some</span> shared set of parameters.
Those utilities can <span class="writegood-passive-voice">be thought</span> of as an interface &#119920;.
<span class="italic">Then a module is a function from parameters to an anonymous implementation of an interface.</span>
However, functions that return implementations are essentially records/classes that implement
the interface; i.e.,

<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block">   </span><span class="org-block"><span class="type">&#119920;</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">R</span></span><span class="org-block">(</span><span class="org-block"><span class="type">params</span></span><span class="org-block">) { </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">&#119920;</span></span><span class="org-block">() { &#119920;_&#119926;&#119933;&#119916;&#119929;&#119920;&#119915;&#119916;&#119930; }; } </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">module-as-function
</span></span><span class="org-block">&#8776;  record R(params) </span><span class="org-block"><span class="keyword">implements</span></span><span class="org-block"> </span><span class="org-block"><span class="type">&#119920;</span></span><span class="org-block"> { &#119920;_&#119926;&#119933;&#119916;&#119929;&#119920;&#119915;&#119916;&#119930; }; </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">module-as-record
</span></span><span class="org-block-end-line">#+end_src
</span>
This equation justifies the phrase &#8220;interfaces are the types of records/classes&#8221;
since a record declaration (i.e., the right side of the &#8220;&#8776;&#8221;)
can <span class="writegood-passive-voice">be converted</span> to an (abstract) module (of type &#119920;) ---i.e., the left side of the &#8220;&#8776;&#8221;.

<span class="org-hide">*</span><span class="org-level-2">* Algebraic Data Types </span><span class="org-level-2"><span class="org-tag">:ignore:details:</span></span>

Finally, suppose there's something you want to do <span class="italic">and</span> there <span class="writegood-weasels">are a number</span> of
ways/configurations to get it done.  You could write it as a method in
a <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">class</span><span class="shadow"><span class="org-inline-src-block">}</span></span> with a bunch of <span class="org-code">if</span>'s to account for
all of those ways.  Better would be to create an interface, then have
a bunch of classes that implement it: One class for each possible
implementation. Finally, if you know <span class="italic">all</span> configurations, you
can move those classes <span class="italic">into</span> the definition of the interface
and make it <span class="italic">sealed</span>: This <span class="writegood-passive-voice">is known</span> as an <span class="italic">algebraic data-type</span>,
whose kill-feature is that you can use <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">switch</span><span class="shadow"><span class="org-inline-src-block">}</span></span>
to pattern match on instances of the interface.

<span class="comment"># E.g., the action could be to emit a message to the user; e.g., via dialog or via toast notice or via a notification banner.</span>


<span class="comment"># --------------------------------------------------------------------------------</span>

<span class="comment"># These days we tend to prefer interface (like-a) relationships over class hierarchy (is-a) relationships</span>
<span class="comment">#</span>
<span class="comment"># Interfaces are still inheritance and an "is a" relationship. An ArrayList 'is a' List. A HashMap 'is a' Map.</span>
<span class="comment">#</span>
<span class="comment"># While people should prefer interfaces over abstract classes for the </span><span class="comment"><span class="writegood-weasels">simple</span></span><span class="comment"> reason you can't only extend a single class, it's really not a different "type" of relationship.</span>
<span class="comment">#</span>
<span class="comment"># IMO there definitely is a different 'type' of relationship with</span>
<span class="comment"># interface implementation - at its core it is just the decoupling of</span>
<span class="comment"># a commitment to a contract from implementation choices - which does</span>
<span class="comment"># allow a commitment to multiple contracts (by either reimplementing</span>
<span class="comment"># them or using composition and delegation), but it isn't the primary</span>
<span class="comment"># reason we use them (considering the number of types that extend</span>
<span class="comment"># Object and implement a single interface).</span>
