posts/java-cheat-sheet.org
** ADT example :details_ADTs:

An example 3-level hierarchy that can be easily represented with ADTs
rather than a traditional class hierarchy.

#+BEGIN_SRC dot :file ../images/monsters-adt.png :exports results
digraph {
 bgcolor="transparent"
 Monster -> {Flying, Ground};
 Flying -> {Griffin, Pegasus};
 Ground -> {Ogre};
}
#+END_SRC

#+html: <center><image src="../images/monsters-adt.png" width="50%" height="50%" /> </center>

# /* Monster ⟶ {Flying ⟶ {Griffin, Pegasus}, Ground ⟶ {Ogre}} */
#+begin_src java
sealed interface Monster {

    sealed interface Flying extends Monster { }
    record Griffin() implements Flying { }
    record Pegasus() implements Flying { }

    sealed interface Ground extends Monster { }
    record Ogre() implements Ground { }
}
#+end_src

Then we can actually use this new type as follows:
#+begin_src java
private static String glare(Monster m) {
    return switch (m) {
        case Monster.Griffin it -> "Roar";
        case Monster.Pegasus it -> "HeeHaw";
        case Monster.Ogre it -> "Grrr";
    };
}

glare(new Monster.Flying.Griffin()); // "Roar"
#+end_src

Or only look at the ~Flying~ sub-type:
#+begin_src java
private static int attackDamage(Monster.Flying f) {
    return switch (f) {
        case Monster.Flying.Griffin it -> 120;
        case Monster.Flying.Pegasus it -> 60;
    };
}

attackDamage(new Monster.Pegasus()); // 60
#+end_src

** COMMENT Mathematically, what does <code>class</code> “mean”? :details_CategoryTheory:

Mathematically, a programming language (i.e., a model of computation with types and programs) is represented by a
[[https://alhassy.com/PathCat][category]] ---see [[https://www.cs.ox.ac.uk/people/jeremy.gibbons/publications/acmmpc-calcfp.pdf][Calculating Functional Programs]] §1.4.  In such a setting, /a class denotes a pointed [[https://stackoverflow.com/questions/16015020/what-does-coalgebra-mean-in-the-context-of-programming][co-algebra]]/ $(𝒪, ℴ₀,
𝒸 : 𝒪 → 𝒯(𝒪))$: “classes as modules” is captured by 𝒪 (“the set of objects”), “classes as structure” is captured by the
co-algebra 𝒸, a “new object” is the point ℴ₀, and the functor 𝒯 is the ‘signature/type’ of the class (i.e., its
properties and methods).

* Reads :details:

+ [[https://www.mooc.fi/en/#courses][“MOOC” Massive Open Online Course - University of Helsinki]]
  - Useful for learning Java, Python, Haskell, JavaScript.
  - I highly reccommend their [[https://fullstackopen.com/en/][“full stack”]] course on web development, with JS!
  # - Extremely hands-on course for Java, perfect for indepedent learning.
+ Effective Java, 3rd Edition by Joshua Bloch
+ Seriously Good Software Code that Works, Survives, and Wins
+ Functional Programming in Java Harnessing the Power of Java 8 Lambda Expressions
+ Java Generics and Collections Speed Up the Java Development Process
+ Java 8 Lambdas Pragmatic Functional Programming - Richard Warburton
# + Java Puzzlers Traps, Pitfalls, and Corner Cases by Joshua Bloch

** COMMENT https://hyperskill.org/join/dee0c003                       :5_months_free:

By this link up to 5 months free

