java-cheat-sheet.org.html

<span class="org-hide">*</span><span class="org-level-2">* ADT example </span><span class="org-level-2"><span class="org-tag">:details_ADTs:</span></span>

An example 3-level hierarchy that can be <span class="writegood-weasels">easily</span> represented with ADTs
rather than a traditional class hierarchy.

<span class="org-block-begin-line">#+BEGIN_SRC dot :file ../images/monsters-adt.png :exports results
</span><span class="org-block">digraph {
 bgcolor="transparent"
 Monster -&gt; {Flying, Ground};
 Flying -&gt; {Griffin, Pegasus};
 Ground -&gt; {Ogre};
}
</span><span class="org-block-end-line">#+END_SRC
</span>
<span class="org-meta-line">#+html: &lt;center&gt;&lt;image src="../images/monsters-adt.png" width="50%" height="50%" /&gt; &lt;/center&gt;</span>

<span class="comment"># /* Monster &#10230; {Flying &#10230; {Griffin, Pegasus}, Ground &#10230; {Ogre}} */</span>
<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="type">sealed</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">interface</span></span><span class="org-block"> Monster {

    </span><span class="org-block"><span class="type">sealed</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">interface</span></span><span class="org-block"> Flying </span><span class="org-block"><span class="keyword">extends</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Monster</span></span><span class="org-block"> { }
    </span><span class="org-block"><span class="type">record</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">Griffin</span></span><span class="org-block">() </span><span class="org-block"><span class="keyword">implements</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Flying</span></span><span class="org-block"> { }
    </span><span class="org-block"><span class="type">record</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">Pegasus</span></span><span class="org-block">() </span><span class="org-block"><span class="keyword">implements</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Flying</span></span><span class="org-block"> { }

    </span><span class="org-block"><span class="type">sealed</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">interface</span></span><span class="org-block"> Ground </span><span class="org-block"><span class="keyword">extends</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Monster</span></span><span class="org-block"> { }
    </span><span class="org-block"><span class="type">record</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">Ogre</span></span><span class="org-block">() </span><span class="org-block"><span class="keyword">implements</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Ground</span></span><span class="org-block"> { }
}
</span><span class="org-block-end-line">#+end_src
</span>
Then we can actually use this new type as follows:
<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="keyword">private</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">static</span></span><span class="org-block"> </span><span class="org-block"><span class="type">String</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">glare</span></span><span class="org-block">(</span><span class="org-block"><span class="type">Monster</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">m</span></span><span class="org-block">) {
    </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">switch</span></span><span class="org-block"> (m) {
        </span><span class="org-block"><span class="keyword">case</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">Monster</span></span><span class="org-block">.Griffin it -&gt; </span><span class="org-block"><span class="string">"Roar"</span></span><span class="org-block">;
        </span><span class="org-block"><span class="keyword">case</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">Monster</span></span><span class="org-block">.Pegasus it -&gt; </span><span class="org-block"><span class="string">"HeeHaw"</span></span><span class="org-block">;
        </span><span class="org-block"><span class="keyword">case</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">Monster</span></span><span class="org-block">.Ogre it -&gt; </span><span class="org-block"><span class="string">"Grrr"</span></span><span class="org-block">;
    };
}

glare(</span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">Monster</span></span><span class="org-block">.</span><span class="org-block"><span class="constant">Flying</span></span><span class="org-block">.</span><span class="org-block"><span class="type">Griffin</span></span><span class="org-block">()); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">"Roar"
</span></span><span class="org-block-end-line">#+end_src
</span>
Or only look at the <span class="org-code">Flying</span> sub-type:
<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="keyword">private</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">static</span></span><span class="org-block"> </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">attackDamage</span></span><span class="org-block">(</span><span class="org-block"><span class="constant">Monster</span></span><span class="org-block">.</span><span class="org-block"><span class="type">Flying</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">f</span></span><span class="org-block">) {
    </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">switch</span></span><span class="org-block"> (f) {
        </span><span class="org-block"><span class="keyword">case</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">Monster</span></span><span class="org-block">.</span><span class="org-block"><span class="constant">Flying</span></span><span class="org-block">.Griffin it -&gt; 120;
        </span><span class="org-block"><span class="keyword">case</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">Monster</span></span><span class="org-block">.</span><span class="org-block"><span class="constant">Flying</span></span><span class="org-block">.Pegasus it -&gt; 60;
    };
}

attackDamage(</span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">Monster</span></span><span class="org-block">.</span><span class="org-block"><span class="type">Pegasus</span></span><span class="org-block">()); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">60
</span></span><span class="org-block-end-line">#+end_src
</span>
<span class="org-hide">*</span><span class="org-level-2">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-2"> Mathematically, what does &lt;code&gt;class&lt;/code&gt; &#8220;mean&#8221;? </span><span class="org-level-2"><span class="org-tag">:details_CategoryTheory:</span></span>

Mathematically, a programming language (i.e., a model of computation with types and programs) <span class="writegood-passive-voice">is represented</span> by a
<span class="org-link"><a href="https://alhassy.com/PathCat">category</a></span> ---see <span class="org-link"><a href="https://www.cs.ox.ac.uk/people/jeremy.gibbons/publications/acmmpc-calcfp.pdf">Calculating Functional Programs</a></span> &#167;1.4.  In such a setting, <span class="italic">a class denotes a pointed </span><span class="org-link"><span class="italic"><a href="https://stackoverflow.com/questions/16015020/what-does-coalgebra-mean-in-the-context-of-programming">co-algebra</a></span></span><span class="org-latex-and-related"> $(&#119978;, &#8500;&#8320;,
&#119992; : &#119978; &#8594; &#119983;(&#119978;))$:</span> &#8220;classes as modules&#8221; <span class="writegood-passive-voice">is captured</span> by &#119978; (&#8220;the set of objects&#8221;), &#8220;classes as structure&#8221; <span class="writegood-passive-voice">is captured</span> by the
co-algebra &#119992;, a &#8220;new object&#8221; is the point &#8500;&#8320;, and the functor &#119983; is the &#8216;signature/type&#8217; of the class (i.e., its
properties and methods).

<span class="org-level-1">* Reads </span><span class="org-level-1"><span class="org-tag">:details:</span></span>

+ <span class="org-link"><a href="https://www.mooc.fi/en/#courses">&#8220;MOOC&#8221; Massive Open Online Course - University of Helsinki</a></span>
  - Useful for learning Java, Python, Haskell, JavaScript.
  - I highly reccommend their <span class="org-link"><a href="https://fullstackopen.com/en/">&#8220;full stack&#8221;</a></span> course on web development, with JS!
<span class="comment">  # - </span><span class="comment"><span class="writegood-weasels">Extremely</span></span><span class="comment"> hands-on course for Java, perfect for indepedent learning.</span>
+ Effective Java, 3rd Edition by Joshua Bloch
+ Seriously Good Software Code that Works, Survives, and Wins
+ Functional Programming in Java Harnessing the Power of Java 8 Lambda Expressions
+ Java Generics and Collections Speed Up the Java Development Process
+ Java 8 Lambdas Pragmatic Functional Programming - Richard Warburton
<span class="comment"># + Java Puzzlers Traps, Pitfalls, and Corner Cases by Joshua Bloch</span>

<span class="org-hide">*</span><span class="org-level-2">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-2"> </span><span class="org-level-2"><span class="org-link"><a href="https://hyperskill.org/join/dee0c003">https://hyperskill.org/join/dee0c00</a><a href="https://hyperskill.org/join/dee0c003">3</a></span></span><span class="org-level-2">                       </span><span class="org-level-2"><span class="org-tag">:5_months_free:</span></span>

By this link up to 5 months free
