posts/java-cheat-sheet.org
** COMMENT More Reads

https://www.youtube.com/watch?v=-JYLuv7mmxM
Excellent 6-part series by Abdul Bari

https://www.baeldung.com/java-8-streams

https://www.capitalone.com/tech/software-engineering/java-streams-explained-simple-example/

https://stackify.com/streams-guide-java-8/

https://livebook.manning.com/book/modern-java-in-action/chapter-5/

https://www.digitalocean.com/community/tutorials/java-8-stream

https://www.oracle.com/technical-resources/articles/java/ma14-java-se-8-streams.html

+ Leetcode is about algorithms, mooc about learning coding and to program.
  - Java MOOC. It is a purely introductory course to programming (with Java).
  - [Enjoyable!] Massive Open Online Course - Java University of Helsinki

    oh my god i LOVE mooc. I only did the course to refresh my memory, but i learned so much more than i did in school.

    I also finished it in four weeks. The course didnt burn me out which was surprising. I think its because the lessons were very clear and easy to understand.

    probably the best beginner course ive ever taken

  - The university of helsinki (the guys behind mooc.fi) has a web dev
    with java course online for free, including exercises. It is only
    available in finnish, though google translate does a passable job.

    https://web-palvelinohjelmointi-21.mooc.fi/osa-1

+ Computer Science: An Interdisciplinary Approach

   It’s a great textbook! You can use the web book site as a
  supplement or just read from the book. The concepts are clearly
  explained and there are a ton of useful exercises that are difficult
  and certainly give you many “a ha” moments.

+ https://edabit.com/

+ Codingbat.com has easier questions, that is a good starter for leetcode IMO

  CodingBat has really good exercises with multiple test cases (to
  help you write unit tests and debug) from very basic to really
  challenging, and all the way from booleans and substrings to
  lambdas, streams and recursion.

+ [Free] Practice-it is, along with CodingBat, one of the best
  websites for beginners to practice and consolidate the fundamentals
  of Java. It has more than 600 exercises grouped by different
  categories. In my case, it has helped me to strengthen the knowledge
  acquired and to continue advancing with this wonderful programming
  language.

  https://practiceit.cs.washington.edu/

+ https://cscx.org/
  Computer Science by Example (cscx.org) is a collection of short programming exercises.

+ Start with CodeWars. Select only level 8 problems and sort by most completed.

+ https://www.coursera.org/learn/algorithms-part1?action=enroll
+ https://www.coursera.org/learn/algorithms-part2
+ https://programmedlessons.org/Java9/index.html#part03
+ https://hyperskill.org/tracks

  You can get 9 weeks free by registering with a new email address if you don't mind testing out of concepts you've already completed

  Hyperskill is a fairly new resource from Jetbrains (the maker of IntelliJ)

   It is based on learning projects, then having prerequisite lessons that need to be learned to successfully complete the project.


+ https://www.codility.com/
+ https://exercism.org/tracks/java
+ https://www.youtube.com/playlist?list=PLE7E8B7F4856C9B19
+ https://docs.oracle.com/javase/tutorial/index.html

I recomend these books:

Java Concurrency in Practice by Brian Goetz
Java Performance - In-Depth Advice for Tuning and Programming Java 8, 11, and Beyond



--------------------------------------------------------------------------------

# Mention that JS, like Python, has decoraters with @-syntax and generators with yield-syntax.
# The book Eloquent Javascript has useful stuff to revisit.
#
# http://es6-features.org/

+ https://eloquentjavascript.net/

  /This is a book about JavaScript, programming, and the wonders of the digital./

  Many of the examples in this cheatsheet were taken from this excellent read!

+ https://exploringjs.com/index.html

  /Exploring JS: Free JavaScript books for programmers/
  ---E.g., “JavaScript for impatient programmers”

+ https://www.w3schools.com/js/

  /This tutorial will teach you JavaScript from basic to advanced./

  Other bite-sized lessions can be found at: https://masteringjs.io/fundamentals

+ https://learnxinyminutes.com/docs/javascript/

  /Take a whirlwind tour of your next favorite language. Community-driven!/

+ https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference

  /The JavaScript reference serves as a repository of facts about the JavaScript
  language. The entire language is described here in detail./

+ https://github.com/you-dont-need/You-Dont-Need-Loops

  /Avoid The One-off Problem, Infinite Loops, Statefulness and Hidden intent./

Head First Java: A Brain-Friendly Guide 3rd Edition

runestone academy - https://runestone.academy/ns/books/published/csawesome/index.html
This is what I’m using, it simplifies Java into bite size lessons and has immediate hands on practice with coding.

* newpage :ignore:
#+latex: \columnbreak
