java-cheat-sheet.org.html

<span class="org-hide">*</span><span class="org-level-2">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-2"> More Reads</span>

<span class="org-link"><a href="https://www.youtube.com/watch?v=-JYLuv7mmxM">https://www.youtube.com/watch?v=-JYLuv7mmxM</a></span>
<span class="writegood-weasels">Excellent</span> 6-part series by Abdul Bari

<span class="org-link"><a href="https://www.baeldung.com/java-8-streams">https://www.baeldung.com/java-8-streams</a></span>

<span class="org-link"><a href="https://www.capitalone.com/tech/software-engineering/java-streams-explained-simple-example/">https://www.capitalone.com/tech/software-engineering/java-streams-explained-</a></span><span class="org-link"><span class="writegood-weasels"><a href="https://www.capitalone.com/tech/software-engineering/java-streams-explained-simple-example/">simple</a></span></span><span class="org-link"><a href="https://www.capitalone.com/tech/software-engineering/java-streams-explained-simple-example/">-example/</a></span>

<span class="org-link"><a href="https://stackify.com/streams-guide-java-8/">https://stackify.com/streams-guide-java-8/</a></span>

<span class="org-link"><a href="https://livebook.manning.com/book/modern-java-in-action/chapter-5/">https://livebook.manning.com/book/modern-java-in-action/chapter-5/</a></span>

<span class="org-link"><a href="https://www.digitalocean.com/community/tutorials/java-8-stream">https://www.digitalocean.com/community/tutorials/java-8-stream</a></span>

<span class="org-link"><a href="https://www.oracle.com/technical-resources/articles/java/ma14-java-se-8-streams.html">https://www.oracle.com/technical-resources/articles/java/ma14-java-se-8-streams.html</a></span>

+ Leetcode is about algorithms, mooc about learning coding and to program.
  - Java MOOC. It is a purely introductory course to programming (with Java).
  - [Enjoyable!] Massive Open Online Course - Java University of Helsinki

    oh my god i LOVE mooc. I only did the course to refresh my memory, but i learned so much more than i did in school.

    I also finished it in four weeks. The course didnt burn me out which was surprising. I think its because the lessons were <span class="writegood-weasels">very</span> clear and <span class="writegood-weasels">easy</span> to understand.

    <span class="writegood-weasels">probably</span> the best beginner course ive ever taken

  - The university of helsinki (the guys behind mooc.fi) has a web dev
    with java course online for free, including exercises. It is only
    available in finnish, though google translate does a passable job.

    <span class="org-link"><a href="https://web-palvelinohjelmointi-21.mooc.fi/osa-1">https://web-palvelinohjelmointi-21.mooc.fi/osa-1</a></span>

+ Computer Science: An Interdisciplinary Approach

   It&#8217;s a great textbook! You can use the web book site as a
  supplement or just read from the book. The concepts are <span class="writegood-weasels">clearly</span>
  explained and there are a ton of useful exercises that are difficult
  and certainly give you <span class="writegood-weasels">many</span> &#8220;a ha&#8221; moments.

+ <span class="org-link"><a href="https://edabit.com/">https://edabit.com/</a></span>

+ Codingbat.com has easier questions, that is a good starter for leetcode IMO

  CodingBat has really good exercises with multiple test cases (to
  help you write unit tests and debug) from <span class="writegood-weasels">very</span> basic to really
  challenging, and all the way from booleans and substrings to
  lambdas, streams and recursion.

+ [Free] Practice-it is, along with CodingBat, one of the best
  websites for beginners to practice and consolidate the fundamentals
  of Java. It has more than 600 exercises grouped by different
  categories. In my case, it has helped me to strengthen the knowledge
  acquired and to continue advancing with this wonderful programming
  language.

  <span class="org-link"><a href="https://practiceit.cs.washington.edu/">https://practiceit.cs.washington.edu/</a></span>

+ <span class="org-link"><a href="https://cscx.org/">https://cscx.org/</a></span>
  Computer Science by Example (cscx.org) is a collection of short programming exercises.

+ Start with CodeWars. Select only level 8 problems and sort by most completed.

+ <span class="org-link"><a href="https://www.coursera.org/learn/algorithms-part1?action=enroll">https://www.coursera.org/learn/algorithms-part1?action=enroll</a></span>
+ <span class="org-link"><a href="https://www.coursera.org/learn/algorithms-part2">https://www.coursera.org/learn/algorithms-part2</a></span>
+ <span class="org-link"><a href="https://programmedlessons.org/Java9/index.html#part03">https://programmedlessons.org/Java9/index.html#part03</a></span>
+ <span class="org-link"><a href="https://hyperskill.org/tracks">https://hyperskill.org/tracks</a></span>

  You can get 9 weeks free by registering with a new email address if you don't mind testing out of concepts you've already completed

  Hyperskill is a <span class="writegood-weasels">fairly</span> new resource from Jetbrains (the maker of IntelliJ)

   It <span class="writegood-passive-voice">is based</span> on learning projects, then having prerequisite lessons that need to <span class="writegood-passive-voice">be learned</span> to successfully complete the project.


+ <span class="org-link"><a href="https://www.codility.com/">https://www.codility.com/</a></span>
+ <span class="org-link"><a href="https://exercism.org/tracks/java">https://exercism.org/tracks/java</a></span>
+ <span class="org-link"><a href="https://www.youtube.com/playlist?list=PLE7E8B7F4856C9B19">https://www.youtube.com/playlist?list=PLE7E8B7F4856C9B19</a></span>
+ <span class="org-link"><a href="https://docs.oracle.com/javase/tutorial/index.html">https://docs.oracle.com/javase/tutorial/index.html</a></span>

I recomend these books:

Java Concurrency in Practice by Brian Goetz
Java Performance - In-Depth Advice for Tuning and Programming Java 8, 11, and Beyond



--------------------------------------------------------------------------------

<span class="comment"># Mention that JS, like Python, has decoraters with @-syntax and generators with yield-syntax.</span>
<span class="comment"># The book Eloquent Javascript has useful stuff to revisit.</span>
<span class="comment">#</span>
<span class="comment"># <a href="http://es6-features.org/">http://es6-features.org/</a></span>

+ <span class="org-link"><a href="https://eloquentjavascript.net/">https://eloquentjavascript.net/</a></span>

  <span class="italic">This is a book about JavaScript, programming, and the wonders of the digital.</span>

  <span class="writegood-weasels">Many</span> of the examples in this cheatsheet <span class="writegood-passive-voice">were taken</span> from this <span class="writegood-weasels">excellent</span> read!

+ <span class="org-link"><a href="https://exploringjs.com/index.html">https://exploringjs.com/index.html</a></span>

  <span class="italic">Exploring JS: Free JavaScript books for programmers</span>
  ---E.g., &#8220;JavaScript for impatient programmers&#8221;

+ <span class="org-link"><a href="https://www.w3schools.com/js/">https://www.w3schools.com/js/</a></span>

  <span class="italic">This tutorial will teach you JavaScript from basic to advanced.</span>

  Other bite-sized lessions can <span class="writegood-passive-voice">be found</span> at: <span class="org-link"><a href="https://masteringjs.io/fundamentals">https://masteringjs.io/fundamentals</a></span>

+ <span class="org-link"><a href="https://learnxinyminutes.com/docs/javascript/">https://learnxinyminutes.com/docs/javascript/</a></span>

  <span class="italic">Take a whirlwind tour of your next favorite language. Community-driven!</span>

+ <span class="org-link"><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference</a></span>

  <span class="italic">The JavaScript reference serves as a repository of facts about the JavaScript
  language. The entire language </span><span class="italic"><span class="writegood-passive-voice">is described</span></span><span class="italic"> here in detail.</span>

+ <span class="org-link"><a href="https://github.com/you-dont-need/You-Dont-Need-Loops">https://github.com/you-dont-need/You-Dont-Need-Loops</a></span>

  <span class="italic">Avoid The One-off Problem, Infinite Loops, Statefulness and Hidden intent.</span>

Head First Java: A Brain-Friendly Guide 3rd Edition

runestone academy - <span class="org-link"><a href="https://runestone.academy/ns/books/published/csawesome/index.html">https://runestone.academy/ns/books/published/csawesome/index.html</a></span>
This is what I&#8217;m using, it simplifies Java into bite size lessons and has immediate hands on practice with coding.

<span class="org-level-1">* newpage </span><span class="org-level-1"><span class="org-tag">:ignore:</span></span>
<span class="org-meta-line">#+latex: \columnbreak</span>
