java-cheat-sheet.org.html
<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> </span><span class="org-level-1"><span class="org-link"><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object">Object</a><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object">s</a></span></span>

In the real world you see and use <span class="writegood-weasels">various</span> objects, and each of them is
belongs to <span class="writegood-weasels">some</span> kind such as toys, food, animals, electronics et
al. In Java, instead of saying what kind of objects, we say what class
of objects. In other words, each object belongs to a class. A class is
like a blueprint of an object. In this chapter you&#8217;ll get familiar
with classes - the main constructs of the Java language.


<span class="comment"># Numbers, Booleans, and strings are the atoms that data structures </span><span class="comment"><span class="writegood-passive-voice">are built</span></span>
<span class="comment"># from. </span><span class="comment"><span class="writegood-weasels">Many</span></span><span class="comment"> types of information require more than one atom, though. Objects</span>
<span class="comment"># allow us to group values&#8212;including other objects&#8212;to build more complex</span>
<span class="comment"># structures.</span>

Objects provide ways to group <span class="writegood-weasels">several</span> values into a single
value. Conceptually, this allows us to put a bunch of related things
in a bag and run around with the bag, instead of wrapping our arms
around all of the individual things and trying to hold on to them
separately. These &#8220;things&#8221; <span class="writegood-passive-voice">are called</span> <span class="italic">properties</span>.

<span class="comment"># Arrays are just a kind of object specialised for storing sequences of things.</span>

Values of the type <span class="italic">object</span> are arbitrary collections of properties. One way to
create an object is by using braces as an expression that lists properties as <span class="italic">&#8220;name:value&#8221;</span>
pairs.

1. Almost all JavaScript <span class="italic">values</span> have properties. The exceptions are <span class="org-code">null</span> and
 <span class="org-code">undefined</span>. If you try to access a property on one of these nonvalues, you get
 an error. Properties <span class="writegood-passive-voice">are accessed</span> using <span class="org-code">value.prop</span>, <span class="italic">dot notation</span>.
