posts/java-cheat-sheet.org
* COMMENT Operational vs Denotational Semantics

A programming language consists of two parts: A *syntax* to indicate how to write programs down,
and a *semantics* to indicate how to execute programs.

*Semantics* describes the processes a computer follows when executing a
program in a specific language. This can be shown by describing the
relationship between the input and output of a program (i.e., “axiomatic semantics”)
or how expressions are reduced (i.e., “operational semantics).
# Then with the semantics, one can answer questions like /can we know when certain programs will halt?/

Compilers are concernd with “syntax errors” (i.e., invalid expressions);
humans are concerns with semantics. Syntax is determined at compile-time,
whereas semantics is deteremined at run-time: For example, =x + 1= is
syntactically a number whenever =x= is a number, but semantically it may
denote a number, or an overflow error if =x= is already the largest representable number,
or it may just be =x= again as is the case in JavaScript (~Infinity + 1 == Infinity~).
A similar argument applies to =1 / x=.
Type annotations are a way to bring some semantics into the world of syntax.
# Likewise, dereferencing pointers, which may be null at run-time.

There are 3 popular approachs to semantics, each useful for particular goals.
For example, operational semantics is helpful for implementing a programming language (in, say, Java or Prolog);
whereas axiomatic semantics is helpful for program verification;
and denotation semantics is helpful for program rewriting (in possibly different programming languages).

*Operational Semantics:* A type is defined by how its “introduction
rules” (i.e., how instances are created) and its “elimination rules”
(i.e., how instances are used) and how those rules combine together
(so called “computation rules”). There is no “meaning” here: Just how
new syntax is introduced, and how it is operationally executed/reduced
(in an idealised computer). This is presented as a “Type Theory” or a
“Transition System” (which is a machine named “⟶” whose execution rules
are directed by the programming syntax).
/This approach encourages “smart/
/constructors”, i.e., “factory methods”, and exhaustive case analysis;
i.e., src_java[:exports code]{switch}./

*Axiomatic Semantics:* A type denotes some state, and methods/programs
are characterised by their effect on assertions about program
state. /This approach encourages explicit pre-conditions and post-conditions; emphasizing proofs-of-correctness./
# That is, a method denotes a predicate transformer.

*Denotational Semantics:* A type is defined, characterised, by the
mathematical properties of its instances.  That is to say, a type (and
its properties & methods) are considered to denote an object in some
category, namely the category theory denoting the programming language
under consideration. This is also known more generally as
“categorical, or functorial, semantics”, and may be presented as two
categories and a functor “⟦⟧: Syntax → Semantics”.  /This approach
encourages “compositionality, functoriality”: Working with a complex/
/structure can be done by working with its parts./ The mathematical
properties of this approach allow us to rewrite programs: For example,
requiring type constructors to be functors means we need the law
~x.map(f).map(g) = x.map(f⨾g)~ which, when read left-to-right, is
essentially an optimisation.  Likewise, the (homo)morphisms of the
category essentially give us /correctness-preserving rewrite rules/
for the methods of a type.  Simply put, we can start with a program ℰ
that clearly does something we want but is inefficient, then we can
optimise it by rewriting its semantics ⟦ℰ⟧ to, say, ⟦ℱ⟧ which is
clearly more efficient but it's not obvious that it accomplishes the
same goal: The semantic rewrite justifies using ℱ in-place of ℰ.
(Note that ℱ might be a program in a different language that happens to have the same
semantics; this is useful when porting code from one language to another in a correctness-preserving fashion.)
/This approach encourages characterising types by their
relationships/methods, rather than by specific implementation matter./
For example, /a/ type of pairs has a specific characterising property,
rather than explicitly two projection functions (e.g.,
a pair of 1-byte src_java[:exports code]{char}s can be encoded
with the 2-byte src_java[:exports code]{short} type).

It is intersting to note that while explicit presentations may differ,
the type theories of operational semantics correspond to the categories
of denotational semantics. In particular, the simply typed lambda calculus
can be treated as a /syntax/ whose /semantics/ is an arbitrary cartesian closed category.
*“We may program with type theory, but our programs can have arbitrary non-standard semantics!”*

* COMMENT Records
Like tuples, but better.

Good for defining immutable data carriers.

Records are a constrained kind of class, and as a class
it can have constructors and methods.

* Null :details_null:

There is a special value named src_java[:exports code]{null} that
denotes the absence of a meaningful value.  Ironically, it is a value
of every type (excluding the primitive types).  [[https://funcall.blogspot.com/2007/11/in-kingdom-of-nouns.html?m=1][Here]] is a neat story
about =null=.


# Many operations that don’t produce meaningful values yield void simply because they have to yield some value.

* TODO COMMENT mention optional alongside null
