java-cheat-sheet.org.html

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Operational vs Denotational Semantics</span>

A programming language consists of two parts: A <span class="bold">syntax</span> to indicate how to write programs down,
and a <span class="bold">semantics</span> to indicate how to execute programs.

<span class="bold">Semantics</span> describes the processes a computer follows when executing a
program in a specific language. This can <span class="writegood-passive-voice">be shown</span> by describing the
relationship between the input and output of a program (i.e., &#8220;axiomatic semantics&#8221;)
or how expressions <span class="writegood-passive-voice">are reduced</span> (i.e., &#8220;operational semantics).
<span class="comment"># Then with the semantics, one can answer questions like /can we know when certain programs will halt?/</span>

Compilers are concernd with &#8220;syntax errors&#8221; (i.e., invalid expressions);
humans are concerns with semantics. Syntax <span class="writegood-passive-voice">is determined</span> at compile-time,
whereas semantics <span class="writegood-passive-voice">is deteremined</span> at run-time: For example, <span class="org-verbatim">x + 1</span> is
syntactically a number whenever <span class="org-verbatim">x</span> <span class="writegood-weasels">is a number</span>, but semantically it may
denote a number, or an overflow error if <span class="org-verbatim">x</span> is already the largest representable number,
or it may just be <span class="org-verbatim">x</span> again as is the case in JavaScript (<span class="org-code">Infinity + 1 </span><span class="org-code"><span class="org-verbatim">= Infinity</span></span><span class="org-verbatim">~).
A similar argument applies to </span><span class="org-verbatim"><span class="org-verbatim">1 / x</span></span>.
Type annotations are a way to bring <span class="writegood-weasels">some</span> semantics into the world of syntax.
<span class="comment"># Likewise, dereferencing pointers, which may be null at run-time.</span>

There are 3 popular approachs to semantics, each useful for particular goals.
For example, operational semantics is helpful for implementing a programming language (in, say, Java or Prolog);
whereas axiomatic semantics is helpful for program verification;
and denotation semantics is helpful for program rewriting (in possibly different programming languages).

<span class="bold">Operational Semantics:</span> A type <span class="writegood-passive-voice">is defined</span> by how its &#8220;introduction
rules&#8221; (i.e., how instances <span class="writegood-passive-voice">are created</span>) and its &#8220;elimination rules&#8221;
(i.e., how instances <span class="writegood-passive-voice">are used</span>) and how those rules combine together
(so called &#8220;computation rules&#8221;). There is no &#8220;meaning&#8221; here: Just how
new syntax <span class="writegood-passive-voice">is introduced</span>, and how it is operationally executed/reduced
(in an idealised computer). This <span class="writegood-passive-voice">is presented</span> as a &#8220;Type Theory&#8221; or a
&#8220;Transition System&#8221; (which is a machine named &#8220;&#10230;&#8221; whose execution rules
<span class="writegood-passive-voice">are directed</span> by the programming syntax).
<span class="italic">This approach encourages &#8220;smart</span>
<span class="italic">constructors&#8221;, i.e., &#8220;factory methods&#8221;, and exhaustive case analysis;
i.e., </span><span class="org-inline-src-block"><span class="shadow"><span class="italic">src_</span></span></span><span class="org-inline-src-block"><span class="org-meta-line"><span class="italic">java</span></span></span><span class="org-inline-src-block"><span class="italic">[:exports code]</span></span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">switch</span><span class="shadow"><span class="org-inline-src-block">}</span></span><span class="italic">.</span>

<span class="bold">Axiomatic Semantics:</span> A type denotes <span class="writegood-weasels">some</span> state, and methods/programs
<span class="writegood-passive-voice">are characterised</span> by their effect on assertions about program
state. <span class="italic">This approach encourages explicit pre-conditions and post-conditions; emphasizing proofs-of-correctness.</span>
<span class="comment"># That is, a method denotes a predicate transformer.</span>

<span class="bold">Denotational Semantics:</span> A type <span class="writegood-passive-voice">is defined</span>, characterised, by the
mathematical properties of its instances.  That is to say, a type (and
its properties &amp; methods) <span class="writegood-passive-voice">are considered</span> to denote an object in <span class="writegood-weasels">some</span>
category, namely the category theory denoting the programming language
under consideration. This is also known more generally as
&#8220;categorical, or functorial, semantics&#8221;, and may <span class="writegood-passive-voice">be presented</span> as two
categories and a functor &#8220;&#10214;&#10215;: Syntax &#8594; Semantics&#8221;.  <span class="italic">This approach
encourages &#8220;compositionality, functoriality&#8221;: Working with a complex</span>
<span class="italic">structure can </span><span class="italic"><span class="writegood-passive-voice">be done</span></span><span class="italic"> by working with its parts.</span> The mathematical
properties of this approach allow us to rewrite programs: For example,
requiring type constructors to be functors means we need the law
<span class="org-code">x.map(f).map(g) = x.map(f&#10814;g)</span> which, when read left-to-right, is
essentially an optimisation.  Likewise, the (homo)morphisms of the
category essentially give us <span class="italic">correctness-preserving rewrite rules</span>
for the methods of a type.  <span class="writegood-weasels">Simply</span> put, we can start with a program &#8496;
that <span class="writegood-weasels">clearly</span> does something we want but is inefficient, then we can
optimise it by rewriting its semantics &#10214;&#8496;&#10215; to, say, &#10214;&#8497;&#10215; which is
<span class="writegood-weasels">clearly</span> more efficient but it's not obvious that it accomplishes the
same goal: The semantic rewrite justifies using &#8497; in-place of &#8496;.
(Note that &#8497; might be a program in a different language that happens to have the same
semantics; this is useful when porting code from one language to another in a correctness-preserving fashion.)
<span class="italic">This approach encourages characterising types by their
relationships/methods, rather than by specific implementation matter.</span>
For example, <span class="italic">a</span> type of pairs has a specific characterising property,
rather than explicitly two projection functions (e.g.,
a pair of 1-byte <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">char</span><span class="shadow"><span class="org-inline-src-block">}</span></span>s can <span class="writegood-passive-voice">be encoded</span>
with the 2-byte <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">short</span><span class="shadow"><span class="org-inline-src-block">}</span></span> type).

It is intersting to note that while explicit presentations may differ,
the type theories of operational semantics correspond to the categories
of denotational semantics. In particular, the <span class="writegood-weasels">simply</span> typed lambda calculus
can <span class="writegood-passive-voice">be treated</span> as a <span class="italic">syntax</span> whose <span class="italic">semantics</span> is an arbitrary cartesian closed category.
<span class="bold">&#8220;We may program with type theory, but our programs can have arbitrary non-standard semantics!&#8221;</span>

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Records</span>
Like tuples, but better.

Good for defining immutable data carriers.

Records are a constrained kind of class, and as a class
it can have constructors and methods.

<span class="org-level-1">* Null </span><span class="org-level-1"><span class="org-tag">:details_null:</span></span>

There is a special value named <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">null</span><span class="shadow"><span class="org-inline-src-block">}</span></span> that
denotes the absence of a meaningful value.  Ironically, it is a value
of every type (excluding the primitive types).  <span class="org-link"><a href="https://funcall.blogspot.com/2007/11/in-kingdom-of-nouns.html?m=1">Here</a></span> is a neat story
about <span class="org-verbatim">null</span>.


<span class="comment"># </span><span class="comment"><span class="writegood-weasels">Many</span></span><span class="comment"> operations that don&#8217;t produce meaningful values yield void </span><span class="comment"><span class="writegood-weasels">simply</span></span><span class="comment"> because they have to yield </span><span class="comment"><span class="writegood-weasels">some</span></span><span class="comment"> value.</span>

<span class="org-level-1">* </span><span class="org-level-1"><span class="org-todo"><span class="hl-todo"><span class="custom-1">TODO</span></span></span></span><span class="org-level-1"> </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> mention optional alongside null</span>
