posts/java-cheat-sheet.org
* Primitive Objects

For performance reasons, there are a handful of types whose values are created
by /literals/; i.e., “What you see is what you get”.  (As such, primitives are a
basic building block which cannot be broken apart; whereas non-primitives (aka
references) are made-up from primitives and other references.)  For example, to
create a value of src_java[:exports code]{int} we simply write ~5~.

/There are no instance methods on literals;/ only a
handful of operator methods.  For example, we cannot write ~2.pow(3)~
to compute 2³, but instead must write src_java[:exports code]{Math.pow(2, 3)}.
Finally, variables of primitive types have default values when not initialised
whereas object types default to src_java[:exports code]{null} ---note: ~null~ is a value of all object types, but not of primitive types.

#+latex: \begingroup\scriptsize
#+begin_parallel :bar t
#+begin_src java :exports code
// Declare a new object type
class Person { String name; }

Person obj; // ≈ null (OBJECT)
int prim;    // ≈ 0   (PRIMITIVE)

// Primitives are created as literals
prim = 1;    // ≈ 1

// Objects are created with “new”
obj = new Person(); // ≈ a reference,
   // like: Person@66048bfd

// Primitives are  identified by
// thier literal shape
assert prim == 1;

// Objects are identified by
/// references to their memory
// locations (not syntax shape!)
assert obj != new Person();

// Primitives copy values
int primCopy = prim;  // ≈ 1

/// Objects copy references
Person objCopy = obj;
  // ≈ a reference, like: Person@66048bfd

// Changing primitive copy has
// no impact on original
primCopy = 123;
assert prim == 1;

// Changing object copy also
// changes the original!
assert obj.name == null;
objCopy.name = "woah";    // Alter copy!
// Original is altered!
assert obj.name.equals("woah");
#+end_src
# // (Notice we use .equals since String is an object type!)
#+end_parallel
#+latex: \endgroup

:Remark:
Having two references accessing the same object in memory can be dangerous,
since they can alter it unexpectedly. It can also be useful, since the users
of the references can essentially communicate with one another by using
the object as “shared message buffer”.
:End:

# Note: The aliases-as-reference behaviour is not an issue with the primitive wrapper
# types, such as ~Integer~.

** Wrapper Types :details:

Java lets primitives shift back and forth from their literal representations
and the world of reference objects somewhat-harmoniously by automatically
“boxing” them up as objects when need be. This is done by having class
versions of every primitive type; e.g., the primitive src_java[:exports code]{int}
has the class version src_java[:exports code]{Integer}.

#+begin_src java
Integer x = 1; // auto-boxed to an object
int y = new Integer(2); // auto-unboxed to a primitive
#+end_src

/Primitives require much less memory!/
An ~int~ requires 32-bits to represent, whereas an ~Integer~ requires 128-bits:
The object requires as much space as 4 primitives, in this case.

# On the other hand, current Java language specification doesn't allow
# usage of primitive types in the parametrized types (generics), in the
# Java collections or the Reflection API.
#
# TODO: Mention auto-boxing; e.g.,
# "hello".toUpperCase()
# Or find a better, numeric, example of auto-boxing.

