java-cheat-sheet.org.html
<span class="org-level-1">* Primitive Objects</span>

For performance reasons, there are a handful of types whose values <span class="writegood-passive-voice">are created</span>
by <span class="italic">literals</span>; i.e., &#8220;What you see is what you get&#8221;.  (As such, primitives are a
basic building block which cannot <span class="writegood-passive-voice">be broken</span> apart; whereas non-primitives (aka
references) <span class="writegood-passive-voice">are made</span>-up from primitives and other references.)  For example, to
create a value of <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">int</span><span class="shadow"><span class="org-inline-src-block">}</span></span> we <span class="writegood-weasels">simply</span> write <span class="org-code">5</span>.

<span class="italic">There are no instance methods on literals;</span> only a
handful of operator methods.  For example, we cannot write <span class="org-code">2.pow(3)</span>
to compute 2&#179;, but instead must write <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Math.pow(2, 3)</span><span class="shadow"><span class="org-inline-src-block">}</span></span>.
Finally, variables of primitive types have default values when not initialised
whereas object types default to <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">null</span><span class="shadow"><span class="org-inline-src-block">}</span></span> ---note: <span class="org-code">null</span> is a value of all object types, but not of primitive types.

<span class="org-meta-line">#+latex: \begingroup\scriptsize</span>
<span class="org-block-begin-line">#+begin_parallel :bar t
</span><span class="org-block">#+begin_src java :exports code
// Declare a new object type
class Person { String name; }

Person obj; / &#8776; null (OBJECT)
int prim;    / &#8776; 0   (PRIMITIVE)

/ Primitives </span><span class="org-block"><span class="writegood-passive-voice">are created</span></span><span class="org-block"> as literals
prim = 1;    / &#8776; 1

/ Objects </span><span class="org-block"><span class="writegood-passive-voice">are created</span></span><span class="org-block"> with &#8220;new&#8221;
obj = new Person();  &#8776; a reference,
   / like: Person@66048bfd

/ Primitives </span><span class="org-block"><span class="writegood-passive-voice">are  identified</span></span><span class="org-block"> by
/ thier literal shape
assert prim == 1;

/ Objects </span><span class="org-block"><span class="writegood-passive-voice">are identified</span></span><span class="org-block"> by
/ references to their memory
// locations (not syntax shape!)
assert obj != new Person();

/ Primitives copy values
int primCopy = prim;  / &#8776; 1

/ Objects copy references
Person objCopy = obj;
  // &#8776; a reference, like: Person@66048bfd

/ Changing primitive copy has
/ no impact on original
primCopy = 123;
assert prim == 1;

/ Changing object copy also
/ changes the original!
assert obj.name == null;
objCopy.name = "woah";    / Alter copy!
/ Original </span><span class="org-block"><span class="writegood-passive-voice">is altered</span></span><span class="org-block">!
assert obj.name.equals("woah");
#+end_src
# // (Notice we use .equals since String is an object type!)
</span><span class="org-block-end-line">#+end_parallel
</span><span class="org-meta-line">#+latex: \endgroup</span>

<span class="org-drawer">:Remark:</span>
Having two references accessing the same object in memory can be dangerous,
since they can alter it unexpectedly. It can also be useful, since the users
of the references can essentially communicate with one another by using
the object as &#8220;shared message buffer&#8221;.
<span class="org-drawer">:End:</span>

<span class="comment"># Note: The aliases-as-reference behaviour is not an issue with the primitive wrapper</span>
<span class="comment"># types, such as ~Integer~.</span>

<span class="org-hide">*</span><span class="org-level-2">* Wrapper Types </span><span class="org-level-2"><span class="org-tag">:details:</span></span>

Java lets primitives shift back and forth from their literal representations
and the world of reference objects somewhat-harmoniously by automatically
&#8220;boxing&#8221; them up as objects when need be. This <span class="writegood-passive-voice">is done</span> by having class
versions of every primitive type; e.g., the primitive <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">int</span><span class="shadow"><span class="org-inline-src-block">}</span></span>
has the class version <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Integer</span><span class="shadow"><span class="org-inline-src-block">}</span></span>.

<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="type">Integer</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">x</span></span><span class="org-block"> = 1; </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">auto-boxed to an object
</span></span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">y</span></span><span class="org-block"> = </span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Integer</span></span><span class="org-block">(2); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">auto-unboxed to a primitive
</span></span><span class="org-block-end-line">#+end_src
</span>
<span class="italic">Primitives require much less memory!</span>
An <span class="org-code">int</span> requires 32-bits to represent, whereas an <span class="org-code">Integer</span> requires 128-bits:
The object requires as much space as 4 primitives, in this case.

<span class="comment"># On the other hand, current Java language specification doesn't allow</span>
<span class="comment"># usage of primitive types in the parametrized types (generics), in the</span>
<span class="comment"># Java collections or the Reflection API.</span>
<span class="comment">#</span>
<span class="comment"># </span><span class="comment"><span class="hl-todo"><span class="custom-1">TODO</span></span></span><span class="comment">: Mention auto-boxing; e.g.,</span>
<span class="comment"># "hello".toUpperCase()</span>
<span class="comment"># Or find a better, numeric, example of auto-boxing.</span>
