posts/java-cheat-sheet.org
* Properties and methods have *separate namespaces*

{{{begin-ignore-html}}}
Properties and methods have *separate namespaces* ---@@latex:{\tiny “Java is a Lisp-2 Language”.}@@
{{{end-ignore-html}}}

  :Like_Lisp:
  + → :: Use ~funcall~ or ~apply~ to call functions bound to variables.
  + → :: Refer to functions outside of function calls by using a sharp quote, ~#'~.
  :End:

  Below we use the name =plus1= in two different definitional roles.
  Which one we want to refer to depends on whether we use "dot-notation" with /or/ without parenthesis:
  The parentheis indicate we want to use the method.
  # Alternatively, we can transform a method into a "function object"  using =::=-notation, /method-reference notation/.
  # Function<Integer, Integer> theMethod   = SameNameNoProblem::plus1;

#+latex: \begingroup\scriptsize
#+begin_src java
class SameNameNoProblem {
    public static int plus1(int x){ return x + 1; } // Method!
    public static String plus1 = "+1";             // Property!
}

class ElseWhere {
    String pretty = SameNameNoProblem.plus1;
    Integer three = SameNameNoProblem.plus1(2);
}
#+end_src
#+latex: \endgroup

The consequence of different namespaces @@meta: i.e. of being Lisp-2@@ are
1. Use src_java[:exports code]{apply} to call functions bound to variables.
2. Refer to functions outside of function calls by using a double colon, ~::~.

# Function<Integer, Integer> increment = SameNameNoProblem::plus1;
# tri(SameNameNoProblem::plus1, 100) // ⇒ 5150

#+latex: \vspace{-.03em}{\centerline{\tiny Let's discuss both of these now... }}

* COMMENT Functions

+ A ~return~ keyword without an expression after it will cause the
  function to return ~undefined~.

+ Functions that don’t have a ~return~ statement at all, similarly return
  ~undefined~.

+ One may also define functions using “arrow” notation: ~(x₀, …, xₙ) => ⋯~.
  - When there is only one parameter name, you can omit the parentheses around
    the parameter list.
  - If the body is a single expression, rather than a (multi-line) block in
    braces, that expression will be returned from the function.

  So, these two definitions of square do the same thing:
  #+BEGIN_SRC js
  const square1 = (x) => { return x * x; };
  const square2 =  x  => x * x;
  #+END_SRC
* Anonymous /functions/:    ~(arg₁, …, argₙ) → bodyHere~     @@latex: {\color{white}.}@@

#+latex: {\color{white} . } \vspace{-1em}

#+begin_box Functions are formed with the “→” notation and used with “apply”
#+begin_src java
// define, then invoke later on
Function<Integer, Integer> f  =  x -> x * 2;

f.apply(3) // ⇒ 6
// f(3)    // invalid!

// define and immediately invoke
((Function<Integer, Integer>) x -> x * 2).apply(3);

// define from a method reference, using “::”
Function<Integer, Integer> f = SameNameNoProblem::plus1;
#+end_src
#+end_box

#+begin_box "Let's make a method that takes anonymous functions, and use it"
#+begin_src java
// Recursion with the ‘tri’angle numbers: tri(f, n) = Σⁿᵢ₌₀ f(i).
public static int tri(Function<Integer, Integer> f, int n) {
    return n <= 0 ? 0 : f.apply(n) + tri(f, n - 1);
}

tri(x -> x / 2, 100);  //  ⇒  Σ¹⁰⁰ᵢ₌₀ i/2 = 2500

// Using the standard “do nothing” library function
tri(Function.identity(), 100);  //  ⇒  Σ¹⁰⁰ᵢ₌₀ i = 5050
#+end_src
#+end_box

#+begin_box Exercise! Why does the following code work?
#+begin_src java
int tri = 100;
tri(Function.identity(), tri); //  ⇒ 5050

Function<Integer, Integer> tri = x -> x;
tri(tri, 100); //  ⇒ 5050
#+END_SRC
# Solution: Recall that methods and variables have different namespaces...

:Solution:
Contextual location determines dispatch: In the expression =tri(tri,
100)= the first =tri= must be /method/ whereas the second =tri= must
be a variable (which happens to refer to a function).
That is, /variables and methods have different namespaces./
:End:
#+end_box

#+latex: \room
In Java, everything is an object! (Ignoring primitives, which exist for the purposes of efficiency!)
As such, functions are also objects! Which means, they must have a type: Either some class (or some interface), but which
one? The arrow literal notation =x -> e= *is a short-hand* for an implementation of an interface with one abstract
method...
# That is all ;-)

** COMMENT Function, UnaryOperator, Consumer, Predicate, Supplier

The phrase =Function<Integer, Integer>= is a bit of a mouthful to write each time,
so the standard library provides a terser equivalent:
* Lambdas are a shorthand for classes that implement functional interfaces

# Good read! https://www.baeldung.com/java-8-lambda-expressions-tips

Let's take a more theoretical look at anonymous functions.

