java-cheat-sheet.org.html

<span class="org-level-1">* Properties and methods have </span><span class="org-level-1"><span class="bold">separate namespaces</span></span>

<span class="org-macro">begin-ignore-html</span>
Properties and methods have <span class="bold">separate namespaces</span> ---<span class="comment">@@</span><span class="org-tag">latex:</span>{\<span class="writegood-weasels">tiny</span> &#8220;Java is a Lisp-2 Language&#8221;.}<span class="comment">@@</span>
<span class="org-macro">end-ignore-html</span>

  <span class="org-drawer">:Like_Lisp:</span>
  + <span class="org-list-dt">&#8594; ::</span> Use <span class="org-code">funcall</span> or <span class="org-code">apply</span> to call functions bound to variables.
  + <span class="org-list-dt">&#8594; ::</span> Refer to functions outside of function calls by using a sharp quote, <span class="org-code">#'</span>.
  <span class="org-drawer">:End:</span>

  Below we use the name <span class="org-verbatim">plus1</span> in two different definitional roles.
  Which one we want to refer to depends on whether we use "dot-notation" with <span class="italic">or</span> without parenthesis:
  The parentheis indicate we want to use the method.
<span class="comment">  # Alternatively, we can transform a method into a "function object"  using =::=-notation, /method-reference notation/.</span>
<span class="comment">  # Function&lt;Integer, Integer&gt; theMethod   = SameNameNoProblem::plus1;</span>

<span class="org-meta-line">#+latex: \begingroup\scriptsize</span>
<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="keyword">class</span></span><span class="org-block"> </span><span class="org-block"><span class="type">SameNameNoProblem</span></span><span class="org-block"> {
    </span><span class="org-block"><span class="keyword">public</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">static</span></span><span class="org-block"> </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">plus1</span></span><span class="org-block">(</span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">x</span></span><span class="org-block">){ </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> x + 1; } </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Method!
</span></span><span class="org-block">    </span><span class="org-block"><span class="keyword">public</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">static</span></span><span class="org-block"> </span><span class="org-block"><span class="type">String</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">plus1</span></span><span class="org-block"> = </span><span class="org-block"><span class="string">"+1"</span></span><span class="org-block">;             </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Property!
</span></span><span class="org-block">}

</span><span class="org-block"><span class="keyword">class</span></span><span class="org-block"> </span><span class="org-block"><span class="type">ElseWhere</span></span><span class="org-block"> {
    </span><span class="org-block"><span class="type">String</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">pretty</span></span><span class="org-block"> = SameNameNoProblem.plus1;
    </span><span class="org-block"><span class="type">Integer</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">three</span></span><span class="org-block"> = SameNameNoProblem.plus1(2);
}
</span><span class="org-block-end-line">#+end_src
</span><span class="org-meta-line">#+latex: \endgroup</span>

The consequence of different namespaces <span class="comment">@@</span><span class="org-tag">meta:</span> i.e. of being Lisp-2<span class="comment">@@</span> are
1. Use <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">apply</span><span class="shadow"><span class="org-inline-src-block">}</span></span> to call functions bound to variables.
2. Refer to functions outside of function calls by using a double colon, <span class="org-code">::</span>.

<span class="comment"># Function&lt;Integer, Integer&gt; increment = SameNameNoProblem::plus1;</span>
<span class="comment"># tri(SameNameNoProblem::plus1, 100) // &#8658; 5150</span>

<span class="org-meta-line">#+latex: \vspace{-.03em}{\centerline{\</span><span class="org-meta-line"><span class="writegood-weasels">tiny</span></span><span class="org-meta-line"> Let's discuss both of these now... }}</span>

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Functions</span>

+ A <span class="org-code">return</span> keyword without an expression after it will cause the
  function to return <span class="org-code">undefined</span>.

+ Functions that don&#8217;t have a <span class="org-code">return</span> statement at all, similarly return
  <span class="org-code">undefined</span>.

+ One may also define functions using &#8220;arrow&#8221; notation: <span class="org-code">(x&#8320;, &#8230;, x&#8345;) =&gt; &#8943;</span>.
  - When there is only one parameter name, you can omit the parentheses around
    the parameter list.
  - If the body is a single expression, rather than a (multi-line) block in
    braces, that expression will <span class="writegood-passive-voice">be returned</span> from the function.

  So, these two definitions of square do the same thing:
<span class="org-block-begin-line">  #+BEGIN_SRC js
</span><span class="org-block">  </span><span class="org-block"><span class="keyword">const</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">square1</span></span><span class="org-block"> = (x) =&gt; { </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> x * x; };
  </span><span class="org-block"><span class="keyword">const</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">square2</span></span><span class="org-block"> =  x  =&gt; x * x;
</span><span class="org-block-end-line">  #+END_SRC
</span><span class="org-level-1">* Anonymous </span><span class="org-level-1"><span class="italic">functions</span></span><span class="org-level-1">: &#160;&#160; </span><span class="org-level-1"><span class="org-code">(arg&#8321;, &#8230;, arg&#8345;) &#8594; bodyHere</span></span><span class="org-level-1"> &#160;&#160;&#160; </span><span class="comment">@@</span><span class="org-tag">latex:</span><span class="org-level-1"> {\color{white}.}</span><span class="comment">@@</span>

<span class="org-meta-line">#+latex: {\color{white} . } \vspace{-1em}</span>

<span class="org-block-begin-line">#+begin_box Functions </span><span class="org-block-begin-line"><span class="writegood-passive-voice">are formed</span></span><span class="org-block-begin-line"> with the &#8220;&#8594;&#8221; notation and used with &#8220;apply&#8221;
</span><span class="org-block">#+begin_src java
// define, then invoke later on
Function&lt;Integer, Integer&gt; f  =  x -&gt; x * 2;

f.apply(3) / &#8658; 6
 f(3)    / invalid!

// define and immediately invoke
((Function&lt;Integer, Integer&gt;) x -&gt; x * 2).apply(3);

// define from a method reference, using &#8220;::&#8221;
Function&lt;Integer, Integer&gt; f = SameNameNoProblem::plus1;
#+end_src
</span><span class="org-block-end-line">#+end_box
</span>
<span class="org-block-begin-line">#+begin_box "Let's make a method that takes anonymous functions, and use it"
</span><span class="org-block">#+begin_src java
// Recursion with the &#8216;tri&#8217;angle numbers: tri(f, n) = &#931;&#8319;&#7522;&#8332;&#8320; f(i).
public static int tri(Function&lt;Integer, Integer&gt; f, int n) {
    return n &lt;= 0 ? 0 : f.apply(n) + tri(f, n - 1);
}

tri(x -&gt; x / 2, 100);  //  &#8658;  &#931;&#185;&#8304;&#8304;&#7522;&#8332;&#8320; i/2 = 2500

/ Using the standard &#8220;do nothing&#8221; library function
tri(Function.identity(), 100);  /  &#8658;  &#931;&#185;&#8304;&#8304;&#7522;&#8332;&#8320; i = 5050
#+end_src
</span><span class="org-block-end-line">#+end_box
</span>
<span class="org-block-begin-line">#+begin_box Exercise! Why does the following code work?
</span><span class="org-block">#+begin_src java
int tri = 100;
tri(Function.identity(), tri); //  &#8658; 5050

Function&lt;Integer, Integer&gt; tri = x -&gt; x;
tri(tri, 100); //  &#8658; 5050
#+END_SRC
# Solution: Recall that methods and variables have different namespaces...

:Solution:
Contextual location determines dispatch: In the expression tri(tri,
100) the first tri must be method whereas the second tri must
be a variable (which happens to refer to a function).
That is, variables and methods have different namespaces.
:End:
</span><span class="org-block-end-line">#+end_box
</span>
<span class="org-meta-line">#+latex: \room</span>
In Java, everything is an object! (Ignoring primitives, which exist for the purposes of efficiency!)
As such, functions are also objects! Which means, they must have a type: Either <span class="writegood-weasels">some</span> class (or <span class="writegood-weasels">some</span> interface), but which
one? The arrow literal notation <span class="org-verbatim">x -&gt; e</span> <span class="bold">is a short-hand</span> for an implementation of an interface with one abstract
method...
<span class="comment"># That is all ;-)</span>

<span class="org-hide">*</span><span class="org-level-2">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-2"> Function, UnaryOperator, Consumer, Predicate, Supplier</span>

The phrase <span class="org-verbatim">Function&lt;Integer, Integer&gt;</span> is a bit of a mouthful to write each time,
so the standard library provides a terser equivalent:
<span class="org-level-1">* Lambdas are a shorthand for classes that implement functional interfaces</span>

<span class="comment"># Good read! <a href="https://www.baeldung.com/java-8-lambda-expressions-tips">https://www.baeldung.com/java-8-lambda-expressions-tips</a></span>

Let's take a more theoretical look at anonymous functions.
