posts/java-cheat-sheet.org
** Functional Interfaces :centerline:

A /lambda expression/ is a (shorthand) implementation of the only abstract method
in a /functional interface/ ——–which is an interface that has exactly one abstract
method, and possibly many default methods.

For example, the following interface is a functional interface: It has only one abstract method.
#+begin_src java
  public interface Predicate<T> {

      boolean test(T t);  // This is the abstract method

      // Other non-abstract methods.
      default Predicate<T> and(Predicate<? super T> other) { ... }
      // Example usage: nonNull.and(nonEmpty).and(shorterThan5)
      static <T> Predicate<T> isEqual(T target) {...}
      // Example usage: Predicate.isEqual("Duke") is a new predicate to use.
  }
#+end_src

Optionally, to ensure that this is indeed a functional interface, i.e., it has
only one abstract method, we can place =@FunctionalInterface= above its
declaration. Then the complier will check our intention for us.

** The Type of a Lambda :centerline:

Anyhow, since a lambda is a shorthand implementation of an interface, this means
that what you can do with a lambda depenends on the interface it's impementing!

As such, when you see a lambda it's important to know it's type is not "just a function"!
This mean *to run/apply/execute a lambda variable* you need to remember that the variable
is technically an object implementing a specific functional interface, which has a single
/named/ abstract method (which is implemented by the lambda) and so we need to invoke that
method on our lambda variable to actually run the lambda. For example,
#+begin_src java
  Predicate<String> f = s -> s.length() == 3;   // Make a lambda variable
  boolean isLength3String = f.test("hola");     // Actually invoke it.
#+end_src

Since different lambdas may implement different interfaces, the actually method
to run the lambda will likely be different! Moreover, you can invoke /any/ method
on the interface that the lambda is implementing. After-all, a lambda is an object; not just a function.

Moreover, ~Function~ has useful methods: Such as ~andThen~ for composing functions sequentially,
and ~Function.identity~ for the do-nothing function.

** Common Java Functional Types :centerline:

Anyhow, [[https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/util/function/package-summary.html][Java has ~40 functional interfaces]], which are essentially useful variations around the following 4:
|---------------------+--------+--------------------------------------------------------------------|
| Class               | runner | Description & example                                              |
|---------------------+--------+--------------------------------------------------------------------|
| {{{src(Supplier<T>)}}}    | ~get~    | Makes objects for us; e.g., {{{src(() -> "Hello"!)}}}.                    |
| {{{src(Consumer<T>)}}}    | ~accept~ | Does stuff with our objects, returning void;                       |
|                     |        | e.g., {{{src(s -> System.out.println(s))}}}.                              |
| {{{src(Predicate<T>)}}}   | ~test~   | Tests our object for some property, returning a boolean            |
|                     |        | e.g., {{{src(s -> s.length() == 3)}}}                                      |
| {{{src(Function<T, R>)}}} | ~apply~  | Takes our object and gives us a new one; e.g., {{{src(s -> s.length())}}} |
|---------------------+--------+--------------------------------------------------------------------|

For example, src_java[:exports code]{𝒞::new} is a supplier for the
class 𝒞, and the [[https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/Iterable.html#forEach(java.util.function.Consumer)][forEach]] method on iterables actually uses a consumer
lambda, and a supplier can be used to [[https://stackoverflow.com/questions/36255007/is-there-any-way-to-reuse-a-stream][reuse streams]] (discussed below).

The remaining Java functional interfaces are variations on these 4
that are optimised for primitive types, or have different number of
inputs as functions. For example, ~UnaryOperator<T>~ is essentially
~Function<T, T>~, and ~BiFunction<A, B, C>~ is essentially
~Function<A, Function<B, C>>~ ———not equivalent, but essentially the
same thing.

- As another example, Java has a ~TriConsumer~ which is the type of functions that have 3 inputs and no outputs
  ---since ~Tri~ means 3, as in /tricycle/.

