java-cheat-sheet.org.html

<span class="org-hide">*</span><span class="org-level-2">* Functional Interfaces </span><span class="org-level-2"><span class="org-tag">:centerline:</span></span>

A <span class="italic">lambda expression</span> is a (shorthand) implementation of the only abstract method
in a <span class="italic">functional interface</span> &#8212;&#8212;&#8211;which is an interface that has exactly one abstract
method, and possibly <span class="writegood-weasels">many</span> default methods.

For example, the following interface is a functional interface: It has only one abstract method.
<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block">  </span><span class="org-block"><span class="keyword">public</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">interface</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Predicate</span></span><span class="org-block">&lt;</span><span class="org-block"><span class="type">T</span></span><span class="org-block">&gt; {

      </span><span class="org-block"><span class="type">boolean</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">test</span></span><span class="org-block">(</span><span class="org-block"><span class="type"><span class="writegood-duplicates">T</span></span></span><span class="org-block"><span class="writegood-duplicates"> </span></span><span class="org-block"><span class="variable-name"><span class="writegood-duplicates">t</span></span></span><span class="org-block">);  </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">This is the abstract method
</span></span><span class="org-block">
      </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Other non-abstract methods.
</span></span><span class="org-block">      </span><span class="org-block"><span class="keyword">default</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Predicate</span></span><span class="org-block">&lt;</span><span class="org-block"><span class="type">T</span></span><span class="org-block">&gt; </span><span class="org-block"><span class="function-name">and</span></span><span class="org-block">(</span><span class="org-block"><span class="type">Predicate</span></span><span class="org-block">&lt;? </span><span class="org-block"><span class="keyword">super</span></span><span class="org-block"> </span><span class="org-block"><span class="type">T</span></span><span class="org-block">&gt; </span><span class="org-block"><span class="variable-name">other</span></span><span class="org-block">) { ... }
      </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Example usage: nonNull.and(nonEmpty).and(shorterThan5)
</span></span><span class="org-block">      </span><span class="org-block"><span class="keyword">static</span></span><span class="org-block"> &lt;</span><span class="org-block"><span class="type">T</span></span><span class="org-block">&gt; </span><span class="org-block"><span class="type">Predicate</span></span><span class="org-block">&lt;</span><span class="org-block"><span class="type">T</span></span><span class="org-block">&gt; </span><span class="org-block"><span class="function-name">isEqual</span></span><span class="org-block">(</span><span class="org-block"><span class="type">T</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">target</span></span><span class="org-block">) {...}
      </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Example usage: Predicate.isEqual("Duke") is a new predicate to use.
</span></span><span class="org-block">  }
</span><span class="org-block-end-line">#+end_src
</span>
Optionally, to ensure that this <span class="writegood-passive-voice">is indeed</span> a functional interface, i.e., it has
only one abstract method, we can place <span class="org-verbatim">@FunctionalInterface</span> above its
declaration. Then the complier will check our intention for us.

<span class="org-hide">*</span><span class="org-level-2">* The Type of a Lambda </span><span class="org-level-2"><span class="org-tag">:centerline:</span></span>

Anyhow, since a lambda is a shorthand implementation of an interface, this means
that what you can do with a lambda depenends on the interface it's impementing!

As such, when you see a lambda it's important to know it's type is not "just a function"!
This mean <span class="bold">to run/apply/execute a lambda variable</span> you need to remember that the variable
is technically an object implementing a specific functional interface, which has a single
<span class="italic">named</span> abstract method (which <span class="writegood-passive-voice">is implemented</span> by the lambda) and so we need to invoke that
method on our lambda variable to actually run the lambda. For example,
<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block">  </span><span class="org-block"><span class="type">Predicate</span></span><span class="org-block">&lt;</span><span class="org-block"><span class="type">String</span></span><span class="org-block">&gt; </span><span class="org-block"><span class="variable-name">f</span></span><span class="org-block"> = s -&gt; s.length() == 3;   </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Make a lambda variable
</span></span><span class="org-block">  </span><span class="org-block"><span class="type">boolean</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">isLength3String</span></span><span class="org-block"> = f.test(</span><span class="org-block"><span class="string">"hola"</span></span><span class="org-block">);     </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Actually invoke it.
</span></span><span class="org-block-end-line">#+end_src
</span>
Since different lambdas may implement different interfaces, the actually method
to run the lambda will likely be different! Moreover, you can invoke <span class="italic">any</span> method
on the interface that the lambda is implementing. After-all, a lambda is an object; not just a function.

Moreover, <span class="org-code">Function</span> has useful methods: Such as <span class="org-code">andThen</span> for composing functions sequentially,
and <span class="org-code">Function.identity</span> for the do-nothing function.

<span class="org-hide">*</span><span class="org-level-2">* Common Java Functional Types </span><span class="org-level-2"><span class="org-tag">:centerline:</span></span>

Anyhow, <span class="org-link"><a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/util/function/package-summary.html">Java has ~40 functional interfaces</a></span>, which are essentially useful variations around the following 4:
<span class="org-table">|---------------------+--------+--------------------------------------------------------------------|</span>
<span class="org-table">| Class               | runner | Description &amp; example                                              |</span>
<span class="org-table">|---------------------+--------+--------------------------------------------------------------------|</span>
<span class="org-table">| </span><span class="org-macro">src(Supplier&lt;T&gt;)</span><span class="org-table">    | </span><span class="org-table"><span class="org-code">get</span></span><span class="org-table">    | Makes objects for us; e.g., </span><span class="org-macro">src(() -&gt; "Hello"!)</span><span class="org-table">.                    |</span>
<span class="org-table">| </span><span class="org-macro">src(Consumer&lt;T&gt;)</span><span class="org-table">    | </span><span class="org-table"><span class="org-code">accept</span></span><span class="org-table"> | Does stuff with our objects, returning void;                       |</span>
<span class="org-table">|                     |        | e.g., </span><span class="org-macro">src(s -&gt; System.out.println(s))</span><span class="org-table">.                              |</span>
<span class="org-table">| </span><span class="org-macro">src(Predicate&lt;T&gt;)</span><span class="org-table">   | </span><span class="org-table"><span class="org-code">test</span></span><span class="org-table">   | Tests our object for </span><span class="org-table"><span class="writegood-weasels">some</span></span><span class="org-table"> property, returning a boolean            |</span>
<span class="org-table">|                     |        | e.g., </span><span class="org-macro">src(s -&gt; s.length() == 3)</span><span class="org-table">                                      |</span>
<span class="org-table">| </span><span class="org-macro">src(Function&lt;T, R&gt;)</span><span class="org-table"> | </span><span class="org-table"><span class="org-code">apply</span></span><span class="org-table">  | Takes our object and gives us a new one; e.g., </span><span class="org-macro">src(s -&gt; s.length())</span><span class="org-table"> |</span>
<span class="org-table">|---------------------+--------+--------------------------------------------------------------------|</span>

For example, <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">&#119966;::new</span><span class="shadow"><span class="org-inline-src-block">}</span></span> is a supplier for the
class &#119966;, and the <span class="org-link"><a href="https://docs.oracle.com/en/java/javase/19/docs/api/java.base/java/lang/Iterable.html#forEach(java.util.function.Consumer)">forEach</a></span> method on iterables actually uses a consumer
lambda, and a supplier can <span class="writegood-passive-voice">be used</span> to <span class="org-link"><a href="https://stackoverflow.com/questions/36255007/is-there-any-way-to-reuse-a-stream">reuse streams</a></span> (discussed below).

The remaining Java functional interfaces are variations on these 4
that <span class="writegood-passive-voice">are optimised</span> for primitive types, or have different number of
inputs as functions. For example, <span class="org-code">UnaryOperator&lt;T&gt;</span> is essentially
<span class="org-code">Function&lt;T, T&gt;</span>, and <span class="org-code">BiFunction&lt;A, B, C&gt;</span> is essentially
<span class="org-code">Function&lt;A, Function&lt;B, C&gt;&gt;</span> &#8212;&#8212;&#8212;not equivalent, but essentially the
same thing.

- As another example, Java has a <span class="org-code">TriConsumer</span> which is the type of functions that have 3 inputs and no outputs
  ---since <span class="org-code">Tri</span> means 3, as in <span class="italic">tricycle</span>.
