posts/java-cheat-sheet.org
** Eta Reduction: Writing Lambda Expressions as Method References :centerline:

Lambdas can sometimes be simplified by using /method reference/:

| Method type |   |                       |   |                                    |
|-------------+---+-----------------------+---+------------------------------------|
| Static      |   | $(x,ys) → τ.f(x, ys)$ | ≈ | $τ::f$                             |
| Instance    |   | $(x,ys) → x.f(ys)$    | ≈ | $τ::f$, where τ is the type of $x$ |
| Constructor |   | ~args → new τ<A>(args)~ | ≈ | ~τ<A>::new~                          |

For example, src_java[:exports code]{(sentence, word) -> sentence.indexOf(word)} is the same
as src_java[:exports code]{String::indexOf}. Likewise, src_java[:exports code]{(a, b) -> Integer.max(a,
b)} is just src_java[:exports code]{Integer::max}.

+ Note that a class name τ might be qualified; e.g., src_java[:exports code]{x ->
  System.out.println(x)} is just src_java[:exports code]{System.out::println}.

