java-cheat-sheet.org.html

<span class="org-hide">*</span><span class="org-level-2">* Eta Reduction: Writing Lambda Expressions as Method References </span><span class="org-level-2"><span class="org-tag">:centerline:</span></span>

Lambdas can sometimes <span class="writegood-passive-voice">be simplified</span> by using <span class="italic">method reference</span>:

<span class="org-table">| Method type |   |                       |   |                                    |</span>
<span class="org-table">|-------------+---+-----------------------+---+------------------------------------|</span>
<span class="org-table">| Static      |   |</span><span class="org-table"><span class="org-latex-and-related"> $(x,ys) &#8594; &#964;.f(x, ys)$ </span></span><span class="org-table">| &#8776; |</span><span class="org-table"><span class="org-latex-and-related"> $&#964;::f$ </span></span><span class="org-table">                            |</span>
<span class="org-table">| Instance    |   |</span><span class="org-table"><span class="org-latex-and-related"> $(x,ys) &#8594; x.f(ys)$ </span></span><span class="org-table">   | &#8776; |</span><span class="org-table"><span class="org-latex-and-related"> $&#964;::f$,</span></span><span class="org-table"> where &#964; is the type of</span><span class="org-table"><span class="org-latex-and-related"> $x$ </span></span><span class="org-table">|</span>
<span class="org-table">| Constructor |   | </span><span class="org-table"><span class="org-code">args &#8594; new &#964;&lt;A&gt;(args)</span></span><span class="org-table"> | &#8776; | </span><span class="org-table"><span class="org-code">&#964;&lt;A&gt;::new</span></span><span class="org-table">                          |</span>

For example, <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">(sentence, word) -&gt; sentence.indexOf(word)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> is the same
as <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">String::indexOf</span><span class="shadow"><span class="org-inline-src-block">}</span></span>. Likewise, <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">(a, b) -&gt; Integer.max(a,
b)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> is just <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Integer::max</span><span class="shadow"><span class="org-inline-src-block">}</span></span>.

+ Note that a class name &#964; might <span class="writegood-passive-voice">be qualified</span>; e.g., <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">x -&gt;
  System.out.println(x)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> is just <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">System.out::println</span><span class="shadow"><span class="org-inline-src-block">}</span></span>.
