posts/java-cheat-sheet.org
* Variable Bindings

Let's declare some new names, and assert what we know about them.
#+BEGIN_center
src_java[:exports code]{Integer x, y = 1, z;}

#+latex: \vspace{-1em}
src_java[:exports code]{assert x == null && y == 1 && z == null;}
#+END_center

@@latex:\hspace{-1em}@@
~τ x₀ = v₀, …, xₙ = vₙ;~ introduces 𝓃-new names ~xᵢ~ each having value ~vᵢ~ of type τ.
    - The ~vᵢ~ are optional, defaulting to src_java[:exports code]{ 0, false,} ='\000'=,
      src_java[:exports code]{null } for numbers, booleans, characters, and
      object types, respectively.
    - Later we use ~xᵢ = wᵢ;~ to update the name ~xᵢ~ to refer to a new value
      ~wᵢ~.


      #+html: <hr>
      #+begin_parallel 2 :bar t
     There are a variety of update statements:
     Suppose $τ$ is the type of $x$ then,
     #+latex: \vspace{.7em}
        | Augment:  ~x ⊕= y  ≈  x = (τ)(x ⊕ y)~   |
        | Increment:   ~x++  ≈  x += 1)~         |
        | Decrement:  ~x--  ≈  x -= 1)~          |

        #+columnbreak:

        The operators ~--~ and ~++~ can appear /before or after/ a name:
        Suppose $𝒮(x)$ is a statement mentioning the name $x$, then
        #+latex: \vspace{.7em}
        | ~𝒮(x++)  ≈  𝒮(x); x += 1~ |
        | ~𝒮(++x)  ≈  x += 1; 𝒮(x)~ |

     #+end_parallel

        # * We also have /augmented updates/   ~x ⊕= y  ≡  x = (τ)(x ⊕ y)~   and
        # | Increment: ~x--  ≡  x += 1~ | and | Decrement: ~y--  ≡  x -= 1~ |
        #
        # The operators ~--~ and ~++~ can appear /before or after/ a name:
        # \newline Suppose $𝒮(x)$ is a statement mentioning the name $x$, then
        # | ~𝒮(x++)  ≈  𝒮(x); x += 1~  | and | ~𝒮(++x)  ≈  x += 1; 𝒮(x)~  |

     # Note “+=” works for both numbers and strings:
     # String a = "hello";
     # a += " world";

     Since compound assignment is really an [[https://docs.oracle.com/javase/specs/jls/se11/html/jls-15.html#jls-15.26.2][update with a /cast/]],
     there could be unexpected behaviour when $x$ and $y$ are not both
     ints/floats.

     :Example:
     short a = 0; // 16-bit integer
     int b = 123456; // 32-bit integer
     a = b; // Error: Possible loss of converion
     a += b; // Now: a == -7616 due to hidden cast!

     Long story short, don't use compound assignment operators on byte, short and char types.
     :End:

     #+html: <hr>

- If we place the keyword src_java[:exports code]{final} before the type τ,
  then the names are constant: They can appear only once on the right side of an ‘=’,
  and any further occurrences (i.e., to change their values) crash the program.
  src_java[:exports code]{ final int x = 1, y; y = 3; } is fine, but changing the
  second =y= to an =x= fails.

  :REPL:
  { final int x = 0; x = 4; }

  Need the braces; see https://arbitrary-but-fixed.net/java/jshell/2018/01/17/jshell-final-toplevel-declarations.html
  :End:

- We may use src_java[:exports code]{var x = v}, for only /one/
  declaration, to avoid writing the name of the type τ (which may be
  lengthy). Java then /infers/ the type by inspecting the shape of
  =v=.

- Chained assignments associate to the right:
  | ~a += b /= 2 * ++c;~ |  ≈  | ~a += (b /= (2 * ++c));~ |
  (The left side of an “=”, or “⊕=”, must a single name!)

  :Example:
  int a, b, c, d = 1, e, f; a += b *= c /= d += e = 2 * ++f;
List.of(a, b, c, d, e, f).equals(List.of(0, 0, 0, 3, 2, 1))

int a, b, c, d = 1, e, f; a += (b *= (c /= (d += (e = (2 * ++f)))));
List.of(a, b, c, d, e, f).equals(List.of(0, 0, 0, 3, 2, 1))
  :End:

# - A binding name may include dollar signs ($) or underscores (_) or
#   numbers but no other punctuation or special characters.
#
# #+html: <hr>
# Variable bindings can only occur within src_java[:exports code]{class}
# definitions: A =class= binding introduces a name for a new type of
# values.
#
