java-cheat-sheet.org.html

<span class="org-level-1">* Variable Bindings</span>

Let's declare <span class="writegood-weasels">some</span> new names, and assert what we know about them.
<span class="org-block-begin-line">#+BEGIN_center
</span><span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Integer x, y = 1, z;</span><span class="shadow"><span class="org-inline-src-block">}</span></span>

#+latex: \vspace{-1em}
<span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">assert x = null &amp;&amp; y = 1 &amp;&amp; z = null;</span><span class="shadow"><span class="org-inline-src-block">}</span></span>
<span class="org-block-end-line">#+END_center
</span>
<span class="comment">@@</span><span class="org-tag">latex:</span>\hspace{-1em}<span class="comment">@@</span>
<span class="org-code">&#964; x&#8320; = v&#8320;, &#8230;, x&#8345; = v&#8345;;</span> introduces &#120003;-new names <span class="org-code">x&#7522;</span> each having value <span class="org-code">v&#7522;</span> of type &#964;.
    - The <span class="org-code">v&#7522;</span> are optional, defaulting to <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block"> 0, false,</span><span class="shadow"><span class="org-inline-src-block">}</span></span> <span class="org-verbatim">'\000'</span>,
      <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">null </span><span class="shadow"><span class="org-inline-src-block">}</span></span> for numbers, booleans, characters, and
      object types, respectively.
    - Later we use <span class="org-code">x&#7522; = w&#7522;;</span> to update the name <span class="org-code">x&#7522;</span> to refer to a new value
      <span class="org-code">w&#7522;</span>.


<span class="org-meta-line">      #+html: &lt;hr&gt;</span>
<span class="org-block-begin-line">      #+begin_parallel 2 :bar t
</span><span class="org-block">     There are a variety of update statements:
     Suppose $&#964;$ is the type of $x$ then,
     #+latex: \vspace{.7em}
        | Augment:&#160; x &#8853;= y &#160;&#8776;&#160; x = (&#964;)(x &#8853; y)   |
        | Increment:&#160;&#160; x++ &#160;&#8776;&#160; x += 1)         |
        | Decrement:&#160; x-- &#160;&#8776;&#160; x -= 1)          |

        #+columnbreak:

        The operators -- and ++ can appear before or after a name:
        Suppose $&#119982;(x)$ is a statement mentioning the name $x$, then
        #+latex: \vspace{.7em}
        | &#119982;(x++) &#160;&#8776;&#160; &#119982;(x); x += 1 |
        | &#119982;(++x) &#160;&#8776;&#160; x += 1; &#119982;(x) |

</span><span class="org-block-end-line">     #+end_parallel
</span>
<span class="comment">        # * We also have /augmented updates/ &#160; ~x &#8853;= y &#160;&#8801;&#160; x = (&#964;)(x &#8853; y)~ &#160; and</span>
<span class="comment">        # | Increment: ~x-- &#160;&#8801;&#160; x += 1~ | and | Decrement: ~y-- &#160;&#8801;&#160; x -= 1~ |</span>
<span class="comment">        #</span>
<span class="comment">        # The operators ~--~ and ~++~ can appear /before or after/ a name:</span>
<span class="comment">        # \newline Suppose $&#119982;(x)$ is a statement mentioning the name $x$, then</span>
<span class="comment">        # | ~&#119982;(x++) &#160;&#8776;&#160; &#119982;(x); x += 1~  | and | ~&#119982;(++x) &#160;&#8776;&#160; x += 1; &#119982;(x)~  |</span>

<span class="comment">     # Note &#8220;+=&#8221; works for both numbers and strings:</span>
<span class="comment">     # String a = "hello";</span>
<span class="comment">     # a += " world";</span>

     Since compound assignment is really an <span class="org-link"><a href="https://docs.oracle.com/javase/specs/jls/se11/html/jls-15.html#jls-15.26.2">update with a /cast/</a></span>,
     there could <span class="writegood-passive-voice">be unexpected</span> behaviour when<span class="org-latex-and-related"> $x$ </span>and<span class="org-latex-and-related"> $y$ </span>are not both
     ints/floats.

     <span class="org-drawer">:Example:</span>
     short a = 0; <span class="italic">/ 16-bit integer
     int b = 123456;  32-bit integer
     a = b;  Error: Possible loss of converion
     a += b; /</span> Now: a == -7616 due to hidden cast!

     Long story short, don't use compound assignment operators on byte, short and char types.
     <span class="org-drawer">:End:</span>

<span class="org-meta-line">     #+html: &lt;hr&gt;</span>

- If we place the keyword <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">final</span><span class="shadow"><span class="org-inline-src-block">}</span></span> before the type &#964;,
  then the names are constant: They can appear only once on the right side of an &#8216;=&#8217;,
  and any further occurrences (i.e., to change their values) crash the program.
  <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block"> final int x = 1, y; y = 3; </span><span class="shadow"><span class="org-inline-src-block">}</span></span> is fine, but changing the
  second <span class="org-verbatim">y</span> to an <span class="org-verbatim">x</span> fails.

  <span class="org-drawer">:REPL:</span>
  { final int x = 0; x = 4; }

  Need the braces; see <span class="org-link"><a href="https://arbitrary-but-fixed.net/java/jshell/2018/01/17/jshell-final-toplevel-declarations.html">https://arbitrary-but-fixed.net/java/jshell/2018/01/17/jshell-final-toplevel-declarations.html</a></span>
  <span class="org-drawer">:End:</span>

- We may use <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">var </span><span class="org-block"><span class="variable-name">x</span></span><span class="org-block"> = v</span><span class="shadow"><span class="org-inline-src-block">}</span></span>, for only <span class="italic">one</span>
  declaration, to avoid writing the name of the type &#964; (which may be
  lengthy). Java then <span class="italic">infers</span> the type by inspecting the shape of
  <span class="org-verbatim">v</span>.

- Chained assignments associate to the right:
  <span class="org-table">| </span><span class="org-table"><span class="org-code">a += b /= 2 * ++c;</span></span><span class="org-table"> | &#160;&#8776;&#160; | </span><span class="org-table"><span class="org-code">a += (b /= (2 * ++c));</span></span><span class="org-table"> |</span>
  (The left side of an &#8220;=&#8221;, or &#8220;&#8853;=&#8221;, must a single name!)

  <span class="org-drawer">:Example:</span>
  int a, b, c, d = 1, e, f; a += b *= c /= d += e = 2 * ++f;
List.of(a, b, c, d, e, f).equals(List.of(0, 0, 0, 3, 2, 1))

int a, b, c, d = 1, e, f; a += (b *= (c /= (d += (e = (2 * ++f)))));
List.of(a, b, c, d, e, f).equals(List.of(0, 0, 0, 3, 2, 1))
  <span class="org-drawer">:End:</span>

<span class="comment"># - A binding name may include dollar signs ($) or underscores (_) or</span>
<span class="comment">#   numbers but no other punctuation or special characters.</span>
<span class="comment">#</span>
<span class="comment"># #+html: &lt;hr&gt;</span>
<span class="comment"># Variable bindings can only occur within </span><span class="org-inline-src-block"><span class="shadow"><span class="comment">src_</span></span></span><span class="org-inline-src-block"><span class="org-meta-line"><span class="comment">java</span></span></span><span class="org-inline-src-block"><span class="comment">[:exports code]</span></span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">class</span><span class="shadow"><span class="org-inline-src-block">}</span></span>
<span class="comment"># definitions: A =class= binding introduces a name for a new type of</span>
<span class="comment"># values.</span>
<span class="comment">#</span>
