posts/java-cheat-sheet.org
* Scope, Statements, and Control Flow :noexport_pdf:

# #
#+begin_parallel 2
#+begin_src java
var x = 1;

{ // new local scope
  var x = 200; // “shadows” top x
  var y = 300;
  assert x + y == 500;
}

// y is not visible here
assert y == 20; // CRASH!

// The top-most x has not changed
assert x == 1;
#+END_SRC

#+latex: \columnbreak

⊙ Each binding has a scope, which is the part of the program in which
the binding is visible.

#+latex: \vspace{1em}
⊙ /local bindings/ are defined within a block and can only be referenced in it.


#+latex: \vspace{1em}
⊙ Names within a block /shadow//hide bindings with the same name.
#+end_parallel


Besides the assignment statement, we also have the following statements:
+ Blocks: If ~Sᵢ~ are statements, then ~{S₀; …; Sₙ;}~ is a statement.
+ Conditionals: src_java[:exports code]{if (condition) S₁ else S₂}
+ The “for-each” syntax applies to iterable structures
  ---we will define our own later.
  #+BEGIN_SRC java
// Print all the elements in the given list.
for (var x : List.of(1, 2, 3))
   System.out.printf("x ≈ %s\n", x);
#+END_SRC

+ While-Loops src_java[:exports code]{ while (condition) S } and for-loops
  src_java[:exports code]{ for(init; cond; change) body }.

    #+begin_src java
   var i = 0; while (i < 10) System.out.println(Math.pow(2, i++));
≈
   for(var i = 0; i < 10; i++) System.out.println(Math.pow(2, i));
 #+end_src

 #  ~for~ rewrites to a ~while~ loop:
 #  src_java[:exports code]{for(init; cond; change) body  ≈  init;
 #  while(cond){body; change;}}. As such, all three pieces of ~for~ are optional.

 Exit the current loop with the src_java[:exports code]{break;}
  statement.  Similarly, the src_java[:exports code]{continue;}
  statement jumps out of the body and continues with the next
  iteration of the loop.

* src_java[:exports code]{switch} :noexport_pdf:

Dispatching on a value with switch

#+begin_parallel
  *⟦Switch Statement⟧*
   #+begin_src java
switch (x){
  case v₁: S₁
  ⋮
  case vₙ: Sₙ
  default: Sₙ
}
#+end_src

#+columnbreak:

   The src_java[:exports code]{switch} works as follows:
   Find the /first/ 𝒾 with ~x == vᵢ~, then execute
   ~{Sᵢ; ⋯; Sₘ;}~, if there is no such 𝒾, execute the
   default statement ~Sₙ~. Where ~Sₘ~ is the first
   statement after ~Sᵢ~ that ends with ~break;~.

#+end_parallel

   E.g., ~case v: S; case w: S′; break~
   means do ~S;S′~ if we see ~v~
   but we do ~S′~
   when seeing both ~v~ and ~w~.

    #+begin_src java
switch (2){
  case 0: System.out.println(0);
  case 1: System.out.println(1);
  case 2: System.out.println(2);
  default: System.out.println(-1);
} // ⇒ Outputs: 2 -1
#+end_src

#+html: <hr>

   *⟦Switch Expression⟧*
   If we want to perform case analysis /without the fall-over behaviour/, we use
   arrows ‘→’ instead of colons ‘:’.
   #+begin_src java
   switch (2){
     case 0 -> 0;
     case 1 -> 1;
     case 2 -> 2;
     default -> -1;
   } // ⇒ 2
   #+end_src

