java-cheat-sheet.org.html
<span class="org-level-1">* Scope, Statements, and Control Flow </span><span class="org-level-1"><span class="org-tag">:noexport_pdf:</span></span>

<span class="comment"># #</span>
<span class="org-block-begin-line">#+begin_parallel 2
</span><span class="org-block">#+begin_src java
var x = 1;

{ / new local scope
  var x = 200; / &#8220;shadows&#8221; top x
  var y = 300;
  assert x + y == 500;
}

/ y is not visible here
assert y == 20; / CRASH!

// The top-most x has not changed
assert x == 1;
#+END_SRC

#+latex: \columnbreak

&#8857; Each binding has a scope, which is the part of the program in which
the binding is visible.

#+latex: \vspace{1em}
&#8857; local bindings </span><span class="org-block"><span class="writegood-passive-voice">are defined</span></span><span class="org-block"> within a block and can only </span><span class="org-block"><span class="writegood-passive-voice">be referenced</span></span><span class="org-block"> in it.


#+latex: \vspace{1em}
&#8857; Names within a block /shadow//hide bindings with the same name.
</span><span class="org-block-end-line">#+end_parallel
</span>

Besides the assignment statement, we also have the following statements:
+ Blocks: If <span class="org-code">S&#7522;</span> are statements, then <span class="org-code">{S&#8320;; &#8230;; S&#8345;;}</span> is a statement.
+ Conditionals: <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">if (condition) S&#8321; else S&#8322;</span><span class="shadow"><span class="org-inline-src-block">}</span></span>
+ The &#8220;for-each&#8221; syntax applies to iterable structures
  ---we will define our own later.
<span class="org-block-begin-line">  #+BEGIN_SRC java
</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Print all the elements in the given list.
</span></span><span class="org-block"><span class="keyword">for</span></span><span class="org-block"> (</span><span class="org-block"><span class="type">var</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">x</span></span><span class="org-block"> : List.of(1, 2, 3))
   System.out.printf(</span><span class="org-block"><span class="string">"x &#8776; %s\n"</span></span><span class="org-block">, x);
</span><span class="org-block-end-line">#+END_SRC
</span>
+ While-Loops <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">&#160;while (condition) S&#160;</span><span class="shadow"><span class="org-inline-src-block">}</span></span> and for-loops
  <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">&#160;for(init; cond; change) body&#160;</span><span class="shadow"><span class="org-inline-src-block">}</span></span>.

<span class="org-block-begin-line">    #+begin_src java
</span><span class="org-block">   </span><span class="org-block"><span class="type">var</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">i</span></span><span class="org-block"> = 0; </span><span class="org-block"><span class="keyword">while</span></span><span class="org-block"> (i &lt; 10) System.out.println(Math.pow(2, i++));
&#8776;
   </span><span class="org-block"><span class="keyword">for</span></span><span class="org-block">(</span><span class="org-block"><span class="type">var</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">i</span></span><span class="org-block"> = 0; i &lt; 10; i++) System.out.println(Math.pow(2, i));
</span><span class="org-block-end-line"> #+end_src
</span>
<span class="comment"> #  ~for~ rewrites to a ~while~ loop:</span>
<span class="comment"> #  </span><span class="org-inline-src-block"><span class="shadow"><span class="comment">src_</span></span></span><span class="org-inline-src-block"><span class="org-meta-line"><span class="comment">java</span></span></span><span class="org-inline-src-block"><span class="comment">[:exports code]</span></span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block"><span class="keyword">for</span></span><span class="org-block">(init; cond; change) body &#160;&#8776;&#160; init;
 #  </span><span class="org-block"><span class="keyword">while</span></span><span class="org-block">(cond){body; change;}</span><span class="shadow"><span class="org-inline-src-block">}</span></span><span class="comment">. As such, all three pieces of ~for~ are optional.</span>

 Exit the current loop with the <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">break;</span><span class="shadow"><span class="org-inline-src-block">}</span></span>
  statement.  Similarly, the <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">continue;</span><span class="shadow"><span class="org-inline-src-block">}</span></span>
  statement jumps out of the body and continues with the next
  iteration of the loop.

<span class="org-level-1">* </span><span class="org-inline-src-block"><span class="shadow"><span class="org-level-1">src_</span></span></span><span class="org-inline-src-block"><span class="org-meta-line"><span class="org-level-1">java</span></span></span><span class="org-inline-src-block"><span class="org-level-1">[:exports code]</span></span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">switch</span><span class="shadow"><span class="org-inline-src-block">}</span></span><span class="org-level-1"> </span><span class="org-level-1"><span class="org-tag">:noexport_pdf:</span></span>

Dispatching on a value with switch

<span class="org-block-begin-line">#+begin_parallel
</span>  <span class="bold">&#10214;Switch Statement&#10215;</span>
   #+begin_src java
switch (x){
  case v&#8321;: S&#8321;
  &#8942;
  case v&#8345;: S&#8345;
  default: S&#8345;
}
#+end_src

#+columnbreak:

   The <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">switch</span><span class="shadow"><span class="org-inline-src-block">}</span></span> works as follows:
   Find the <span class="italic">first</span> &#119998; with <span class="org-code">x == v&#7522;</span>, then execute
   <span class="org-code">{S&#7522;; &#8943;; S&#8344;;}</span>, if there is no such &#119998;, execute the
   default statement <span class="org-code">S&#8345;</span>. Where <span class="org-code">S&#8344;</span> is the first
   statement after <span class="org-code">S&#7522;</span> that ends with <span class="org-code">break;</span>.

<span class="org-block-end-line">#+end_parallel
</span>
   E.g., <span class="org-code">case v: S; case w: S&#8242;; break</span>
   means do <span class="org-code">S;S&#8242;</span> if we see <span class="org-code">v</span>
   but we do <span class="org-code">S&#8242;</span>
   when seeing both <span class="org-code">v</span> and <span class="org-code">w</span>.

<span class="org-block-begin-line">    #+begin_src java
</span><span class="org-block"><span class="keyword">switch</span></span><span class="org-block"> (2){
  </span><span class="org-block"><span class="keyword">case</span></span><span class="org-block"> 0: System.out.println(0);
  </span><span class="org-block"><span class="keyword">case</span></span><span class="org-block"> 1: System.out.println(1);
  </span><span class="org-block"><span class="keyword">case</span></span><span class="org-block"> 2: System.out.println(2);
  </span><span class="org-block"><span class="keyword">default</span></span><span class="org-block">: System.out.println(-1);
} </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; Outputs: 2 -1
</span></span><span class="org-block-end-line">#+end_src
</span>
<span class="org-meta-line">#+html: &lt;hr&gt;</span>

   <span class="bold">&#10214;Switch Expression&#10215;</span>
   If we want to perform case analysis <span class="italic">without the fall-over behaviour</span>, we use
   arrows &#8216;&#8594;&#8217; instead of colons &#8216;:&#8217;.
<span class="org-block-begin-line">   #+begin_src java
</span><span class="org-block">   </span><span class="org-block"><span class="keyword">switch</span></span><span class="org-block"> (2){
     </span><span class="org-block"><span class="keyword">case</span></span><span class="org-block"> 0 -&gt; 0;
     </span><span class="org-block"><span class="keyword">case</span></span><span class="org-block"> 1 -&gt; 1;
     </span><span class="org-block"><span class="keyword">case</span></span><span class="org-block"> 2 -&gt; 2;
     </span><span class="org-block"><span class="keyword">default</span></span><span class="org-block"> -&gt; -1;
   } </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; 2
</span></span><span class="org-block-end-line">   #+end_src
</span>
<span class="org-level-1">* Strings</span>
