posts/java-cheat-sheet.org
* Strings

Any pair of matching double-quotes will produce a string literal
---whereas single-quote around a single character produce a
src_java[:exports code]{char}acter value. For multi-line strings, use
triple quotes, ="""=, to produce /text blocks/.

String interpolation can be done with ~String.format~ using ~%s~
placeholders.  For advanced interpolation, such as positional
placeholders, use [[https://docs.oracle.com/javase/8/docs/api/java/text/MessageFormat.html][MessageFormat]].

#+BEGIN_SRC java
String.format("Half of 100 is %s", 100 / 2) // ⇒ "Half of 100 is 50"
#+END_SRC

# import java.text.MessageFormat;
# MessageFormat.format("G {0}", 12)

+ ~s.repeat(𝓃)~ ≈ Get a new string by gluing 𝓃-copies of the string 𝓈.
+ ~s.toUpperCase()~ and ~s.toLowerCase()~ to change case.
+ Trim removes spaces, newlines, tabs, and other whitespace from the start and
  end of a string.
  E.g., src_java[:exports code]{"  okay \n ".trim().equals("okay")}
+ ~s.length()~ is the number of characters in the string.
+ ~s.isEmpty()  ≡  s.length() == 0~
+ ~s.isBlank()  ≡  s.trim().isEmpty()~
+ ~String.valueOf(x)~ gets a string representation of anything ~x~.
+ ~s.concat(t)~ glues together two strings into one longer string; i.e., ~s + t~.

* Equality

+ In general, ‘==’ is used to check two primitives for equality, whereas
  =.equals= is used to check if two objects are equal.

+ The equality operator ‘==’ means “two things are indistinguishable:
  They evaluate to the same literal value, or refer to the same place in memory”.

+ As a method, ~.equals~ can be redefined to obtain a suitable notion
  of equality between objects; e.g., “two people are the same if they
  have the same name (regardless of anything else)”.  If it's not
  redefined, ~.equals~ behaves the same as ‘==’.  In contrast, Java
  does not support operator overloading and so ‘==’ cannot be
  redefined.

+ For strings, ‘==’ and ~.equals~ behave differently:
  src_java[:exports code]{new String("x") == new String("x")} is false, but
  src_java[:exports code]{new String("x").equals(new String("x"))} is
  true!  The first checks that two things refer to the same place
  in memory, the second checks that they have the same letters in the
  same order.
  - If we want this kind of “two objects are equal when they have the
    same contents” behaviour, we can get it for free by using
    src_java[:exports code]{record}s instead of src_java[:exports
    code]{class}es.

# ?? + Precedence: Relationals like ~==~ and ~>~ are first, then “and” ~&&~, then “or” ~||~.
#
# + The ternary operator: =condition ? if_true : if_false=
#
# && and || are lazy.

