java-cheat-sheet.org.html

Any pair of matching double-quotes will produce a string literal
---whereas single-quote around a single character produce a
<span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">char</span><span class="shadow"><span class="org-inline-src-block">}</span></span>acter value. For multi-line strings, use
triple quotes, <span class="org-verbatim">"""</span>, to produce <span class="italic">text blocks</span>.

String interpolation can <span class="writegood-passive-voice">be done</span> with <span class="org-code">String.format</span> using <span class="org-code">%s</span>
placeholders.  For advanced interpolation, such as positional
placeholders, use <span class="org-link"><a href="https://docs.oracle.com/javase/8/docs/api/java/text/MessageFormat.html">MessageFormat</a></span>.

<span class="org-block-begin-line">#+BEGIN_SRC java
</span><span class="org-block">String.format(</span><span class="org-block"><span class="string">"Half of 100 is %s"</span></span><span class="org-block">, 100 / 2) </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; "Half of 100 is 50"
</span></span><span class="org-block-end-line">#+END_SRC
</span>
<span class="comment"># import java.text.MessageFormat;</span>
<span class="comment"># MessageFormat.format("G {0}", 12)</span>

+ <span class="org-code">s.repeat(&#120003;)</span> &#8776; Get a new string by gluing &#120003;-copies of the string &#120008;.
+ <span class="org-code">s.toUpperCase()</span> and <span class="org-code">s.toLowerCase()</span> to change case.
+ Trim removes spaces, newlines, tabs, and other whitespace from the start and
  end of a string.
  E.g., <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">"  okay \n ".trim().equals("okay")</span><span class="shadow"><span class="org-inline-src-block">}</span></span>
+ <span class="org-code">s.length()</span> is the number of characters in the string.
+ <span class="org-code">s.isEmpty() &#160;&#8801;&#160; s.length() == 0</span>
+ <span class="org-code">s.isBlank() &#160;&#8801;&#160; s.trim().isEmpty()</span>
+ <span class="org-code">String.valueOf(x)</span> gets a string representation of anything <span class="org-code">x</span>.
+ <span class="org-code">s.concat(t)</span> glues together two strings into one longer string; i.e., <span class="org-code">s + t</span>.

<span class="org-level-1">* Equality</span>

+ In general, &#8216;==&#8217; <span class="writegood-passive-voice">is used</span> to check two primitives for equality, whereas
  <span class="org-verbatim">.equals</span> <span class="writegood-passive-voice">is used</span> to check if two objects are equal.

+ The equality operator &#8216;==&#8217; means &#8220;two things are indistinguishable:
  They evaluate to the same literal value, or refer to the same place in memory&#8221;.

+ As a method, <span class="org-code">.equals</span> can <span class="writegood-passive-voice">be redefined</span> to obtain a suitable notion
  of equality between objects; e.g., &#8220;two people are the same if they
  have the same name (regardless of anything else)&#8221;.  If it's not
  redefined, <span class="org-code">.equals</span> behaves the same as &#8216;==&#8217;.  In contrast, Java
  does not support operator overloading and so &#8216;==&#8217; cannot <span class="writegood-passive-voice">be
  redefined</span>.

+ For strings, &#8216;==&#8217; and <span class="org-code">.equals</span> behave differently:
  <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">new </span><span class="org-block"><span class="type">String</span></span><span class="org-block">("x") == new </span><span class="org-block"><span class="type">String</span></span><span class="org-block">("x")</span><span class="shadow"><span class="org-inline-src-block">}</span></span> is false, but
  <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">new </span><span class="org-block"><span class="type">String</span></span><span class="org-block">("x").equals(new </span><span class="org-block"><span class="type">String</span></span><span class="org-block">("x"))</span><span class="shadow"><span class="org-inline-src-block">}</span></span> is
  true!  The first checks that two things refer to the same place
  in memory, the second checks that they have the same letters in the
  same order.
  - If we want this kind of &#8220;two objects are equal when they have the
    same contents&#8221; behaviour, we can get it for free by using
    <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">record</span><span class="shadow"><span class="org-inline-src-block">}</span></span>s instead of <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports
    code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">class</span><span class="shadow"><span class="org-inline-src-block">}</span></span>es.

<span class="comment"># ?? + Precedence: Relationals like ~==~ and ~&gt;~ are first, then &#8220;and&#8221; ~&amp;&amp;~, then &#8220;or&#8221; ~||~.</span>
<span class="comment">#</span>
<span class="comment"># + The ternary operator: =condition ? if_true : if_false=</span>
<span class="comment">#</span>
<span class="comment"># &amp;&amp; and || are lazy.</span>
