posts/java-cheat-sheet.org
** COMMENT Equality

References to the same object are equal, whereas different object literals
with the same properties are considered different.
#+BEGIN_SRC js
let a = {value: 10};
let b = a;
let c = {value: 10};

console.log(a == b); // ⇒ true
console.log(a == c); // ⇒ false

a.value = 15;
console.log(b.value); // ⇒ 15
console.log(c.value); // ⇒ 10
#+END_SRC

Since ~a~ and ~b~ refer to the same object, changing one also changes the value of
the other. However, ~c~ only superficially looks the same.

We say different objects with the same properties are “deeply equal”.
#+BEGIN_SRC js
  // If non-objects, perform strict equality. Else, recursively check they have
  // the (deeply) same values and properties.
  function deepEqual(x, y){
    if (typeof x != typeof y) return false;
    if (x && y && typeof x != 'object') return x === y; // Values
    let props = Object.keys(x).concat(Object.keys(y));
    for (let p of props) if (! deepEqual(x[p], y[p])) return false;
    return true;
  }

  let obj = {here: {is: "an"}, object: 2};
  console.log(deepEqual(obj, {here: 1, object: 2})); // ⇒ false
  console.log(deepEqual(obj, {here: {is: "an"}, object: 2})); // ⇒ true
  console.log(deepEqual(1, 0 + 1)); // ⇒ true
#+END_SRC

Because of a historical accident, ~typeof null~ produces ~"object"~.
