java-cheat-sheet.org.html

<span class="org-hide">*</span><span class="org-level-2">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-2"> Equality</span>

References to the same object are equal, whereas different object literals
with the same properties <span class="writegood-passive-voice">are considered</span> different.
<span class="org-block-begin-line">#+BEGIN_SRC js
</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">a</span></span><span class="org-block"> = {value: 10};
</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">b</span></span><span class="org-block"> = a;
</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">c</span></span><span class="org-block"> = {value: 10};

console.log(a == b); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; true
</span></span><span class="org-block">console.log(a == c); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; false
</span></span><span class="org-block">
a.value = 15;
console.log(b.value); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; 15
</span></span><span class="org-block">console.log(c.value); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; 10
</span></span><span class="org-block-end-line">#+END_SRC
</span>
Since <span class="org-code">a</span> and <span class="org-code">b</span> refer to the same object, changing one also changes the value of
the other. However, <span class="org-code">c</span> only superficially looks the same.

We say different objects with the same properties are &#8220;deeply equal&#8221;.
<span class="org-block-begin-line">#+BEGIN_SRC js
</span><span class="org-block">  </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">If non-objects, perform strict equality. Else, recursively check they have
</span></span><span class="org-block">  </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">the (deeply) same values and properties.
</span></span><span class="org-block">  </span><span class="org-block"><span class="keyword">function</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">deepEqual</span></span><span class="org-block">(</span><span class="org-block"><span class="variable-name">x</span></span><span class="org-block">, </span><span class="org-block"><span class="variable-name">y</span></span><span class="org-block">){
    </span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (</span><span class="org-block"><span class="keyword">typeof</span></span><span class="org-block"> x != </span><span class="org-block"><span class="keyword">typeof</span></span><span class="org-block"> y) </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">false</span></span><span class="org-block">;
    </span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (x &amp;&amp; y &amp;&amp; </span><span class="org-block"><span class="keyword">typeof</span></span><span class="org-block"> x != </span><span class="org-block"><span class="string">'object'</span></span><span class="org-block">) </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> x === y; </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Values
</span></span><span class="org-block">    </span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">props</span></span><span class="org-block"> = Object.keys(x).concat(Object.keys(y));
    </span><span class="org-block"><span class="keyword">for</span></span><span class="org-block"> (</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">p</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">of</span></span><span class="org-block"> props) </span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (! deepEqual(x[p], y[p])) </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">false</span></span><span class="org-block">;
    </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">true</span></span><span class="org-block">;
  }

  </span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">obj</span></span><span class="org-block"> = {here: {is: </span><span class="org-block"><span class="string">"an"</span></span><span class="org-block">}, object: 2};
  console.log(deepEqual(obj, {here: 1, object: 2})); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; false
</span></span><span class="org-block">  console.log(deepEqual(obj, {here: {is: </span><span class="org-block"><span class="string">"an"</span></span><span class="org-block">}, object: 2})); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; true
</span></span><span class="org-block">  console.log(deepEqual(1, 0 + 1)); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; true
</span></span><span class="org-block-end-line">#+END_SRC
</span>
Because of a historical accident, <span class="org-code">typeof null</span> produces <span class="org-code">"object"</span>.
<span class="org-level-1">* Arithmetic</span>

In addition to the standard arithmetic operations, we have <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports
