posts/java-cheat-sheet.org
* Arithmetic

In addition to the standard arithmetic operations, we have src_java[:exports
code]{Math.max(x, y)} that takes two numbers and gives the largest; likewise
src_java[:exports code]{Math.min(x, y)}.  Other common functions include
src_java[:exports code]{Math.sqrt, Math.ceil, Math.round, Math.abs,} and
src_java[:exports code]{Math.random()} which returns a random number between 0
and 1.  Also, use ~%~ for remainder after division; e.g., =n % 10= is the right-most
digit of integer $n$, and src_java[:exports code]{n % 2 == 0} exactly when $n$ is
even, and =d % 1= gives the decimal points of a floating point number $d$, and
finally: If ~d~ is the index of the current weekday (0..6), then ~d + 13 % 7~ is the
weekday 13-days from today.
# In general, modulus is useful when working with a value that resets after a certain limit

#+begin_parallel :bar t
#+latex: \begingroup\scriptsize
#+begin_src java
// Scientific notation: 𝓍e𝓎 ≈ 𝓍 × 10ʸ
assert 1.2e3 == 1.2 * Math.pow(10, 3)
#+end_src

#+begin_src java
// random integer x with 4 ≤ x < 99
var x = new Random().nextInt(4, 99);
#+end_src
#+latex:\endgroup
#+end_parallel

#+begin_box "Sum the digits of the integer $n = 31485$"
#+begin_src java
int n = 31485;
int sum = 0;
while (n % 10 != 0) { sum += n % 10; n /= 10; }
assert sum == 3 + 1 + 4 + 8 + 5;
#+end_src

--------------------------------------------------------------------------------
#+latex: \vspace{1em}
A more elegant, “functional style”, solution:
#+latex: \vspace{.3em}
#+begin_src java
String.valueOf(n).chars().map(c -> c - '0').sum();
#+end_src


# Neato.
# // Random number in range min..max
# Math.floor(Math.random() * (max - min) + min)

#+latex: \vspace{1em}
The =chars()= methods returns a stream of integers (Java
src_java[:exports code]{char}acters are really just integers).
Likewise, src_java[:exports code]{IntStream.range(0, 20)} makes a
sequence of numbers that we can then ~map~ over, then ~sum, min, max, average~.
#+end_box

:Ordering_on_chars:
#+begin_src java
// Upper case letters come first, then lower case ones.
assert 'Z' < 'a' && 'a' < 'z';
#+end_src
:End:

