java-cheat-sheet.org.html
code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Math.max(x, y)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> that takes two numbers and gives the largest; likewise
<span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Math.min(x, y)</span><span class="shadow"><span class="org-inline-src-block">}</span></span>.  Other common functions include
<span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Math.sqrt, Math.ceil, Math.round, Math.abs,</span><span class="shadow"><span class="org-inline-src-block">}</span></span> and
<span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Math.random()</span><span class="shadow"><span class="org-inline-src-block">}</span></span> which returns a random number between 0
and 1.  Also, use <span class="org-code">%</span> for remainder after division; e.g., <span class="org-verbatim">n % 10</span> is the right-most
digit of integer<span class="org-latex-and-related"> $n$,</span> and <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">n % 2 = 0</span><span class="shadow"><span class="org-inline-src-block">}</span></span><span class="org-verbatim"> exactly when $n$ is
even, and </span><span class="org-verbatim"><span class="org-verbatim">d % 1</span></span> gives the decimal points of a floating point number<span class="org-latex-and-related"> $d$,</span> and
finally: If <span class="org-code">d</span> is the index of the current weekday (0..6), then <span class="org-code">d + 13 % 7</span> is the
weekday 13-days from today.
<span class="comment"># In general, modulus is useful when working with a value that resets after a certain limit</span>

<span class="org-block-begin-line">#+begin_parallel :bar t
</span><span class="org-block">#+latex: \begingroup\scriptsize
#+begin_src java
// Scientific notation: &#120013;e&#120014; &#8776; &#120013; &#215; 10&#696;
assert 1.2e3 == 1.2 * Math.pow(10, 3)
#+end_src

#+begin_src java
// random integer x with 4 &#8804; x &lt; 99
var x = new Random().nextInt(4, 99);
#+end_src
#+latex:\endgroup
</span><span class="org-block-end-line">#+end_parallel
</span>
<span class="org-block-begin-line">#+begin_box "Sum the digits of the integer $n = 31485$"
</span><span class="org-block">#+begin_src java
int n = 31485;
int sum = 0;
while (n % 10 != 0) { sum += n % 10; n /= 10; }
assert sum == 3 + 1 + 4 + 8 + 5;
#+end_src

--------------------------------------------------------------------------------
#+latex: \vspace{1em}
A more elegant, &#8220;functional style&#8221;, solution:
#+latex: \vspace{.3em}
#+begin_src java
String.valueOf(n).chars().map(c -&gt; c - '0').sum();
#+end_src


# Neato.
# // Random number in range min..max
# Math.floor(Math.random() * (max - min) + min)

#+latex: \vspace{1em}
The chars() methods returns a stream of integers (Java
</span><span class="org-inline-src-block"><span class="shadow"><span class="org-block">src_</span></span></span><span class="org-inline-src-block"><span class="org-meta-line"><span class="org-block">java</span></span></span><span class="org-inline-src-block"><span class="org-block">[:exports code]</span></span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">char</span><span class="shadow"><span class="org-inline-src-block">}</span></span><span class="org-block">acters are really just integers).
Likewise, </span><span class="org-inline-src-block"><span class="shadow"><span class="org-block">src_</span></span></span><span class="org-inline-src-block"><span class="org-meta-line"><span class="org-block">java</span></span></span><span class="org-inline-src-block"><span class="org-block">[:exports code]</span></span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">IntStream.range(0, 20)</span><span class="shadow"><span class="org-inline-src-block">}</span></span><span class="org-block"> makes a
sequence of numbers that we can then map over, then sum, min, max, average.
</span><span class="org-block-end-line">#+end_box
</span>
<span class="org-drawer">:Ordering_on_chars:</span>
<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Upper case letters come first, then lower case ones.
</span></span><span class="org-block">assert </span><span class="org-block"><span class="string">'Z'</span></span><span class="org-block"> &lt; </span><span class="org-block"><span class="string">'a'</span></span><span class="org-block"> &amp;&amp; </span><span class="org-block"><span class="string">'a'</span></span><span class="org-block"> &lt; </span><span class="org-block"><span class="string">'z'</span></span><span class="org-block">;
</span><span class="org-block-end-line">#+end_src
</span><span class="org-drawer">:End:</span>
