posts/java-cheat-sheet.org
* Collections and Streams

/Collections/ are types that hold a bunch of similar data: Lists,
Sets, and Maps are the most popular. /Streams/ are pipelines for
altering collections: Usually one has a collection, converts it to a
stream by invoking ~.stream()~, then performs ~map~ and ~filter~
methods, etc, then “collects” (i.e., runs the stream pipeline to get
an actual collection value back) the result.
# ⟦Streams exist because
# Java lacks a proper extension mechanism, such as C#'s /extension
# methods/ or Haskell's /typeclasses/ or JavaScript's /prototypes/.⟧

#+html: <hr>

*Lists are ordered collections, that care about multiplicity*.  Lists
are made with ~List.of(x₀, x₁, …, xₙ)~.  Indexing, ~xs.get(𝒾)~, yields
the 𝒾-th element from the start; i.e., the number of items to skip;
whence ~xs.get(0)~ is the first element.

*Sets are unordered collections, that ignore multiplicity*. Sets are
made with ~Set.of(x₀, x₁, …, xₙ)~.

*Maps are pairs of ‘keys’ along with ‘values’.* ~Map<K, V>~ is
essentially the class of objects that have no methods but instead have
an arbitary number of properties (the ‘keys’ of type =K=), where each
property has a value of type =V=.  Maps are made with ~Map.of(k₀, v₀,
…, k₁₀, v₁₀)~ by explicitly declaraing keys and their associated
values.  The method ~ℳ.get(k)~ returns the value to which the
specified key =k= is mapped, or =null= if the map ℳ contains no
mapping for the key. Maps have an ~entrySet()~ method that gives a set
of key-value pairs, which can then be converted to a stream, if need
be.

#+html: <hr>

Other collection methods include, for a collection instance 𝒞:
+ src_java[:exports code]{𝒞.size()} is the number of elements in the collection
+ src_java[:exports code]{𝒞.isEmpty()}  ≡  src_java[:exports code]{𝒞.size() == 0}
+ src_java[:exports code]{𝒞.contains(e)}  ≡  src_java[:exports code]{𝒞.stream().filter(x -> x.equals(e)).count() > 0}
+ src_java[:exports code]{Collections.fill(ℒ, e)}  ≅  src_java[:exports code]{ℒ.stream().map(_ -> e).toList()};
  i.e., copy list ~ℒ~ but replace all elements with ~e~.
+ src_java[:exports code]{Collections.frequency(𝒞, e)}
  counts how many times ~e~ occurs in a collection.
  # ~Collections.frequency(𝒞, e)  ≅  𝒞.stream().filter(x -> x.equals(e)).count()~;
+ src_java[:exports code]{Collections.max(𝒞)} is the largest value in a collection; likewise ~min~.
+ src_java[:exports code]{Collections.nCopies(n, e)} is a list of $n$ copies of ~e~.

#+html: <hr>

*src_java[:exports code]{Stream<τ>} methods*
+ src_java[:exports code]{Stream.of(x₀, ..., xₙ)} makes a stream of data, of type τ, ready to be acted on.
+ src_java[:exports code]{s.map(f)} changes the elements according to a function $f : τ → τ′$.
  - src_java[:exports code]{s.flatMap(f)} transforms each element into a stream since $f : τ → Stream<τ′>$, then the resulting
    stream-of-streams is flattened into a single sequential stream.
  - As such, to merge a streams of streams just invoke ~.flatMap(s -> s)~.
+ src_java[:exports code]{s.filter(p)} keeps only the elements that satisfy property ~p~
+ src_java[:exports code]{s.count()} is the number of elements in the stream
+ src_java[:exports code]{s.allMatch(p)} tests if all elements  satisfy the [[https://download.java.net/java/early_access/panama/docs/api/java.base/java/util/function/Predicate.html][predicate]] ~p~
+ src_java[:exports code]{s.anyMatch(p)} tests if any element satisfies ~p~
+ src_java[:exports code]{s.noneMatch(p)}  ≡  src_java[:exports code]{s.allMatch(p.negate())}
+ src_java[:exports code]{s.distinct()} drops all duplicates
+ src_java[:exports code]{s.findFirst()} returns an src_java[:exports code]{Optional<τ>} denoting the first element, if any.
+ src_java[:exports code]{s.forEach(a)} to loop over the elements and perform action ~a~.
  - If you want to do some action, and get the stream ~s~ back for further use,
    then use src_java[:exports code]{s.peek(a)}.

# Higher-order functions start to shine when you need to compose operations.

