java-cheat-sheet.org.html

<span class="org-level-1">* Collections and Streams</span>

<span class="italic">Collections</span> are types that hold a bunch of similar data: Lists,
Sets, and Maps are the most popular. <span class="italic">Streams</span> are pipelines for
altering collections: Usually one has a collection, converts it to a
stream by invoking <span class="org-code">.stream()</span>, then performs <span class="org-code">map</span> and <span class="org-code">filter</span>
methods, etc, then &#8220;collects&#8221; (i.e., runs the stream pipeline to get
an actual collection value back) the result.
<span class="comment"># &#10214;Streams exist because</span>
<span class="comment"># Java lacks a proper extension mechanism, such as C#'s /extension</span>
<span class="comment"># methods/ or Haskell's /typeclasses/ or JavaScript's /prototypes/.&#10215;</span>

<span class="org-meta-line">#+html: &lt;hr&gt;</span>

<span class="bold">Lists </span><span class="bold"><span class="writegood-passive-voice">are ordered</span></span><span class="bold"> collections, that care about multiplicity</span>.  Lists
<span class="writegood-passive-voice">are made</span> with <span class="org-code">List.of(x&#8320;, x&#8321;, &#8230;, x&#8345;)</span>.  Indexing, <span class="org-code">xs.get(&#119998;)</span>, yields
the &#119998;-th element from the start; i.e., the number of items to skip;
whence <span class="org-code">xs.get(0)</span> is the first element.

<span class="bold">Sets </span><span class="bold"><span class="writegood-passive-voice">are unordered</span></span><span class="bold"> collections, that ignore multiplicity</span>. Sets <span class="writegood-passive-voice">are
made</span> with <span class="org-code">Set.of(x&#8320;, x&#8321;, &#8230;, x&#8345;)</span>.

<span class="bold">Maps are pairs of &#8216;keys&#8217; along with &#8216;values&#8217;.</span> <span class="org-code">Map&lt;K, V&gt;</span> is
essentially the class of objects that have no methods but instead have
an arbitary number of properties (the &#8216;keys&#8217; of type <span class="org-verbatim">K</span>), where each
property has a value of type <span class="org-verbatim">V</span>.  Maps <span class="writegood-passive-voice">are made</span> with <span class="org-code">Map.of(k&#8320;, v&#8320;,
&#8230;, k&#8321;&#8320;, v&#8321;&#8320;)</span> by explicitly declaraing keys and their associated
values.  The method <span class="org-code">&#8499;.get(k)</span> returns the value to which the
specified key <span class="org-verbatim">k</span> <span class="writegood-passive-voice">is mapped</span>, or <span class="org-verbatim">null</span> if the map &#8499; contains no
mapping for the key. Maps have an <span class="org-code">entrySet()</span> method that gives a set
of key-value pairs, which can then <span class="writegood-passive-voice">be converted</span> to a stream, if need
be.

<span class="org-meta-line">#+html: &lt;hr&gt;</span>

Other collection methods include, for a collection instance &#119966;:
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">&#119966;.size()</span><span class="shadow"><span class="org-inline-src-block">}</span></span> is the number of elements in the collection
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">&#119966;.isEmpty()</span><span class="shadow"><span class="org-inline-src-block">}</span></span> &#160;&#8801;&#160; <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">&#119966;.size() == 0</span><span class="shadow"><span class="org-inline-src-block">}</span></span>
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">&#119966;.contains(e)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> &#160;&#8801;&#160; <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">&#119966;.stream().filter(x -&gt; x.equals(e)).count() &gt; 0</span><span class="shadow"><span class="org-inline-src-block">}</span></span>
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Collections.fill(&#8466;, e)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> &#160;&#8773;&#160; <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">&#8466;.stream().map(_ -&gt; e).toList()</span><span class="shadow"><span class="org-inline-src-block">}</span></span>;
  i.e., copy list <span class="org-code">&#8466;</span> but replace all elements with <span class="org-code">e</span>.
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Collections.frequency(&#119966;, e)</span><span class="shadow"><span class="org-inline-src-block">}</span></span>
  counts how <span class="writegood-weasels">many</span> times <span class="org-code">e</span> occurs in a collection.
<span class="comment">  # ~Collections.frequency(&#119966;, e) &#160;&#8773;&#160; &#119966;.stream().filter(x -&gt; x.equals(e)).count()~;</span>
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Collections.max(&#119966;)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> is the largest value in a collection; likewise <span class="org-code">min</span>.
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Collections.nCopies(n, e)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> is a list of<span class="org-latex-and-related"> $n$ </span>copies of <span class="org-code">e</span>.

<span class="org-meta-line">#+html: &lt;hr&gt;</span>

<span class="bold">src_java[:exports code]{Stream&lt;&#964;&gt;} methods</span>
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Stream.of(x&#8320;, ..., x&#8345;)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> makes a stream of data, of type &#964;, ready to <span class="writegood-passive-voice">be acted</span> on.
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">s.map(f)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> changes the elements according to a function<span class="org-latex-and-related"> $f : &#964; &#8594; &#964;&#8242;$.</span>
  - <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">s.flatMap(f)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> transforms each element into a stream since<span class="org-latex-and-related"> $f : &#964; &#8594; Stream&lt;&#964;&#8242;&gt;$,</span> then the resulting
    stream-of-streams <span class="writegood-passive-voice">is flattened</span> into a single sequential stream.
  - As such, to merge a streams of streams just invoke <span class="org-code">.flatMap(s -&gt; s)</span>.
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">s.filter(p)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> keeps only the elements that satisfy property <span class="org-code">p</span>
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">s.count()</span><span class="shadow"><span class="org-inline-src-block">}</span></span> is the number of elements in the stream
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">s.allMatch(p)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> tests if all elements  satisfy the <span class="org-link"><a href="https://download.java.net/java/early_access/panama/docs/api/java.base/java/util/function/Predicate.html">predicate</a></span> <span class="org-code">p</span>
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">s.anyMatch(p)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> tests if any element satisfies <span class="org-code">p</span>
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">s.noneMatch(p)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> &#160;&#8801;&#160; <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">s.allMatch(p.negate())</span><span class="shadow"><span class="org-inline-src-block">}</span></span>
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">s.distinct()</span><span class="shadow"><span class="org-inline-src-block">}</span></span> drops all duplicates
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">s.findFirst()</span><span class="shadow"><span class="org-inline-src-block">}</span></span> returns an <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">Optional&lt;&#964;&gt;</span><span class="shadow"><span class="org-inline-src-block">}</span></span> denoting the first element, if any.
+ <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">s.forEach(a)</span><span class="shadow"><span class="org-inline-src-block">}</span></span> to loop over the elements and perform action <span class="org-code">a</span>.
  - If you want to do <span class="writegood-weasels">some</span> action, and get the stream <span class="org-code">s</span> back for further use,
    then use <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">s.peek(a)</span><span class="shadow"><span class="org-inline-src-block">}</span></span>.

<span class="comment"># Higher-order functions start to shine when you need to compose operations.</span>
