posts/java-cheat-sheet.org
** TODO COMMENT Dictionries or maps

   An object can also be used as a /“key:value”/ dictionary: When we ‘look-up’ a key,
   we find a particular value. E.g., with ~ages = {mark: 12, james: 23, larry: 42}~
   we use ~ages.mark~ to find Mark's age.

   Similarly, objects can be used to simulate /keyword arguments/ in function calls.

* DONE COMMENT Streams are just a lazy, declarative, (mostly side-effect-free), abstraction of design patterns manually implemented with procedural for-loops and ~if~'s

When someone sees the stream ~.map~ method, it's clear that we are
using the obvious explicit design pattern for transforming elements of
a data source.  In contrast, using a ~for~ loop means that the entire
data source will be processed even if it's not all needed, and /there
may be/ stateful mutation within the loop body.

--------------------------------------------------------------------------------

/Collections/ are data, and /Streams/ are how we operate on them at a high-level
rather ---than resorting to ~for~ loops and ~if~'s.

Collections are just containers of objects. There are a bunch of them with slightly different API's, depending on what you need. There is List, Set, Map, ...

Streams are for data transformation and processing. That's what the API is designed for. You can map, filter, reduce, ...

--------------------------------------------------------------------------------0

Streams are for incrementally processing some data source (could be a
collection, or it could be generated on the fly as you process it) and
either doing something on the result, or transforming it to some other
representation.

Think of it like a pipeline of operations being performed on some data
being fed in.

Stuff is accessed in a stream lazily (so only when you demand each
item), unless you use a terminal operation like .toList, .collect,
.reduce, .forEach, .distinct, .count, .iterator, etc. In the latter
case, the entire stream contents will usually get retrieved eagerly
and buffered before the next operation is run. The side effect of this
is that unless your stream contains/ends with a terminal operation,
nothing will be executed.

Streams are designed to let you focus on "what is being done" rather
than "how it is being done" (declarative rather than
imperitive). Doing this lets you write code in a functional style
which ideally reads more closely to how you would explain it as a
human.

--------------------------------------------------------------------------------

Stuff is accessed in a stream lazily (so only when you demand each
item), unless you use a terminal operation like .toList, .collect,
.reduce, .forEach, .distinct, .count, .iterator, etc. In the latter
case, the entire stream contents will usually get retrieved eagerly
and buffered before the next operation is run. The side effect of this
is that unless your stream contains/ends with a terminal operation,
nothing will be executed.

This means that streams can be infinite; e.g., see .generate or .iterate.
Since they are lazy (ie fancy “short circuiting”).
/And can only be consumed once./
+ So a method with an argument typed /Stream/ communicates more information
  about how the argument is used: Namely, that the argument is used only once!
  - C.f., “linear methods” and “linear logic and programming”.
  - This use-once constraint is because a stream's data values need not exist
    before they are accessed, nor be stored anywhere afterwards. The canonical
    example here is a stream of random integers where each is generated upon access.
    Such a stream cannot be reused unless we explicitly save the values somewhere.

