java-cheat-sheet.org.html

<span class="org-hide">*</span><span class="org-level-2">* </span><span class="org-level-2"><span class="org-todo"><span class="hl-todo"><span class="custom-1">TODO</span></span></span></span><span class="org-level-2"> </span><span class="org-special-keyword">COMMENT</span><span class="org-level-2"> Dictionries or maps</span>

   An object can also <span class="writegood-passive-voice">be used</span> as a <span class="italic">&#8220;key:value&#8221;</span> dictionary: When we &#8216;look-up&#8217; a key,
   we find a particular value. E.g., with <span class="org-code">ages = {mark: 12, james: 23, larry: 42}</span>
   we use <span class="org-code">ages.mark</span> to find Mark's age.

   Similarly, objects can <span class="writegood-passive-voice">be used</span> to simulate <span class="italic">keyword arguments</span> in function calls.

<span class="org-level-1">* </span><span class="org-level-1"><span class="org-done"><span class="hl-todo"><span class="custom">DONE</span></span></span></span><span class="org-level-1"> </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"><span class="org-headline-done"> Streams are just a lazy, declarative, (</span></span><span class="org-level-1"><span class="org-headline-done"><span class="writegood-weasels">mostly</span></span></span><span class="org-level-1"><span class="org-headline-done"> side-effect-free), abstraction of design patterns manually implemented with procedural for-loops and </span></span><span class="org-level-1"><span class="org-headline-done"><span class="org-code">if</span></span></span><span class="org-level-1"><span class="org-headline-done">'s</span></span>

When someone sees the stream <span class="org-code">.map</span> method, it's clear that we are
using the obvious explicit design pattern for transforming elements of
a data source.  In contrast, using a <span class="org-code">for</span> loop means that the entire
data source will <span class="writegood-passive-voice">be processed</span> even if it's not all needed, and <span class="italic">there
may be</span> stateful mutation within the loop body.

--------------------------------------------------------------------------------

<span class="italic">Collections</span> are data, and <span class="italic">Streams</span> are how we operate on them at a high-level
rather ---than resorting to <span class="org-code">for</span> loops and <span class="org-code">if</span>'s.

Collections are just containers of objects. There are a bunch of them with slightly different API's, depending on what you need. There is List, Set, Map, ...

Streams are for data transformation and processing. That's what the API <span class="writegood-passive-voice">is designed</span> for. You can map, filter, reduce, ...

--------------------------------------------------------------------------------0

Streams are for incrementally processing <span class="writegood-weasels">some</span> data source (could be a
collection, or it could <span class="writegood-passive-voice">be generated</span> on the fly as you process it) and
either doing something on the result, or transforming it to <span class="writegood-weasels">some</span> other
representation.

Think of it like a pipeline of operations <span class="writegood-passive-voice">being performed</span> on <span class="writegood-weasels">some</span> data
<span class="writegood-passive-voice">being fed</span> in.

Stuff <span class="writegood-passive-voice">is accessed</span> in a stream lazily (so only when you demand each
item), unless you use a terminal operation like .toList, .collect,
.reduce, .forEach, .distinct, .count, .iterator, etc. In the latter
case, the entire stream contents will usually get retrieved eagerly
and buffered before the next operation <span class="writegood-passive-voice">is run</span>. The side effect of this
is that unless your stream contains/ends with a terminal operation,
nothing will <span class="writegood-passive-voice">be executed</span>.

Streams <span class="writegood-passive-voice">are designed</span> to let you focus on "what is <span class="writegood-passive-voice">being done</span>" rather
than "how it is <span class="writegood-passive-voice">being done</span>" (declarative rather than
imperitive). Doing this lets you write code in a functional style
which ideally reads more closely to how you would explain it as a
human.

--------------------------------------------------------------------------------

Stuff <span class="writegood-passive-voice">is accessed</span> in a stream lazily (so only when you demand each
item), unless you use a terminal operation like .toList, .collect,
.reduce, .forEach, .distinct, .count, .iterator, etc. In the latter
case, the entire stream contents will usually get retrieved eagerly
and buffered before the next operation <span class="writegood-passive-voice">is run</span>. The side effect of this
is that unless your stream contains/ends with a terminal operation,
nothing will <span class="writegood-passive-voice">be executed</span>.

This means that streams can be infinite; e.g., see .generate or .iterate.
Since they are lazy (ie fancy &#8220;short circuiting&#8221;).
<span class="italic">And can only </span><span class="italic"><span class="writegood-passive-voice">be consumed</span></span><span class="italic"> once.</span>
+ So a method with an argument typed <span class="italic">Stream</span> communicates more information
  about how the argument <span class="writegood-passive-voice">is used</span>: Namely, that the argument <span class="writegood-passive-voice">is used</span> only once!
  - C.f., &#8220;linear methods&#8221; and &#8220;linear logic and programming&#8221;.
  - This use-once constraint is because a stream's data values need not exist
    before they <span class="writegood-passive-voice">are accessed</span>, nor <span class="writegood-passive-voice">be stored</span> anywhere afterwards. The canonical
    example here is a stream of random integers where each <span class="writegood-passive-voice">is generated</span> upon access.
    Such a stream cannot <span class="writegood-passive-voice">be reused</span> unless we explicitly save the values somewhere.

<span class="org-level-1">* Generics</span>
