posts/java-cheat-sheet.org
* Generics

Java only lets us return a single value from a method, what if we want
to return a pair of values? Easy, let's declare ~record Pair(Object
first, Object second) { }~ and then return ~Pair~. This solution has
the same problem as methods that just return ~Object~: It communicates
essentially no information ---after all, /everything is an object!/---
and so requires dangerous casts to be useful, and the compiler wont
help me avoid type mistakes.
#+begin_src java
record Pair(Object first, Object second) { }

// This should return an integer and a string
Pair myMethod() { return new Pair("1", "hello"); } // Oops, I made a typo!

int num = (int) (myMethod().first()); // BOOM!
#+end_src

It would be better if we could say “this method returns a pair of an integer and a string”, for example.
We can do just that with /generics/!
#+begin_src java
record Pair<A, B>(A first, B second) { }

Pair<Integer, String> myMethod() { return new Pair<>(1, "hello"); }

int num = myMethod().first();
#+end_src
This approach /communicates to the compiler my intentions/ and so the compiler ensures I don't make any silly typos.
Such good communication also means no dangerous casts are required.

We can use the new type in three ways:
| ~Pair<A, B>~ | explicitly providing the types we want to use ~Pair~ with          |
| ~Pair<>~     | letting Java /infer, guess,/ the types for ~Pair~ by how we use it |
| ~Pair~       | defaulting the types to all be ~Object~                            |

The final option is not recommended, since it looses type information. It's only allowed
since older versions of Java do not have type parameters and so, at run time, all type
parameters are ‘erased’. That is, /type parameters only exist at compile time and so cannot
be inspected/observed at run-time./

* COMMENT Methods

#+latex: {\color{white}.}\vspace{-1em}
+ /Warning!/ Arguments are evaluated *before* the function is executed.

+ /Method/ definition:
  #+BEGIN_SRC java
τ f(τ₁ x₁, …, τₙ xₙ) {
    ⋮
    return e;
    }
  #+END_SRC

In your home, furniture /must/ be in some room.
  Likewise, in Java, methods /must/ be part of some
  src_java[:exports code]{class},
  src_java[:exports code]{record}, or
  src_java[:exports code]{interface}.
  - A src_java[:exports code]{class} is a /type/ consisting of some state and some methods.
  - A src_java[:exports code]{record} is a "value class": It is like a class, but it has no private hidden state
    and cannot be changed. It's like a number: /What you see is what you get!/
    (It's essentially a fancy tuple, pair, or heterogenous-array. More on this later!)
  - An src_java[:exports code]{interface} is a collection of method /signatures/: It is a bunch of method names,
    that can be implemented by a =class= or a =record=. It may also have src_java[:exports code]{default} definitions
    of methods. It is an abstraction with /no/ state.

