java-cheat-sheet.org.html

Java only lets us return a single value from a method, what if we want
to return a pair of values? <span class="writegood-weasels">Easy</span>, let's declare <span class="org-code">record Pair(Object
first, Object second) { }</span> and then return <span class="org-code">Pair</span>. This solution has
the same problem as methods that just return <span class="org-code">Object</span>: It communicates
essentially no information ---after all, <span class="italic">everything is an object!</span>---
and so requires dangerous casts to be useful, and the compiler wont
help me avoid type mistakes.
<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="type">record</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">Pair</span></span><span class="org-block">(</span><span class="org-block"><span class="type">Object</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">first</span></span><span class="org-block">, </span><span class="org-block"><span class="type">Object</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">second</span></span><span class="org-block">) { }

</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">This should return an integer and a string
</span></span><span class="org-block"><span class="type">Pair</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">myMethod</span></span><span class="org-block">() { </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Pair</span></span><span class="org-block">(</span><span class="org-block"><span class="string">"1"</span></span><span class="org-block">, </span><span class="org-block"><span class="string">"hello"</span></span><span class="org-block">); } </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Oops, I made a typo!
</span></span><span class="org-block">
</span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">num</span></span><span class="org-block"> = (</span><span class="org-block"><span class="type">int</span></span><span class="org-block">) (myMethod().first()); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">BOOM!
</span></span><span class="org-block-end-line">#+end_src
</span>
It would be better if we could say &#8220;this method returns a pair of an integer and a string&#8221;, for example.
We can do just that with <span class="italic">generics</span>!
<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="type">record</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">Pair&lt;</span></span><span class="org-block"><span class="type">A</span></span><span class="org-block"><span class="function-name">, </span></span><span class="org-block"><span class="type">B</span></span><span class="org-block"><span class="function-name">&gt;</span></span><span class="org-block">(</span><span class="org-block"><span class="type">A</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">first</span></span><span class="org-block">, </span><span class="org-block"><span class="type">B</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">second</span></span><span class="org-block">) { }

</span><span class="org-block"><span class="type">Pair</span></span><span class="org-block">&lt;</span><span class="org-block"><span class="type">Integer</span></span><span class="org-block">, </span><span class="org-block"><span class="type">String</span></span><span class="org-block">&gt; </span><span class="org-block"><span class="function-name">myMethod</span></span><span class="org-block">() { </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Pair</span></span><span class="org-block">&lt;&gt;(1, </span><span class="org-block"><span class="string">"hello"</span></span><span class="org-block">); }

</span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">num</span></span><span class="org-block"> = myMethod().first();
</span><span class="org-block-end-line">#+end_src
</span>This approach <span class="italic">communicates to the compiler my intentions</span> and so the compiler ensures I don't make any silly typos.
Such good communication also means no dangerous casts <span class="writegood-passive-voice">are required</span>.

We can use the new type in three ways:
<span class="org-table">| </span><span class="org-table"><span class="org-code">Pair&lt;A, B&gt;</span></span><span class="org-table"> | explicitly providing the types we want to use </span><span class="org-table"><span class="org-code">Pair</span></span><span class="org-table"> with          |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-code">Pair&lt;&gt;</span></span><span class="org-table">     | letting Java </span><span class="org-table"><span class="italic">infer, guess,</span></span><span class="org-table"> the types for </span><span class="org-table"><span class="org-code">Pair</span></span><span class="org-table"> by how we use it |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-code">Pair</span></span><span class="org-table">       | defaulting the types to all be </span><span class="org-table"><span class="org-code">Object</span></span><span class="org-table">                            |</span>

The final option is not recommended, since it looses type information. It's only allowed
since older versions of Java do not have type parameters and so, at run time, all type
parameters are &#8216;erased&#8217;. That is, <span class="italic">type parameters only exist at compile time and so cannot
</span><span class="italic"><span class="writegood-passive-voice">be inspected</span></span><span class="italic">/observed at run-time.</span>

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Methods</span>

<span class="org-meta-line">#+latex: {\color{white}.}\vspace{-1em}</span>
+ <span class="italic">Warning!</span> Arguments <span class="writegood-passive-voice">are evaluated</span> <span class="bold">before</span> the function <span class="writegood-passive-voice">is executed</span>.

+ <span class="italic">Method</span> definition:
<span class="org-block-begin-line">  #+BEGIN_SRC java
</span><span class="org-block"><span class="type">&#964;</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">f</span></span><span class="org-block">(&#964;&#8321; x&#8321;, &#8230;, </span><span class="org-block"><span class="type">&#964;&#8345;</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">x&#8345;</span></span><span class="org-block">) {
    &#8942;
    </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> e;
    }
</span><span class="org-block-end-line">  #+END_SRC
</span>
In your home, furniture <span class="italic">must</span> be in <span class="writegood-weasels">some</span> room.
  Likewise, in Java, methods <span class="italic">must</span> be part of <span class="writegood-weasels">some</span>
  <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">class</span><span class="shadow"><span class="org-inline-src-block">}</span></span>,
  <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">record</span><span class="shadow"><span class="org-inline-src-block">}</span></span>, or
  <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">interface</span><span class="shadow"><span class="org-inline-src-block">}</span></span>.
  - A <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">class</span><span class="shadow"><span class="org-inline-src-block">}</span></span> is a <span class="italic">type</span> consisting of <span class="writegood-weasels">some</span> state and <span class="writegood-weasels">some</span> methods.
  - A <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">record</span><span class="shadow"><span class="org-inline-src-block">}</span></span> is a "value class": It is like a class, but it has no private hidden state
    and cannot <span class="writegood-passive-voice">be changed</span>. It's like a number: <span class="italic">What you see is what you get!</span>
    (It's essentially a fancy tuple, pair, or heterogenous-array. More on this later!)
  - An <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">interface</span><span class="shadow"><span class="org-inline-src-block">}</span></span> is a collection of method <span class="italic">signatures</span>: It is a bunch of method names,
    that can <span class="writegood-passive-voice">be implemented</span> by a <span class="org-verbatim">class</span> or a <span class="org-verbatim">record</span>. It may also have <span class="org-inline-src-block"><span class="shadow">src_</span></span><span class="org-inline-src-block"><span class="org-meta-line">java</span></span><span class="org-inline-src-block">[:exports code]</span><span class="shadow"><span class="org-inline-src-block">{</span></span><span class="org-block">default</span><span class="shadow"><span class="org-inline-src-block">}</span></span> definitions
    of methods. It is an abstraction with <span class="italic">no</span> state.
