java-cheat-sheet.org.html

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> The </span><span class="org-level-1"><span class="org-code">this</span></span><span class="org-level-1"> Keyword</span>

<span class="org-drawer">:Hide:</span>
Methods are nothing more than properties that hold function values. This is a
<span class="writegood-weasels">simple</span> method:

<span class="org-block-begin-line">#+BEGIN_SRC js
</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">rabbit</span></span><span class="org-block"> = {};
rabbit.speak = </span><span class="org-block"><span class="keyword">function</span></span><span class="org-block">(</span><span class="org-block"><span class="variable-name">line</span></span><span class="org-block">) {
  console.log(</span><span class="org-block"><span class="string">`The rabbit says '${line}'`</span></span><span class="org-block">);
};

rabbit.speak(</span><span class="org-block"><span class="string">"I'm alive."</span></span><span class="org-block">); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; The rabbit says 'I'm alive.'
</span></span><span class="org-block-end-line">#+END_SRC
</span><span class="org-drawer">:End:</span>

Usually a method needs to do something with the object it <span class="writegood-passive-voice">was called</span> on. When a
function <span class="writegood-passive-voice">is called</span> as a method --- looked up as a property and immediately
called, as in <span class="org-code">object.method()</span> &#8212;-- the binding called <span class="org-code">this</span> in its body
automatically points at the object that it <span class="writegood-passive-voice">was called</span> on.

<span class="org-block-begin-line">#+BEGIN_SRC js
</span><span class="org-block"><span class="keyword">function</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">speak</span></span><span class="org-block">(</span><span class="org-block"><span class="variable-name">line</span></span><span class="org-block">) {
  console.log(</span><span class="org-block"><span class="string">`The ${this.type} rabbit says '${line}'`</span></span><span class="org-block">);
}
</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">whiteRabbit</span></span><span class="org-block">  = {type: </span><span class="org-block"><span class="string">"white"</span></span><span class="org-block">, speak};
</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">hungryRabbit</span></span><span class="org-block"> = {type: </span><span class="org-block"><span class="string">"hungry"</span></span><span class="org-block">, speak};

whiteRabbit.speak(</span><span class="org-block"><span class="string">"Hola!"</span></span><span class="org-block">); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; The white rabbit says 'Hola!'
</span></span><span class="org-block">hungryRabbit.speak(</span><span class="org-block"><span class="string">"Hey!"</span></span><span class="org-block">)  </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; The hungry rabbit says 'Hey!'
</span></span><span class="org-block-end-line">#+END_SRC
</span>
<span class="org-hide">*</span><span class="org-level-2">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-2"> </span><span class="org-level-2"><span class="org-verbatim">THIS</span></span><span class="org-level-2"> keyword</span>

The keyword <span class="org-code">this</span> is useful when your code needs to refer to the instance of the object, where this code is running.


Notice that the <span class="org-code">this</span> keyword allows us to refer to other parts of
<span class="italic">this</span> object literal.
<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Object-Oriented Programming / Inheritance</span>

<span class="org-hide">*</span><span class="org-level-2">* Intro </span><span class="org-level-2"><span class="org-tag">:myIgnore:</span></span>

In English, <span class="italic">prototype</span> means a preliminary model of something from which
other forms <span class="writegood-passive-voice">are developed</span> or <span class="italic">copied</span>. As such, a <span class="italic">prototypical</span> object
is an object denoting the original or typical form of something.

In addition to their properties, JavaScript objects also have prototype ---i.e.,
another object that <span class="writegood-passive-voice">is used</span> as a source of additional properties. When an object
gets a request for a property that it does not have, its prototype will <span class="writegood-passive-voice">be
searched</span> for the property, then the prototype&#8217;s prototype, and so on.
<span class="comment"># the way JavaScript objects work. In addition to their set of properties, most</span>
<span class="comment"># objects also have a prototype. A prototype is another object that </span><span class="comment"><span class="writegood-passive-voice">is used</span></span><span class="comment"> as a</span>
<span class="comment"># fallback source of properties. When an object gets a request for a property that</span>
<span class="comment"># it does not have, its prototype will </span><span class="comment"><span class="writegood-passive-voice">be searched</span></span><span class="comment"> for the property, then the</span>
<span class="comment"># prototype&#8217;s prototype, and so on.</span>

+ <span class="org-code">Object.getPrototypeOf(x)</span> returns the prototype of an object <span class="org-code">x</span>.

For example, arrays <span class="writegood-passive-voice">are derived</span> from <span class="org-code">Array.prototype</span> which <span class="writegood-passive-voice">is derived</span> from
<span class="org-code">Object.prototype</span> ---which is the great ancestral prototype, the entity behind
almost all object. <span class="org-code">Object.prototype</span> provides a <span class="writegood-weasels">few</span> methods that show up in all
objects, such as <span class="org-code">toString</span>, which converts an object to a string representation.

<span class="comment"># What Properties Does a (prototype) Object have?</span>
+ We can use the <span class="org-code">Object.getOwnPropertyNames(x)</span> to get all the property names
  linked to object <span class="org-code">x</span>.

It is occasionally useful to know whether an object <span class="writegood-passive-voice">was derived</span> from a specific
class. For this, JavaScript provides a binary operator called <span class="org-code">instanceof</span>.
Almost every object is an instance of Object.

+ <span class="org-code">&#120013; instanceof &#120014;  &#8776;  Object.getPrototypeOf(&#120013;) == &#120014;.prototype</span>

<span class="org-block-begin-line">#+BEGIN_SRC js
</span><span class="org-block"> </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8220;Object&#8221; includes &#8220;toString&#8221;, and </span></span><span class="org-block"><span class="comment"><span class="writegood-weasels">some</span></span></span><span class="org-block"><span class="comment"> other technical utilities.
</span></span><span class="org-block"> console.log(Object.getOwnPropertyNames(Object.</span><span class="org-block"><span class="constant">prototype</span></span><span class="org-block">))

</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment"><span class="writegood-weasels">Some</span></span></span><span class="org-block"><span class="comment"> true facts
</span></span><span class="org-block">console.log( {}       </span><span class="org-block"><span class="keyword">instanceof</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Object</span></span><span class="org-block">
           , []       </span><span class="org-block"><span class="keyword">instanceof</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Array</span></span><span class="org-block">
           , Math.max </span><span class="org-block"><span class="keyword">instanceof</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Function</span></span><span class="org-block">
           , Math.max </span><span class="org-block"><span class="keyword">instanceof</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Object</span></span><span class="org-block">) </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Since Function derives from Object
</span></span><span class="org-block">
</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8220;Object&#8221; has no parent prototype.
</span></span><span class="org-block">console.log(Object.getPrototypeOf(Object.</span><span class="org-block"><span class="constant">prototype</span></span><span class="org-block">)); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; null
</span></span><span class="org-block-end-line">#+END_SRC
</span>
