java-cheat-sheet.org.html
<span class="org-hide">*</span><span class="org-level-2">* Overriding Methods</span>

<span class="comment"># +latex: \newpage</span>
 (<span class="bold">Overriding</span>)
 When you add a property to an object, whether it is present in the prototype or
 not, the property <span class="writegood-passive-voice">is added</span> to the object itself. If there was already a property
 with the same name in the prototype, this property will no longer affect the
 object, as it is now hidden behind the object&#8217;s own property.
<span class="org-meta-line">#+latex: \vspace{-0.5em}</span>
<span class="comment"># #</span>
<span class="org-block-begin-line">#+begin_parallel org
</span><span class="org-block"><span class="org-block-begin-line"> #+BEGIN_SRC js
</span></span><span class="org-block"><span class="org-block">Array.</span></span><span class="org-block"><span class="org-block"><span class="constant">prototype</span></span></span><span class="org-block"><span class="org-block">.colour = </span></span><span class="org-block"><span class="org-block"><span class="string">'purple'</span></span></span><span class="org-block"><span class="org-block">

</span></span><span class="org-block"><span class="org-block"><span class="keyword">let</span></span></span><span class="org-block"><span class="org-block"> </span></span><span class="org-block"><span class="org-block"><span class="variable-name">xs</span></span></span><span class="org-block"><span class="org-block"> = [1, 2, 3]
console.log(xs.colour) </span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">// </span></span></span><span class="org-block"><span class="org-block"><span class="comment">&#8658; purple
</span></span></span><span class="org-block"><span class="org-block-end-line">#+END_SRC
</span></span><span class="org-block"><span class="org-meta-line">#+latex: \columnbreak</span></span><span class="org-block">
</span><span class="org-block"><span class="org-block-begin-line">#+BEGIN_SRC js
</span></span><span class="org-block"><span class="org-block">xs.colour = </span></span><span class="org-block"><span class="org-block"><span class="string">'green'</span></span></span><span class="org-block"><span class="org-block">
console.log(xs.colour) </span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">// </span></span></span><span class="org-block"><span class="org-block"><span class="comment">&#8658; green
</span></span></span><span class="org-block"><span class="org-block">
console.log(Array.</span></span><span class="org-block"><span class="org-block"><span class="constant">prototype</span></span></span><span class="org-block"><span class="org-block">.colour)
</span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">// </span></span></span><span class="org-block"><span class="org-block"><span class="comment">&#8658; purple
</span></span></span><span class="org-block"><span class="org-block-end-line">#+END_SRC
</span></span><span class="org-block-end-line">#+end_parallel
</span>
<span class="org-meta-line">#+latex: \vspace{-1em}</span>

<span class="org-hide">*</span><span class="org-level-2">* Inheritance</span>

 With <span class="org-code">extends</span>, the new class inherits properties and behavior from the old
 class ---it is like <span class="org-code">Object.create(parentPrototype)</span>. The old, parent, class <span class="writegood-passive-voice">is
 called</span> the &#8220;super-class&#8221; and we refer to it using the <span class="org-code">super</span> binding.

<span class="org-block-begin-line"> #+BEGIN_SRC js
</span><span class="org-block">   </span><span class="org-block"><span class="keyword">class</span></span><span class="org-block"> Person {
     constructor(name) { </span><span class="org-block"><span class="constant">this</span></span><span class="org-block">.name = name; }
     speak() { console.log(</span><span class="org-block"><span class="string">`I am ${this.name}`</span></span><span class="org-block">); }
   }

   </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Use &#8220;super&#8221; to invoke properties of the parent, such as the parent's
</span></span><span class="org-block">   </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">constructor.
</span></span><span class="org-block">   </span><span class="org-block"><span class="keyword">class</span></span><span class="org-block"> Teacher </span><span class="org-block"><span class="keyword">extends</span></span><span class="org-block"> Person {
    constructor(name, topic) { </span><span class="org-block"><span class="keyword">super</span></span><span class="org-block">(name); </span><span class="org-block"><span class="constant">this</span></span><span class="org-block">.topic = topic; }
    speak() { </span><span class="org-block"><span class="keyword">super</span></span><span class="org-block">.speak(); console.log(</span><span class="org-block"><span class="string">`I teach ${this.topic}`</span></span><span class="org-block">); }
   }

   </span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">bobby</span></span><span class="org-block"> = </span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Person</span></span><span class="org-block">(</span><span class="org-block"><span class="string">'Bob'</span></span><span class="org-block">);
   bobby.speak(); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; I am Bob
</span></span><span class="org-block">
   </span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">bobert</span></span><span class="org-block"> = </span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Teacher</span></span><span class="org-block">(</span><span class="org-block"><span class="string">'Bob'</span></span><span class="org-block">, </span><span class="org-block"><span class="string">'Maths'</span></span><span class="org-block">);
   bobert.speak(); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; I am Bob \n I teach Maths
</span></span><span class="org-block-end-line"> #+END_SRC
</span> <span class="org-drawer">:Hide:</span>
<span class="org-block-begin-line"> #+BEGIN_SRC js
</span><span class="org-block">   </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">It is occasionally useful to know whether an object </span></span><span class="org-block"><span class="comment"><span class="writegood-passive-voice">was derived</span></span></span><span class="org-block"><span class="comment"> from a
</span></span><span class="org-block">   </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">specific class. For this, JavaScript provides a binary operator called
</span></span><span class="org-block">   </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">instanceof. Almost every object is an instance of Object.
</span></span><span class="org-block">   console.log( bobert </span><span class="org-block"><span class="keyword">instanceof</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Person</span></span><span class="org-block">
              , bobert </span><span class="org-block"><span class="keyword">instanceof</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Teacher</span></span><span class="org-block">
              , bobby  </span><span class="org-block"><span class="keyword">instanceof</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Teacher</span></span><span class="org-block">
              , [1, 2] </span><span class="org-block"><span class="keyword">instanceof</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Array</span></span><span class="org-block">
              )
</span><span class="org-block-end-line"> #+END_SRC
</span> <span class="org-drawer">:End:</span>

<span class="org-hide">*</span><span class="org-level-2">* OOP Summary</span>

 So objects do more than just hold their own properties. They have prototypes,
 which are other objects. They&#8217;ll act as if they have properties they don&#8217;t have
 as long as their prototype has that property. <span class="writegood-weasels">Simple</span> objects have
 Object.prototype as their prototype.

 The instanceof operator can, given an object and a constructor, tell you whether
 that object is an instance of that constructor.

 When implementing multiple classes that differ in only <span class="writegood-weasels">some</span> details, it can be
 helpful to write the new classes as subclasses of an existing class, inheriting
 part of its behavior.
