posts/java-cheat-sheet.org
* COMMENT Class Extension & Overloading

In the real life, every person inherits some features from his or her parents.  Likewise, it’s easier to create /children/
classes that will inherit some common behavior and attributes from a /parent/ class, rather than creating each /child/ class
from scratch every time and copy-pasting the common features.

#+begin_src java
class A           { int age() { return 1; } }
class B extends A { int age() { return 2; } } // “Overrides” the ‘age’ of parent A

A a = new B();
a.age(); // 2
#+end_src

The actual implementation of =age()= is determined at run-time: =a= is an
=A= which has an =age= method; moreover, =a= is specialised kind of
=A= known as a =B=, which overrides the implementation of the =age=
method.

In general, /when there are overloads, the most specific overload is used./
#+begin_src java
int height(A a) { return 10; }
int height(B b) { return 20; }

height(a) // 20
#+end_src

Note: Properties cannot be overriden, only methods can.

* COMMENT Streams

#+BEGIN_SRC java
class SameNameNoProblem0 {

    // Recursion with the ‘tri’angle numbers: tri(f, n) = Σⁿᵢ₌₀ f(i).
    public static int tri(Function<Integer, Integer> f, int n) {
        return n <= 0 ? 0 : f.apply(n) + tri(f, n - 1);
        // Equivalently: return IntStream.range(0, n + 1).map(f::apply).sum();
    }

    // tri(Function.identity(), 100); // ⇒ 5050
    // tri(x -> x / 2, 100);         // ⇒ 2500

    // Contextual location determines dispatch.
    // int tri = 100; int fiftyFifty = tri(Function.identity(), tri); //  ⇒ 5050
    // Likewise, location determines dispatch!
    public static Function<Integer, Integer> tri = x -> x;
    int fiftyFifty = tri(tri, 100); //  ⇒ 5050
}
#+END_SRC

