java-cheat-sheet.org.html
<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Class Extension &amp; Overloading</span>

In the real life, every person inherits <span class="writegood-weasels">some</span> features from his or her parents.  Likewise, it&#8217;s easier to create <span class="italic">children</span>
classes that will inherit <span class="writegood-weasels">some</span> common behavior and attributes from a <span class="italic">parent</span> class, rather than creating each <span class="italic">child</span> class
from scratch every time and copy-pasting the common features.

<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="keyword">class</span></span><span class="org-block"> </span><span class="org-block"><span class="type">A</span></span><span class="org-block">           { </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">age</span></span><span class="org-block">() { </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> 1; } }
</span><span class="org-block"><span class="keyword">class</span></span><span class="org-block"> </span><span class="org-block"><span class="type">B</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">extends</span></span><span class="org-block"> </span><span class="org-block"><span class="type">A</span></span><span class="org-block"> { </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">age</span></span><span class="org-block">() { </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> 2; } } </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8220;Overrides&#8221; the &#8216;age&#8217; of parent </span></span><span class="org-block"><span class="comment"><span class="writegood-duplicates">A
</span></span></span><span class="org-block"><span class="writegood-duplicates">
</span></span><span class="org-block"><span class="type"><span class="writegood-duplicates">A</span></span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">a</span></span><span class="org-block"> = </span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">B</span></span><span class="org-block">();
a.age(); </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">2
</span></span><span class="org-block-end-line">#+end_src
</span>
The actual implementation of <span class="org-verbatim">age()</span> <span class="writegood-passive-voice">is determined</span> at run-time: <span class="org-verbatim">a</span> is an
<span class="org-verbatim">A</span> which has an <span class="org-verbatim">age</span> method; moreover, <span class="org-verbatim">a</span> <span class="writegood-passive-voice">is specialised</span> kind of
<span class="org-verbatim">A</span> known as a <span class="org-verbatim">B</span>, which overrides the implementation of the <span class="org-verbatim">age</span>
method.

In general, <span class="italic">when there are overloads, the most specific overload </span><span class="italic"><span class="writegood-passive-voice">is used</span></span><span class="italic">.</span>
<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">height</span></span><span class="org-block">(</span><span class="org-block"><span class="type"><span class="writegood-duplicates">A</span></span></span><span class="org-block"><span class="writegood-duplicates"> </span></span><span class="org-block"><span class="variable-name"><span class="writegood-duplicates">a</span></span></span><span class="org-block">) { </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> 10; }
</span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">height</span></span><span class="org-block">(</span><span class="org-block"><span class="type"><span class="writegood-duplicates">B</span></span></span><span class="org-block"><span class="writegood-duplicates"> </span></span><span class="org-block"><span class="variable-name"><span class="writegood-duplicates">b</span></span></span><span class="org-block">) { </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> 20; }

height(a) </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">20
</span></span><span class="org-block-end-line">#+end_src
</span>
Note: Properties cannot be overriden, only methods can.

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Streams</span>

<span class="org-block-begin-line">#+BEGIN_SRC java
</span><span class="org-block"><span class="keyword">class</span></span><span class="org-block"> </span><span class="org-block"><span class="type">SameNameNoProblem0</span></span><span class="org-block"> {

    </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Recursion with the &#8216;tri&#8217;angle numbers: tri(f, n) = &#931;&#8319;&#7522;&#8332;&#8320; f(i).
</span></span><span class="org-block">    </span><span class="org-block"><span class="keyword">public</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">static</span></span><span class="org-block"> </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">tri</span></span><span class="org-block">(</span><span class="org-block"><span class="type">Function</span></span><span class="org-block">&lt;</span><span class="org-block"><span class="type">Integer</span></span><span class="org-block">, </span><span class="org-block"><span class="type">Integer</span></span><span class="org-block">&gt; </span><span class="org-block"><span class="variable-name">f</span></span><span class="org-block">, </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">n</span></span><span class="org-block">) {
        </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> n &lt;= 0 ? 0 : f.apply(n) + tri(f, n - 1);
        </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Equivalently: return IntStream.range(0, n + 1).map(f::apply).sum();
</span></span><span class="org-block">    }

    </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">tri(Function.identity(), 100); // &#8658; 5050
</span></span><span class="org-block">    </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">tri(x -&gt; x / 2, 100);         // &#8658; 2500
</span></span><span class="org-block">
    </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Contextual location determines dispatch.
</span></span><span class="org-block">    </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">int tri = 100; int fiftyFifty = tri(Function.identity(), tri); //  &#8658; 5050
</span></span><span class="org-block">    </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Likewise, location determines dispatch!
</span></span><span class="org-block">    </span><span class="org-block"><span class="keyword">public</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">static</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Function</span></span><span class="org-block">&lt;</span><span class="org-block"><span class="type">Integer</span></span><span class="org-block">, </span><span class="org-block"><span class="type">Integer</span></span><span class="org-block">&gt; </span><span class="org-block"><span class="variable-name">tri</span></span><span class="org-block"> = x -&gt; x;
    </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">fiftyFifty</span></span><span class="org-block"> = tri(tri, 100); </span><span class="org-block"><span class="comment-delimiter">//  </span></span><span class="org-block"><span class="comment">&#8658; 5050
</span></span><span class="org-block">}
</span><span class="org-block-end-line">#+END_SRC
</span>
