java-cheat-sheet.org.html
<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Lists and List-Like Structures</span>

+ Produce a syntactic, un-evaluated list, we use the single quote:
  <span class="org-code">'(1 2 3)</span>.

+ Construction: <span class="org-code">(cons 'x&#8320; '(x&#8321; &#8230; x&#8342;)) &#8594; (x&#8320; x&#8321; &#8230; x&#8342;)</span>.

+ Head, or <span class="italic">contents of the address part of the register</span>:
   <span class="org-code">(car '(x&#8320; x&#8321; &#8230; x&#8342;)) &#8594; x&#8320;</span>.

+ Tail, or <span class="italic">contents of the decrement part of the register</span>:
   <span class="org-code">(cdr '(x&#8320; x&#8321; &#8230; x&#8342;)) &#8594; (x&#8321; &#8230; x&#8342;)</span>.

<span class="comment"># + Deletion: ~(delete e xs)~ yields ~xs~ with all instance of ~e~ removed.</span>
<span class="comment">#  - E.g., ~(delete 1 '(2 1 3 4 1)) &#8594; '(2 3 4)~.</span>
<span class="comment">#</span>
<span class="comment"># (describe-symbol 'remove-if-not) ;; &#8220;filter&#8221; ;-)</span>

E.g., <span class="org-code">(cons 1 (cons "a" (cons 'nice nil))) &#8776; (list 1 "a" 'nice) &#8776; '(1 "a" nice)</span>.

<span class="org-meta-line">#+latex: \room</span>
Since variables refer to literals and functions have lambdas as literals, we
can produce forms that take functions as arguments. E.g., the standard <span class="org-code">mapcar</span>
may <span class="writegood-passive-voice">be construed</span>:
<span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">defun</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">my-mapcar</span></span><span class="org-block"> (f xs)
  (</span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (null xs) xs
   (cons (funcall f (car xs)) (my-mapcar f (cdr xs)))))

(my-mapcar (</span><span class="org-block"><span class="keyword">lambda</span></span><span class="org-block"> (x) (* 2 x)) '(0 1 2 3 4 5)) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; (0 2 4 6 8 10)
</span></span><span class="org-block">(my-mapcar 'upcase '(</span><span class="org-block"><span class="string">"a"</span></span><span class="org-block"> </span><span class="org-block"><span class="string">"b"</span></span><span class="org-block"> </span><span class="org-block"><span class="string">"cat"</span></span><span class="org-block">)) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; ("A" "B" "CAT")
</span></span><span class="org-block-end-line">#+END_SRC
</span>
Pairs: <span class="org-code">(x . y) &#8776; (cons x y)</span>.

  An association list, or alist, is a list formed of such pairs.
  They're useful for any changeable collection of key-value pairs.
  The <span class="org-code">assoc</span> function takes a key and an alist and returns the first pair
  having that key. In the end, alists are just lists.

  <span class="org-drawer">:Try_it_out:</span>
<span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> drinks '( (jasim . coffee) (mary . tea) (jasim . chai) ))

(assoc 'mary drinks) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; (mary . tea)
</span></span><span class="org-block">(assoc 'jasim drinks) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; (jasim . coffee)
</span></span><span class="org-block">
(</span><span class="org-block"><span class="keyword">push</span></span><span class="org-block"> '(mary . cola) drinks)
(assoc 'mary drinks) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; (mary . cola)
</span></span><span class="org-block-end-line">#+END_SRC
</span><span class="org-drawer">:End:</span>

<span class="org-meta-line">#+latex: \room</span>
(Rose) Trees in lisp are <span class="writegood-weasels">easily</span> formed as lists of lists where each inner
   list is of length 2:
   The first symbol is the parent node and the second is the list of children.

<span class="org-meta-line">#+latex: \room</span>
Lists <span class="writegood-passive-voice">are formed</span> by chains of cons cells, so getting and setting are <span class="writegood-weasels">very</span> slow;
likewise for alists. If performance <span class="writegood-passive-voice">is desired</span>, one uses arrays and hash tables,
respectively, instead. In particular, the performance of arrays and hash tables always
requires a constant amount of time whereas the performance of lists and alists grows in
proportion with their lengths.

However, the size of an array <span class="writegood-passive-voice">is fixed</span> ---it cannot change and thus grow--- and hash
tables have a lookup cost as well as issues with "hash collisions". Their use is worth
it for large amounts of data, otherwise lists are the way to go.

<span class="org-meta-line">#+latex: \room</span>
An <span class="org-link"><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Arrays.html">array</a></span> <span class="writegood-passive-voice">is created</span> like a list but using [only square brackets] with getter <span class="org-code">(aref arr index)</span>.

A hash table <span class="writegood-passive-voice">is created</span> with <span class="org-code">(make-hash-table)</span> with getter <span class="org-code">(gethash key table)</span>.

<span class="org-drawer">:Try_it_out:</span>
<span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> x [0 1 2 nice])
(aref x 3)
(aset x 0 'woah)

(</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> drinks (make-hash-table))
(</span><span class="org-block"><span class="keyword">setf</span></span><span class="org-block"> (gethash 'mary drinks) 'tea)
(</span><span class="org-block"><span class="keyword">setf</span></span><span class="org-block"> (gethash 'mary drinks) 'chai)
(gethash 'mary drinks) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; 'chai
</span></span><span class="org-block-end-line">#+END_SRC
</span><span class="org-drawer">:End:</span>

<span class="org-meta-line">#+latex: \room</span>
What if you look up a key and get <span class="org-code">nil</span>, is there no value for that key or is the value
<span class="org-code">nil</span>? <span class="org-code">gethash</span> takes a final, optional, argument which is the value to return when the
key is not found; it is <span class="org-code">nil</span> by default.

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Records</span>
