java-cheat-sheet.org.html

If we want to keep a list of related properties in a list, then we have to remember
which position keeps track of which item and may write helper functions to keep track
of this. Instead we could use a structure.
<span class="org-drawer">:More:</span>
A Lisp "Structure, record, object" represents objects with properties as in OOP.
Make a structure like this: (defstruct X (f1 d1) (f2 d2) ... (fn dn)), this creates a record type named X with slots/properties/fields fi having defaults di or nil if di is absent in which case we <span class="writegood-weasels">simply</span> write fi rather than (fi di), moreover it gives the generic constructor (make-X :f1 val1 :f2 val2 ... :fn valn) where any of the fi is optional and assigned nil by default; projection functions X.fi are also provided automatically.
Printing and reading symmetry works as expected with structures and updates happen with setf as expected.
<span class="org-drawer">:End:</span>

<span class="org-block-begin-line">#+BEGIN_SRC elisp
</span><span class="org-block">(defstruct X </span><span class="org-block"><span class="doc">"Record with fields/slots f&#7522; having defaults d&#7522;"</span></span><span class="org-block">
  (f&#8320; d&#8320;) &#8943; (f&#8342; d&#8342;))

</span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">Automatic constructor is &#8220;make-X&#8221; with keyword parameters for
</span></span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">initialising any subset of the fields!
</span></span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">Hence (expt 2 (1+ k)) kinds of possible constructor combinations!
</span></span><span class="org-block">(make-X </span><span class="org-block"><span class="builtin">:f&#8320;</span></span><span class="org-block"> val&#8320; </span><span class="org-block"><span class="builtin">:f&#8321;</span></span><span class="org-block"> val&#8321; &#8943; </span><span class="org-block"><span class="builtin">:f&#8342;</span></span><span class="org-block"> val&#8342;) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">Any, or all, f&#7522; may </span></span><span class="org-block"><span class="comment"><span class="writegood-passive-voice">be omitted</span></span></span><span class="org-block"><span class="comment">
</span></span><span class="org-block">
</span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">Automatic runtime predicate for the new type.
</span></span><span class="org-block">(X-p (make-X)) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; true
</span></span><span class="org-block">(X-p 'nope)    </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; nil
</span></span><span class="org-block">
</span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">Field accessors &#8220;X-f&#7522;&#8221; take an X record and yield its value.
</span></span><span class="org-block">
</span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">Field update: (setf (X-f&#7522; x) val&#7522;)
</span></span><span class="org-block">
(defstruct book
  title  (year  0))

(</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> ladm (make-book </span><span class="org-block"><span class="builtin">:title</span></span><span class="org-block"> </span><span class="org-block"><span class="string">"Logical Approach to Discrete Math"</span></span><span class="org-block"> </span><span class="org-block"><span class="builtin">:year</span></span><span class="org-block"> 1993))
(book-title ladm) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; "Logical Approach to Discrete Math"
</span></span><span class="org-block">(</span><span class="org-block"><span class="keyword">setf</span></span><span class="org-block"> (book-title ladm) </span><span class="org-block"><span class="string">"LADM"</span></span><span class="org-block">)
(book-title ladm) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; "LADM"
</span></span><span class="org-block-end-line">#+END_SRC
</span>
Advanced OOP constructs can <span class="writegood-passive-voice">be found</span> within the CLOS, Common Lisp Object System;
which is also used as a research tool for studying OOP ideas.

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Conditionals</span>

+ Booleans: <span class="org-code">nil</span>, the empty list <span class="org-code">()</span>, <span class="writegood-passive-voice">is considered</span> <span class="italic">false</span>, all else
  is <span class="italic">true</span>.
  - Note: <span class="org-code">nil &#8776; () &#8776; '() &#8776; 'nil</span>.
  - (Deep structural) equality: <span class="org-code">(equal x y)</span>.
  - Comparisons: As expected; e.g., <span class="org-code">(&lt;= x y)</span> denotes <span class="italic">x &#8804; y</span>.

+ <span class="org-code">(if condition thenExpr optionalElseBlock)</span>
  - Note: <span class="org-code">(if x y) &#8776; (if x y nil)</span>; \newline better: <span class="org-code">(when c thenBlock) &#8776; (if c (progn thenBlock))</span>.
  - Note the else-clause is a &#8216;block&#8217;: Everything after the then-clause <span class="writegood-passive-voice">is considered</span> to be part of it.
  - <span class="org-code">(if xs &#8943;)</span> means &#8220;if xs is nonempty then &#8943;&#8221; is akin to C style idioms on
    linked lists.

<span class="comment">#</span>
<span class="org-block-begin-line">#+begin_parallel org
</span><span class="org-block"><span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp
</span></span><span class="org-block"><span class="org-block">(</span></span><span class="org-block"><span class="org-block"><span class="keyword">cond</span></span></span><span class="org-block"><span class="org-block">
  (test&#8320;
    actionBlock&#8320;)
  (test&#8321;
    actionBlock&#8321;)
  &#8230;
  (t                    </span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">;; </span></span></span><span class="org-block"><span class="org-block"><span class="comment">optional
</span></span></span><span class="org-block"><span class="org-block">    defaultActionBlock))
</span></span><span class="org-block"><span class="org-block-end-line">#+END_SRC
</span></span><span class="org-block">  \columnbreak
</span><span class="org-block"><span class="org-block-begin-line">   #+BEGIN_SRC emacs-lisp
</span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">;; </span></span></span><span class="org-block"><span class="org-block"><span class="comment">pattern matching on any type
</span></span></span><span class="org-block"><span class="org-block">(</span></span><span class="org-block"><span class="org-block"><span class="keyword">defun</span></span></span><span class="org-block"><span class="org-block"> </span></span><span class="org-block"><span class="org-block"><span class="function-name">go</span></span></span><span class="org-block"><span class="org-block"> (x)
  (</span></span><span class="org-block"><span class="org-block"><span class="keyword">pcase</span></span></span><span class="org-block"><span class="org-block"> x
    ('bob 1972)
    (`(,a ,_ ,c) (+ a c))
    (otherwise </span></span><span class="org-block"><span class="org-block"><span class="string">"Shucks!"</span></span></span><span class="org-block"><span class="org-block">)))

(go 'bob)     </span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">;; </span></span></span><span class="org-block"><span class="org-block"><span class="comment">&#8658; 1972
</span></span></span><span class="org-block"><span class="org-block">(go '(1 2 3)) </span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">;; </span></span></span><span class="org-block"><span class="org-block"><span class="comment">&#8658; 4
</span></span></span><span class="org-block"><span class="org-block">(go 'hallo)   </span></span><span class="org-block"><span class="org-block"><span class="comment-delimiter">;; </span></span></span><span class="org-block"><span class="org-block"><span class="comment">"Shucks!"
</span></span></span><span class="org-block"><span class="org-block-end-line">#+END_SRC
</span></span><span class="org-block-end-line">#+end_parallel
</span>
Avoid nested if-then-else clauses by using a <span class="org-code">cond</span> statement --a (lazy) generalisation
of switch statements: It sequentially evaluates the expressions <span class="org-code">test&#7522;</span> and
performs only the action of the first true test; yielding <span class="org-code">nil</span> when no tests are true.
Or use <span class="org-link"><a href="http://www.wilfred.me.uk/blog/2017/03/19/pattern-matching-in-emacs-lisp/">pattern matching</a></span>; which even allows predicates in the case position ---<span class="org-code">C-h o</span> ;-)

<span class="org-drawer">:Try_it_out:</span>
<span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">cond</span></span><span class="org-block">
  (t (message </span><span class="org-block"><span class="string">"first"</span></span><span class="org-block">))
  ((/ 2 0) (message </span><span class="org-block"><span class="string">"crash"</span></span><span class="org-block">))
)
</span><span class="org-block-end-line">#+END_SRC
</span><span class="org-drawer">:End:</span>

<span class="org-meta-line">#+latex: \room</span>
Hint: If you write a predicate, think of what else you can return besides <span class="org-code">t</span>; such as
a witness to why you're returning truth --all non-nil values denote true after all.
E.g., <span class="org-code">(member e xs)</span> returns the sublist of <span class="org-code">xs</span> that begins with <span class="org-code">e</span>.
<span class="comment"># Return more than just the truth!</span>

<span class="org-drawer">:Try_it_out:</span>
<span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp
</span><span class="org-block">(member 1 '(2 1 3 5))
</span><span class="org-block-end-line">#+END_SRC
</span><span class="org-drawer">:End:</span>

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Loops</span>
