java-cheat-sheet.org.html

Let's sum the first <span class="org-code">100</span> numbers in 3 ways.
<span class="comment">#</span>
<span class="org-block-begin-line">#+begin_parallel org
</span><span class="org-block"><span class="org-block-begin-line">#+BEGIN_SRC elisp
</span></span><span class="org-block"><span class="org-block">(</span></span><span class="org-block"><span class="org-block"><span class="keyword">let</span></span></span><span class="org-block"><span class="org-block"> ((n 100) (i 0) (sum 0))
  (</span></span><span class="org-block"><span class="org-block"><span class="keyword">while</span></span></span><span class="org-block"><span class="org-block"> (&lt;= i n)
    (incf sum i) (incf i))
    (message (format </span></span><span class="org-block"><span class="org-block"><span class="string">"sum: %s"</span></span></span><span class="org-block"><span class="org-block"> sum)))
</span></span><span class="org-block"><span class="org-block-end-line">#+END_SRC
</span></span><span class="org-block">\columnbreak

</span><span class="org-block"><span class="org-table">| </span></span><span class="org-block"><span class="org-table"><span class="underline">C</span></span></span><span class="org-block"><span class="org-table">      | </span></span><span class="org-block"><span class="org-table"><span class="underline">Elisp</span></span></span><span class="org-block"><span class="org-table">      |</span></span><span class="org-block">
</span><span class="org-block"><span class="org-table">| </span></span><span class="org-block"><span class="org-table"><span class="org-code">x += y</span></span></span><span class="org-block"><span class="org-table"> | </span></span><span class="org-block"><span class="org-table"><span class="org-code">(incf x y)</span></span></span><span class="org-block"><span class="org-table"> |</span></span><span class="org-block">
</span><span class="org-block"><span class="org-table">| </span></span><span class="org-block"><span class="org-table"><span class="org-code">x -= y</span></span></span><span class="org-block"><span class="org-table"> | </span></span><span class="org-block"><span class="org-table"><span class="org-code">(decf x y)</span></span></span><span class="org-block"><span class="org-table"> |</span></span><span class="org-block">

</span><span class="org-block"><span class="org-code">y</span></span><span class="org-block"> is optional, and is 1 by default.
</span><span class="org-block-end-line">#+end_parallel
</span>
<span class="comment"># dotimes is just a specfic while loop.</span>
<span class="comment"># (insert (format "\n\n%s" (macroexpand '(dotimes (x l r) b))))</span>

<span class="comment"># Two instances of a while loop:</span>
<span class="org-block-begin-line">#+BEGIN_SRC elisp
</span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">Repeat body n times, where i is current iteration.
</span></span><span class="org-block">(</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> ((result 0) (n 100))
  (</span><span class="org-block"><span class="keyword">dotimes</span></span><span class="org-block"> (i (1+ n) result) (incf result i)))

</span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">A for-each loop: Iterate through the list [0..100].
</span></span><span class="org-block">(</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> ((result 0) (mylist (number-sequence 0 100)))
  (</span><span class="org-block"><span class="keyword">dolist</span></span><span class="org-block"> (e mylist result) (incf result e)))
</span><span class="org-block-end-line">#+END_SRC
</span>
In both loops, <span class="org-code">result</span> is optional and defaults to nil.
It is the return value of the loop expression.
<span class="org-meta-line">#+latex: \vspace{-1em}</span>
<span class="org-table">| </span><span class="org-table"><span class="bold">Example of Above Constructs</span></span><span class="org-table"> |</span>
<span class="org-meta-line">#+latex: \vspace{-1em}</span>
<span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">defun</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">my/cool-function</span></span><span class="org-block"> (N D)
  </span><span class="org-block"><span class="doc">"Sum the numbers 0..N that are not divisible by D"</span></span><span class="org-block">
  (</span><span class="org-block"><span class="keyword">catch</span></span><span class="org-block"> '</span><span class="org-block"><span class="constant">return</span></span><span class="org-block">
    (</span><span class="org-block"><span class="keyword">when</span></span><span class="org-block"> (&lt; N 0) (</span><span class="org-block"><span class="keyword">throw</span></span><span class="org-block"> '</span><span class="org-block"><span class="constant">return</span></span><span class="org-block"> 0)) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">early exit
</span></span><span class="org-block">    (</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> ((counter 0) (sum 0))
      (</span><span class="org-block"><span class="keyword">catch</span></span><span class="org-block"> '</span><span class="org-block"><span class="constant">break</span></span><span class="org-block">
    (</span><span class="org-block"><span class="keyword">while</span></span><span class="org-block"> 'true
      (</span><span class="org-block"><span class="keyword">catch</span></span><span class="org-block"> '</span><span class="org-block"><span class="constant">continue</span></span><span class="org-block">
        (incf counter)
        (</span><span class="org-block"><span class="keyword">cond</span></span><span class="org-block"> ((equal counter N)       (</span><span class="org-block"><span class="keyword">throw</span></span><span class="org-block"> '</span><span class="org-block"><span class="constant">break</span></span><span class="org-block"> sum   ))
           ((zerop (% counter D))  (</span><span class="org-block"><span class="keyword">throw</span></span><span class="org-block"> '</span><span class="org-block"><span class="constant">continue</span></span><span class="org-block"> nil))
           ('otherwise             (incf sum counter   )) )))))))

(my/cool-function  100 3)  </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; 3267
</span></span><span class="org-block">(my/cool-function  100 5)  </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; 4000
</span></span><span class="org-block">(my/cool-function -100 7)  </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; 0
</span></span><span class="org-block-end-line">#+END_SRC
</span>
The special <span class="org-link"><a href="http://www.gigamonkeys.com/book/loop-for-black-belts.html">loop</a></span> construct provides immensely <span class="writegood-weasels">many</span> options to form
nearly any kind of imperative loop. E.g., Python-style &#8216;downfrom&#8217; for-loops
and Java do-while loops. I personally prefer functional programming, so wont
look into this much.

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Exception Handling</span>

We can attempt a dangerous clause and catch a possible exceptional case
--below we do not do so via <span class="org-code">nil</span>-- for which we have an associated handler.
<span class="comment"># Which handles how to recover from such exceptional circumstances.</span>
<span class="org-block-begin-line">#+BEGIN_SRC elisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">condition-case</span></span><span class="org-block"> nil attemptClause (</span><span class="org-block"><span class="warning">error</span></span><span class="org-block"> recoveryBody))

  (</span><span class="org-block"><span class="keyword">ignore-errors</span></span><span class="org-block"> attemptBody)
&#8776; (</span><span class="org-block"><span class="keyword">condition-case</span></span><span class="org-block"> nil (</span><span class="org-block"><span class="keyword">progn</span></span><span class="org-block"> attemptBody) (</span><span class="org-block"><span class="warning">error</span></span><span class="org-block"> nil))

(</span><span class="org-block"><span class="keyword">ignore-errors</span></span><span class="org-block"> (+ 1 </span><span class="org-block"><span class="string">"nope"</span></span><span class="org-block">)) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; nil
</span></span><span class="org-block-end-line">#+END_SRC
</span>
