posts/java-cheat-sheet.org
* COMMENT Types & Overloading

Since Lisp is dynamically typed, a variable can have any kind of data, possibly
different kinds if data at different times in running a program.
We can use ~type-of~ to get the type of a given value; suffixing that with ~p~
gives the associated predicate; \newline e.g., ~function ↦ functionp~.
:More:
The following predicates tell us what kind of data a variable
has: ~numberp, arrayp, characterp,~
~consp, functionp, hash-tablep, listp, stringp, and symbolp~.
:End:

:Details:
Using these we can write functions that behave differently according to the types of
their arguments. However this sort of ad hoc polymorphism can be slow and difficult to
maintain when new types need to be considered. Instead, we could create overloaded
methods using the defmethod command: Lisp decides which one to use by considering the
types, hence the types of each declaration need to differ in at least one argument.
:End:

:Try_it_out:
#+BEGIN_SRC emacs-lisp
(type-of 3)        ;; integer
(type-of "3")      ;; string
(type-of 'x)       ;; symbol
(type-of '(x . y)) ;; cons
(type-of nil)      ;; symbol
(type-of '(1 2 3)) ;; cons
(type-of [1 2 3])  ;; vector
#+END_SRC
:End:

#+BEGIN_SRC emacs-lisp
;; Difficult to maintain as more types are added.
(defun sad-add (a b)
  (if (and (numberp a) (numberp b))
      (+ a b)
      (format "%s + %s" a b))
)

(sad-add 2 3)       ;; ⇒ 5
(sad-add 'nice "3") ;; ⇒ "nice + 3"

;; Better: Seperation of concerns.
;;
(cl-defmethod add ((a number) (b number)) (+ a b))      ;; number types
(cl-defmethod add ((a t) (b t)) (format "%s + %s" a b)) ;; catchall types

(add 2 3)       ;; ⇒ 5
(add 'nice "3") ;; ⇒ "nice + 3"
#+END_SRC

While list specific functions like list-length and mapcar may be more efficient than
generic functions, which require extra type checking, the generic ones are easier to
remember. The following generic functions work on lists, arrays, and strings:
+ ~find-if~, gets first value satisfying a predicate.
+ ~count~, finds how often an element appears in a sequence
+ ~position~, finds the index of a given element.
+ ~some~, check if any element satisfies a given predicate
+ ~every~, check if every element satisfies the given predicate
+ ~reduce~, takes a binary operation and a sequence and mimics a for-loop.
  Use keyword ~:initial-value~ to specify the starting value, otherwise use head of
  sequence.
+ ~sum~, add all numbers; crash for strings.
+ ~length, subseq, sort~.
:More:
+ ~map~, like ~mapcar~ but works for any sequence with the added ability to transform
  sequences to other types: Its first argument could be ~'list~ even if we operate in a
  string, so that the list is converted after the operation is mapped.
+ ~subseq~, yields subsequence according to given indices.
+ ~sort~, takes an ordering relation and sorts according to it.
:End:

[[https://github.com/magnars/dash.el][dash]] is a modern list library for Emacs that uses Haskell-like names for list operations ;-)
Likewise, [[https://github.com/magnars/s.el][s]] is a useful Emacs string manipulation library.

In-fact, we can [[https://github.com/knupfer/haskell-emacs][write Emacs extensions using Haskell directly]].

* COMMENT This is how we do it ---Assertions


An [[https://nodejs.org/api/assert.html#assert_strict_mode][assertion]] describes what the result of a computation is expected to look like
and throws an exception if those expectations are not met.
#+BEGIN_SRC js
const assert = require('assert');
assert.ok(!null)

// Printing a value to standard out (another method call)
console.log('Hello!');
#+END_SRC

#+RESULTS:
: Hello!
* COMMENT Misc experiments :SomeUsefulStuffHere:
