java-cheat-sheet.org.html
<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Types &amp; Overloading</span>

Since Lisp is dynamically typed, a variable can have any kind of data, possibly
different kinds if data at different times in running a program.
We can use <span class="org-code">type-of</span> to get the type of a given value; suffixing that with <span class="org-code">p</span>
gives the associated predicate; \newline e.g., <span class="org-code">function &#8614; functionp</span>.
<span class="org-drawer">:More:</span>
The following predicates tell us what kind of data a variable
has: <span class="org-code">numberp, arrayp, characterp,</span>
<span class="org-code">consp, functionp, hash-tablep, listp, stringp, and symbolp</span>.
<span class="org-drawer">:End:</span>

<span class="org-drawer">:Details:</span>
Using these we can write functions that behave differently according to the types of
their arguments. However this sort of ad hoc polymorphism can be slow and difficult to
maintain when new types need to <span class="writegood-passive-voice">be considered</span>. Instead, we could create overloaded
methods using the defmethod command: Lisp decides which one to use by considering the
types, hence the types of each declaration need to differ in at least one argument.
<span class="org-drawer">:End:</span>

<span class="org-drawer">:Try_it_out:</span>
<span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp
</span><span class="org-block">(type-of 3)        </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">integer
</span></span><span class="org-block">(type-of </span><span class="org-block"><span class="string">"3"</span></span><span class="org-block">)      </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">string
</span></span><span class="org-block">(type-of 'x)       </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">symbol
</span></span><span class="org-block">(type-of '(x . y)) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">cons
</span></span><span class="org-block">(type-of nil)      </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">symbol
</span></span><span class="org-block">(type-of '(1 2 3)) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">cons
</span></span><span class="org-block">(type-of [1 2 3])  </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">vector
</span></span><span class="org-block-end-line">#+END_SRC
</span><span class="org-drawer">:End:</span>

<span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp
</span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">Difficult to maintain as more types </span></span><span class="org-block"><span class="comment"><span class="writegood-passive-voice">are added</span></span></span><span class="org-block"><span class="comment">.
</span></span><span class="org-block">(</span><span class="org-block"><span class="keyword">defun</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">sad-add</span></span><span class="org-block"> (a b)
  (</span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (</span><span class="org-block"><span class="keyword">and</span></span><span class="org-block"> (numberp a) (numberp b))
      (+ a b)
      (format </span><span class="org-block"><span class="string">"%s + %s"</span></span><span class="org-block"> a b))
)

(sad-add 2 3)       </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; 5
</span></span><span class="org-block">(sad-add 'nice </span><span class="org-block"><span class="string">"3"</span></span><span class="org-block">) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; "nice + 3"
</span></span><span class="org-block">
</span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">Better: Seperation of concerns.
</span></span><span class="org-block"><span class="comment-delimiter">;;</span></span><span class="org-block"><span class="comment">
</span></span><span class="org-block">(</span><span class="org-block"><span class="keyword">cl-defmethod</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">add</span></span><span class="org-block"> ((a number) (b number)) (+ a b))      </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">number types
</span></span><span class="org-block">(</span><span class="org-block"><span class="keyword">cl-defmethod</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">add</span></span><span class="org-block"> ((a t) (b t)) (format </span><span class="org-block"><span class="string">"%s + %s"</span></span><span class="org-block"> a b)) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">catchall types
</span></span><span class="org-block">
(add 2 3)       </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; 5
</span></span><span class="org-block">(add 'nice </span><span class="org-block"><span class="string">"3"</span></span><span class="org-block">) </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#8658; "nice + 3"
</span></span><span class="org-block-end-line">#+END_SRC
</span>
While list specific functions like list-length and mapcar may be more efficient than
generic functions, which require extra type checking, the generic ones are easier to
remember. The following generic functions work on lists, arrays, and strings:
+ <span class="org-code">find-if</span>, gets first value satisfying a predicate.
+ <span class="org-code">count</span>, finds how <span class="writegood-weasels">often</span> an element appears in a sequence
+ <span class="org-code">position</span>, finds the index of a given element.
+ <span class="org-code"><span class="writegood-weasels">some</span></span>, check if any element satisfies a given predicate
+ <span class="org-code">every</span>, check if every element satisfies the given predicate
+ <span class="org-code">reduce</span>, takes a binary operation and a sequence and mimics a for-loop.
  Use keyword <span class="org-code">:initial-value</span> to specify the starting value, otherwise use head of
  sequence.
+ <span class="org-code">sum</span>, add all numbers; crash for strings.
+ <span class="org-code">length, subseq, sort</span>.
<span class="org-drawer">:More:</span>
+ <span class="org-code">map</span>, like <span class="org-code">mapcar</span> but works for any sequence with the added ability to transform
  sequences to other types: Its first argument could be <span class="org-code">'list</span> even if we operate in a
  string, so that the list <span class="writegood-passive-voice">is converted</span> after the operation <span class="writegood-passive-voice">is mapped</span>.
+ <span class="org-code">subseq</span>, yields subsequence according to given indices.
+ <span class="org-code">sort</span>, takes an ordering relation and sorts according to it.
<span class="org-drawer">:End:</span>

<span class="org-link"><a href="https://github.com/magnars/dash.el">dash</a></span> is a modern list library for Emacs that uses Haskell-like names for list operations ;-)
Likewise, <span class="org-link"><a href="https://github.com/magnars/s.el">s</a></span> is a useful Emacs string manipulation library.

In-fact, we can <span class="org-link"><a href="https://github.com/knupfer/haskell-emacs">write Emacs extensions using Haskell directly</a></span>.

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> This is how we do it ---Assertions</span>


An <span class="org-link"><a href="https://nodejs.org/api/assert.html#assert_strict_mode">assertion</a></span> describes what the result of a computation <span class="writegood-passive-voice">is expected</span> to look like
and throws an exception if those expectations are not met.
<span class="org-block-begin-line">#+BEGIN_SRC js
</span><span class="org-block"><span class="keyword">const</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">assert</span></span><span class="org-block"> = require(</span><span class="org-block"><span class="string">'assert'</span></span><span class="org-block">);
assert.ok(!</span><span class="org-block"><span class="constant">null</span></span><span class="org-block">)

</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Printing a value to standard out (another method call)
</span></span><span class="org-block">console.log(</span><span class="org-block"><span class="string">'Hello!'</span></span><span class="org-block">);
</span><span class="org-block-end-line">#+END_SRC
</span>
<span class="org-meta-line">#+RESULTS:</span>
<span class="org-code">: Hello!
</span><span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Misc experiments </span><span class="org-level-1"><span class="org-tag">:SomeUsefulStuffHere:</span></span>
