posts/java-cheat-sheet.org
** Clean up multiple if/else statements by using a Map
TODO: Take a look on Martin Fowler's book ''Refactoring", he talks about a technique called Replace Conditional With Polymorphism

#+begin_src java
var perform = new Utilities();
if (someCondition(1)) perform.a();
if (someCondition(2)) perform.b();
if (someCondition(3)) perform.c();

// The “if”s have a common condition
boolean someCondition(int i) {
    return List.of(1, 3, 4).contains(i);
}

// But the “if” branches can each do something different
class Utilities {
    void a() { System.out.println("A"); }
    void b() { System.out.println("B"); }
    void c() { System.out.println("C"); }
}

// Then you can replace the sequence of “if”s with a map as follows

Map<Integer, Consumer<Utilities>> ifs =
    Map.of(1, it -> it.a(),
           2, it -> it.b(),
           3, it -> it.c());

ifs.keySet().stream().filter(k -> someCondition(k)).forEach(k -> ifs.get(k).accept(perform))

// Though this is not necessarily much better.

// An alternative approach is to use enum-s.
#+end_src

