java-cheat-sheet.org.html
<span class="org-hide">*</span><span class="org-level-2">* Clean up multiple if/else statements by using a Map</span>
<span class="hl-todo"><span class="custom-1">TODO</span></span>: Take a look on Martin Fowler's book ''Refactoring", he talks about a technique called Replace Conditional With Polymorphism

<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="type">var</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">perform</span></span><span class="org-block"> = </span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Utilities</span></span><span class="org-block">();
</span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (someCondition(1)) perform.a();
</span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (someCondition(2)) perform.b();
</span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (someCondition(3)) perform.c();

</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">The &#8220;if&#8221;s have a common condition
</span></span><span class="org-block"><span class="type">boolean</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">someCondition</span></span><span class="org-block">(</span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">i</span></span><span class="org-block">) {
    </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> List.of(1, 3, 4).contains(i);
}

</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">But the &#8220;if&#8221; branches can each do something different
</span></span><span class="org-block"><span class="keyword">class</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Utilities</span></span><span class="org-block"> {
    </span><span class="org-block"><span class="type">void</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">a</span></span><span class="org-block">() { System.out.println(</span><span class="org-block"><span class="string">"A"</span></span><span class="org-block">); }
    </span><span class="org-block"><span class="type">void</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">b</span></span><span class="org-block">() { System.out.println(</span><span class="org-block"><span class="string">"B"</span></span><span class="org-block">); }
    </span><span class="org-block"><span class="type">void</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">c</span></span><span class="org-block">() { System.out.println(</span><span class="org-block"><span class="string">"C"</span></span><span class="org-block">); }
}

</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Then you can replace the sequence of &#8220;if&#8221;s with a map as follows
</span></span><span class="org-block">
</span><span class="org-block"><span class="type">Map</span></span><span class="org-block">&lt;</span><span class="org-block"><span class="type">Integer</span></span><span class="org-block">, </span><span class="org-block"><span class="type">Consumer</span></span><span class="org-block">&lt;</span><span class="org-block"><span class="type">Utilities</span></span><span class="org-block">&gt;&gt; </span><span class="org-block"><span class="variable-name">ifs</span></span><span class="org-block"> =
    Map.of(1, it -&gt; it.a(),
           2, it -&gt; it.b(),
           3, it -&gt; it.c());

ifs.keySet().stream().filter(k -&gt; someCondition(k)).forEach(k -&gt; ifs.get(k).accept(perform))

</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Though this is not necessarily much better.
</span></span><span class="org-block">
</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">An alternative approach is to use enum-s.
</span></span><span class="org-block-end-line">#+end_src
</span>
