posts/java-cheat-sheet.org
** Lisp's ~apply~ operator in Java; i.e., JS's spread operator         :Misc:
(See also: https://stackoverflow.com/questions/48351536/varargs-as-input-parameter-to-a-function-in-java-8)
- What are varargs behind the scenes? Arrays! https://stackoverflow.com/a/57290781
- How to write Lisp's ~apply~ operator in Java? i.e., JS's spread operator? https://stackoverflow.com/a/46388765
#+begin_src java
import java.lang.reflect.*;
class Test {
    public static int go(int a, int b, int c) {
        return a + b + c;
    }
    public static int go(int a, int b) {
        return a + b;
    }
    public static int og(String a, Integer b) {
        return 12;
    }
    public static void main () throws java.lang.Exception {
        Method goM = Test.class.getMethod("go", Integer.TYPE, Integer.TYPE);
        // Note that args is Object[], not int[]
        Object[] args = new Object[] {1, 2};
        // Result is also Object, not int
        Object res = goM.invoke(null, args);
        System.out.println(res);
    }
}

@FunctionalInterface
public interface VarArgsBiFunction<S, T, R>{
    R apply(S a, T... args);
}
//
// args[0] should be a string, the name of the method we want to execute.
// Remaining args are the actual arguments to be passed to the method.
VarArgsBiFunction<Class,Object,Object> spread = (clazzy, arguments) -> {
    String fname = (String) arguments[0];
    Object[] args  = Arrays.stream(arguments).skip(1).toArray();
    Class<? extends Object>[] types = Arrays.stream(args).map(x -> x.getClass()).toArray(Class[]::new);
    try { Method f = clazzy.getMethod(fname, types);
          return f.invoke(null, args);} catch(Exception e) { return null; }
};
//
// Example usage:
//
spread.apply(Test.class, "og", "hello", 1)
#+end_src
