java-cheat-sheet.org.html
<span class="org-hide">*</span><span class="org-level-2">* Lisp's </span><span class="org-level-2"><span class="org-code">apply</span></span><span class="org-level-2"> operator in Java; i.e., JS's spread operator         </span><span class="org-level-2"><span class="org-tag">:Misc:</span></span>
(See also: <span class="org-link"><a href="https://stackoverflow.com/questions/48351536/varargs-as-input-parameter-to-a-function-in-java-8">https://stackoverflow.com/questions/48351536/varargs-as-input-parameter-to-a-function-in-java-8</a></span>)
- What are varargs behind the scenes? Arrays! <span class="org-link"><a href="https://stackoverflow.com/a/57290781">https://stackoverflow.com/a/57290781</a></span>
- How to write Lisp's <span class="org-code">apply</span> operator in Java? i.e., JS's spread operator? <span class="org-link"><a href="https://stackoverflow.com/a/46388765">https://stackoverflow.com/a/46388765</a></span>
<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="keyword">import</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">java</span></span><span class="org-block">.</span><span class="org-block"><span class="constant">lang</span></span><span class="org-block">.</span><span class="org-block"><span class="constant">reflect</span></span><span class="org-block">.*;
</span><span class="org-block"><span class="keyword">class</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Test</span></span><span class="org-block"> {
    </span><span class="org-block"><span class="keyword">public</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">static</span></span><span class="org-block"> </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">go</span></span><span class="org-block">(</span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">a</span></span><span class="org-block">, </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">b</span></span><span class="org-block">, </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">c</span></span><span class="org-block">) {
        </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> a + b + c;
    }
    </span><span class="org-block"><span class="keyword">public</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">static</span></span><span class="org-block"> </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">go</span></span><span class="org-block">(</span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">a</span></span><span class="org-block">, </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">b</span></span><span class="org-block">) {
        </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> a + b;
    }
    </span><span class="org-block"><span class="keyword">public</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">static</span></span><span class="org-block"> </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">og</span></span><span class="org-block">(</span><span class="org-block"><span class="type">String</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">a</span></span><span class="org-block">, </span><span class="org-block"><span class="type">Integer</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">b</span></span><span class="org-block">) {
        </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> 12;
    }
    </span><span class="org-block"><span class="keyword">public</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">static</span></span><span class="org-block"> </span><span class="org-block"><span class="type">void</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">main</span></span><span class="org-block"> () </span><span class="org-block"><span class="keyword">throws</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">java</span></span><span class="org-block">.</span><span class="org-block"><span class="constant">lang</span></span><span class="org-block">.</span><span class="org-block"><span class="type">Exception</span></span><span class="org-block"> {
        </span><span class="org-block"><span class="type">Method</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">goM</span></span><span class="org-block"> = Test.</span><span class="org-block"><span class="keyword">class</span></span><span class="org-block">.getMethod(</span><span class="org-block"><span class="string">"go"</span></span><span class="org-block">, </span><span class="org-block"><span class="constant">Integer</span></span><span class="org-block">.TYPE, </span><span class="org-block"><span class="constant">Integer</span></span><span class="org-block">.TYPE);
        </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Note that args is Object[], not int[]
</span></span><span class="org-block">        </span><span class="org-block"><span class="type">Object</span></span><span class="org-block">[] </span><span class="org-block"><span class="variable-name">args</span></span><span class="org-block"> = </span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Object</span></span><span class="org-block">[] {1, 2};
        </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Result is also Object, not int
</span></span><span class="org-block">        </span><span class="org-block"><span class="type">Object</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">res</span></span><span class="org-block"> = goM.invoke(</span><span class="org-block"><span class="constant">null</span></span><span class="org-block">, args);
        System.out.println(res);
    }
}

</span><span class="org-block"><span class="c-annotation">@FunctionalInterface</span></span><span class="org-block">
</span><span class="org-block"><span class="keyword">public</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">interface</span></span><span class="org-block"> </span><span class="org-block"><span class="type">VarArgsBiFunction</span></span><span class="org-block">&lt;</span><span class="org-block"><span class="type">S</span></span><span class="org-block">, </span><span class="org-block"><span class="type">T</span></span><span class="org-block">, </span><span class="org-block"><span class="type">R</span></span><span class="org-block">&gt;{
    </span><span class="org-block"><span class="type">R</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">apply</span></span><span class="org-block">(</span><span class="org-block"><span class="type">S</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">a</span></span><span class="org-block">, </span><span class="org-block"><span class="type">T</span></span><span class="org-block">... </span><span class="org-block"><span class="variable-name">args</span></span><span class="org-block">);
}
</span><span class="org-block"><span class="comment-delimiter">//</span></span><span class="org-block"><span class="comment">
</span></span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">args[0] should be a string, the name of the method we want to execute.
</span></span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Remaining args are the actual arguments to </span></span><span class="org-block"><span class="comment"><span class="writegood-passive-voice">be passed</span></span></span><span class="org-block"><span class="comment"> to the method.
</span></span><span class="org-block"><span class="type">VarArgsBiFunction</span></span><span class="org-block">&lt;</span><span class="org-block"><span class="type">Class</span></span><span class="org-block">,</span><span class="org-block"><span class="type">Object</span></span><span class="org-block">,</span><span class="org-block"><span class="type">Object</span></span><span class="org-block">&gt; </span><span class="org-block"><span class="variable-name">spread</span></span><span class="org-block"> = (clazzy, arguments) -&gt; {
    String fname = (</span><span class="org-block"><span class="type">String</span></span><span class="org-block">) arguments[0];
    </span><span class="org-block"><span class="type">Object</span></span><span class="org-block">[] </span><span class="org-block"><span class="variable-name">args</span></span><span class="org-block">  = Arrays.stream(arguments).skip(1).toArray();
    </span><span class="org-block"><span class="type">Class</span></span><span class="org-block">&lt;? </span><span class="org-block"><span class="keyword">extends</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Object</span></span><span class="org-block">&gt;[] </span><span class="org-block"><span class="variable-name">types</span></span><span class="org-block"> = Arrays.stream(args).map(x -&gt; x.getClass()).toArray(Class[]::</span><span class="org-block"><span class="keyword">new</span></span><span class="org-block">);
    </span><span class="org-block"><span class="keyword">try</span></span><span class="org-block"> { </span><span class="org-block"><span class="type">Method</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">f</span></span><span class="org-block"> = clazzy.getMethod(fname, types);
          </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> f.invoke(</span><span class="org-block"><span class="constant">null</span></span><span class="org-block">, args);} </span><span class="org-block"><span class="keyword">catch</span></span><span class="org-block">(Exception e) { </span><span class="org-block"><span class="keyword">return</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">null</span></span><span class="org-block">; }
};
</span><span class="org-block"><span class="comment-delimiter">//</span></span><span class="org-block"><span class="comment">
</span></span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">Example usage:
</span></span><span class="org-block"><span class="comment-delimiter">//</span></span><span class="org-block"><span class="comment">
</span></span><span class="org-block">spread.apply(Test.</span><span class="org-block"><span class="keyword">class</span></span><span class="org-block">, </span><span class="org-block"><span class="string">"og"</span></span><span class="org-block">, </span><span class="org-block"><span class="string">"hello"</span></span><span class="org-block">, 1)
</span><span class="org-block-end-line">#+end_src
