posts/java-cheat-sheet.org
** How to make a ‘fat’ jar file

Do you want to make a regular desktop GUI application? If so, in IntelliJ click File > New... > Project... And pick JavaFX and go from there. It even gives you a sort of Hello World window. You can just launch the app by clicking the green play button.

IntelliJ's new project wizard does a ton to make it easier to get started so you don't have to futz as much with IDE, JDK and build tool configuration. I like to let IntelliJ download and install the JDK too. It's just so much easier.

To build an executable, open the Maven pane and run package under "lifecycle". That creates your runnable jar in the target/ folder.

--------------------------------------------------------------------------------

None of the responses so far answered what you are asking. I will give you the terms you need to look up in order to do what you want to do. First you need to install the Java SDK on your computer. Next you can create a new project in intellij. Intellij manages the packages so you don't have to worry about that for the most part. If you plan on using third party libraries you will need to use Maven or Gradle to easily download and apply them. Once you have coded your project then you need to compile the project into a Jar file. A jar file is like a zip folder full of class files which are compiled Java files. To run you project you will use the Java command in the terminal with the jar name. If you want to double click on an icon to run the project you will need to create a "fat" jar instead which has Java bundled into it. Using these keywords you can look up tutorials on how to do each step. Good luck!
** Searlisation

Neato article: https://yfain.github.io/Java4Kids/#_serialization_turning_an_object_into_bytes
#+begin_quote
11.5. Serialization: Turning an Object Into Bytes

Imagine a building that, with a push of a button, can be turned into a
pile of construction materials. Load all these materials on the truck
and drive to a different city. On arrival push another button, and the
building is magically re-created in its original form. This is what
Java serialization is about, but instead of a building we’ll use a
Java object. By “clicking the serialize button” JVM turns an instance
of an object into a pile of bytes, and “clicking the deserialize
button” re-creates the object.

Why would you need such functionality? Say you are working on a board
game and want to be able to save the current state of the game so the
player can continue playing it tomorrow even if the computer will need
to be rebooted. The program needs to save the state of the game in a
file, and when the player launches the game again, the program should
load the saved state and recreate the situation on the board. Creating
a Java class with fields like player name, level, score, and lives can
be a good way to represent a state of the game.
#+end_quote

A Java object can be serialized if it implements Serializabe
interface. It’s a very simple interface to implement, as it doesn’t
declare any abstract methods. Just add implements Serializable to the
class declaration to make a class serializable.

#+begin_src java
record Winner(String name, int score) implements Serializable { }

var gameState = List.of(new Winner("You", 123), new Winner("Me", 456));
var gamePath = Paths.get("gamestate.ser");

// write the state to the gamePath file
new ObjectOutputStream(Files.newOutputStream(gamePath, StandardOpenOption.CREATE)).writeObject(gameState);

// read the state from the gamePath file
List<Winner> mySavedState = (List<Winner>) new ObjectInputStream(Files.newInputStream(gamePath)).readObject();
#+end_src

you’ll see that it creates a new file gamestate.ser. Open this file in
a text editor, and you’ll see some gibberish. Java serializes objects
in its internal format, which is not meant to be read by people.

** Reading URLs (including local files)
var url = "file:///Users/musa/blog/java-cheat-sheet.html";
var buffer = new BufferedReader(new InputStreamReader(new URL(url).openStream()));
//
for(String line; (line = buffer.readLine()) != null;) System.out.println(line);


There are better ways to read local files, though.

