java-cheat-sheet.org.html
</span><span class="org-hide">*</span><span class="org-level-2">* How to make a &#8216;fat&#8217; jar file</span>

Do you want to make a regular desktop GUI application? If so, in IntelliJ click File &gt; New... &gt; Project... And pick JavaFX and go from there. It even gives you a sort of Hello World window. You can just launch the app by clicking the green play button.

IntelliJ's new project wizard does a ton to make it easier to get started so you don't have to futz as much with IDE, JDK and build tool configuration. I like to let IntelliJ download and install the JDK too. It's just so much easier.

To build an executable, open the Maven pane and run package under "lifecycle". That creates your runnable jar in the target/ folder.

--------------------------------------------------------------------------------

None of the responses so far answered what you are asking. I will give you the terms you need to look up in order to do what you want to do. First you need to install the Java SDK on your computer. Next you can create a new project in intellij. Intellij manages the packages so you don't have to worry about that for the most part. If you plan on using third party libraries you will need to use Maven or Gradle to <span class="writegood-weasels">easily</span> download and apply them. Once you have coded your project then you need to compile the project into a Jar file. A jar file is like a zip folder full of class files which <span class="writegood-passive-voice">are compiled</span> Java files. To run you project you will use the Java command in the terminal with the jar name. If you want to double click on an icon to run the project you will need to create a "fat" jar instead which has Java bundled into it. Using these keywords you can look up tutorials on how to do each step. Good luck!
<span class="org-hide">*</span><span class="org-level-2">* Searlisation</span>

Neato article: <span class="org-link"><a href="https://yfain.github.io/Java4Kids/#_serialization_turning_an_object_into_bytes">https://yfain.github.io/Java4Kids/#_serialization_turning_an_object_into_bytes</a></span>
<span class="org-block-begin-line">#+begin_quote
</span><span class="org-quote">11.5. Serialization: Turning an Object Into Bytes

Imagine a building that, with a push of a button, can </span><span class="org-quote"><span class="writegood-passive-voice">be turned</span></span><span class="org-quote"> into a
pile of construction materials. Load all these materials on the truck
and drive to a different city. On arrival push another button, and the
building is magically re-created in its original form. This is what
Java serialization is about, but instead of a building we&#8217;ll use a
Java object. By &#8220;clicking the serialize button&#8221; JVM turns an instance
of an object into a pile of bytes, and &#8220;clicking the deserialize
button&#8221; re-creates the object.

Why would you need such functionality? Say you are working on a board
game and want to be able to save the current state of the game so the
player can continue playing it tomorrow even if the computer will need
to </span><span class="org-quote"><span class="writegood-passive-voice">be rebooted</span></span><span class="org-quote">. The program needs to save the state of the game in a
file, and when the player launches the game again, the program should
load the saved state and recreate the situation on the board. Creating
a Java class with fields like player name, level, score, and lives can
be a good way to represent a state of the game.
</span><span class="org-block-end-line">#+end_quote
</span>
A Java object can <span class="writegood-passive-voice">be serialized</span> if it implements Serializabe
interface. It&#8217;s a <span class="writegood-weasels">very</span> <span class="writegood-weasels">simple</span> interface to implement, as it doesn&#8217;t
declare any abstract methods. Just add implements Serializable to the
class declaration to make a class serializable.

<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="type">record</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">Winner</span></span><span class="org-block">(</span><span class="org-block"><span class="type">String</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">name</span></span><span class="org-block">, </span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">score</span></span><span class="org-block">) </span><span class="org-block"><span class="keyword">implements</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Serializable</span></span><span class="org-block"> { }

</span><span class="org-block"><span class="type">var</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">gameState</span></span><span class="org-block"> = List.of(</span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Winner</span></span><span class="org-block">(</span><span class="org-block"><span class="string">"You"</span></span><span class="org-block">, 123), </span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">Winner</span></span><span class="org-block">(</span><span class="org-block"><span class="string">"Me"</span></span><span class="org-block">, 456));
</span><span class="org-block"><span class="type">var</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">gamePath</span></span><span class="org-block"> = Paths.get(</span><span class="org-block"><span class="string">"gamestate.ser"</span></span><span class="org-block">);

</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">write the state to the gamePath file
</span></span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">ObjectOutputStream</span></span><span class="org-block">(Files.newOutputStream(gamePath, </span><span class="org-block"><span class="constant">StandardOpenOption</span></span><span class="org-block">.CREATE)).writeObject(gameState);

</span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">read the state from the gamePath file
</span></span><span class="org-block"><span class="type">List</span></span><span class="org-block">&lt;</span><span class="org-block"><span class="type">Winner</span></span><span class="org-block">&gt; </span><span class="org-block"><span class="variable-name">mySavedState</span></span><span class="org-block"> = (</span><span class="org-block"><span class="type">List</span></span><span class="org-block">&lt;</span><span class="org-block"><span class="type">Winner</span></span><span class="org-block">&gt;) </span><span class="org-block"><span class="keyword">new</span></span><span class="org-block"> </span><span class="org-block"><span class="type">ObjectInputStream</span></span><span class="org-block">(Files.newInputStream(gamePath)).readObject();
</span><span class="org-block-end-line">#+end_src
</span>
you&#8217;ll see that it creates a new file gamestate.ser. Open this file in
a text editor, and you&#8217;ll see <span class="writegood-weasels">some</span> gibberish. Java serializes objects
in its internal format, which is not meant to <span class="writegood-passive-voice">be read</span> by people.

<span class="org-hide">*</span><span class="org-level-2">* Reading URLs (including local files)</span>
var url = "<span class="org-link"><a href="file:///Users/musa/blog/java-cheat-sheet.html">file:///Users/musa/blog/java-cheat-sheet.html</a></span>";
var buffer = new BufferedReader(new InputStreamReader(new URL(url).openStream()));
//
for(String line; (line = buffer.readLine()) != null;) System.out.println(line);


There are better ways to read local files, though.
