posts/java-cheat-sheet.org
** labels aka jump points

https://stackoverflow.com/questions/3821827/loop-in-java-code-what-is-this-and-why-does-it-compile

these are labels.

They should not even be taught to you. Labels are mostly a thing of the past (like line numbers in BASIC were).

Do yourself a favor and forget them as soon as you are over with that chapter/have done your test.

Basically what they do is define "jump points" to where the code execution is rerouted.

--------------------------------------------------------------------------------

these are essentially a limited form of 'goto' in Java.

There are very rare cases where the use of labels could allow you to write faster control-flow - but unless you're micro-optimising something, you really shouldn't use them. I wouldn't go as far as saying you shouldn't be taught about them, or that you should immediately forget them - you may encounter them in highly tuned, very specialised code (or in cases where people optimise when they shouldn't), but their use is exceptionally rare and justified use even more so.


You can short-circuit a block of code by naming it, then using ~break~ to “break out of it”:
~N : {S₀; S₁; …; if(someCondition) break N; Sᵏ; Sᵏ⁺¹; … }  ≈  S₀; S₁; ⋯; if(!someCondition) { Sᵏ; Sᵏ⁺¹; ⋯ }~.



A fair number of those that know about labels, don't realise that they don't just apply to loops.

Both of these are valid Java (assuming I don't have a typo).

#+begin_src java
void m1(int x) {
    X1: {
        System.out.println(1);
        X2: {
            System.out.println(2);
            if (x %2 == 0) break X1;
            else break X2;
        }
        System.out.println(3);
    }
    System.out.println(4);
}

m1(3) // ⇒ 1 2 3 4

void m2(int x) {
    X1: if (x > 5) {
        System.out.println(1);
        if (x < 10) break X1;
        System.out.println(2);
    }
    else X2: {
        System.out.println(3);
        if (x > 0) break X2;
        System.out.println(4);
    }
}
#+end_src

** Subclasses

We can be more specific and create another Java class called
PlayStation4. It also belongs to the family of video games, but has
some properties that are specific to the model Play Station 4,

* COMMENT Making ~README.org~

  Evaluate the following source block with ~C-c C-c~
  to produce a ~README~ file.

  # :'( For some reason using {{{title}}} below would not work.

#+NAME: make-readme

Note that the ~blurb~ macro is defined by the user, to provide a terse description of the project.
   - Think the one-line statement at the top of a github repo page.

#    The ~d:nil~ ensures the ‘drawer’ ~:Hide: ⋯ :End:~ is not exported; it's there for me
#    as a reminder.


#+BEGIN_SRC emacs-lisp
(with-temp-buffer
    (insert
    "#+EXPORT_FILE_NAME: README.md
     # HTML: <h1> Easily Making CheatSheets with Org-mode </h1>
     #+OPTIONS: toc:nil d:nil
     # Toc is displayed below at a strategic position.

     {{{blurb}}}

     :Hide:
     This project is to contain a listing of common results in X Theory.

     *The repo contains other articles I've written on X Theory;*
     *which may be read in a blog-format at:*
     https://alhassy.github.io/blog/categories/#Xtheory
     :End:

     *The listing sheet, as PDF, can be found
     [[file:java-cheat-sheet.pdf][here]]*,
     while below is an unruly html rendition
     ---there is also a
     badge:beautiful|HTML_webpage|success|https://alhassy.com/java-cheat-sheet|java (•̀ᴗ•́)

     # Markdown links: [title](target)

     This reference sheet is built from a
     [[https://github.com/alhassy/CheatSheet][CheatSheets with Org-mode]]
     system.

     #+TOC: headlines 2
     #+INCLUDE: java-cheat-sheet.org
    ")

    ;; No code execution on export
    ;; ⟪ For a particular block, we use “:eval never-export” ⟫
    ;;
    (let ((org-export-use-babel nil))
      (org-mode)
      (org-md-export-to-markdown)
      ; (package-install 'toc-org)
      ; (toc-org-mode)
      ; (toc-org-insert-toc)
      ; (setq org-toc-noexport-regexp ".*:myIgnore:.*") MA: Doesn't work.
      ; (delete "TOC" org-export-exclude-tags)
      (pop org-export-exclude-tags)
      ; (org-org-export-to-org)
      (add-to-list 'org-export-exclude-tags "TOC")
      )
)
#+END_SRC

