java-cheat-sheet.org.html

<span class="org-hide">*</span><span class="org-level-2">* labels aka jump points</span>

<span class="org-link"><a href="https://stackoverflow.com/questions/3821827/loop-in-java-code-what-is-this-and-why-does-it-compile">https://stackoverflow.com/questions/3821827/loop-in-java-code-what-is-this-and-why-does-it-compile</a></span>

these are labels.

They should not even <span class="writegood-passive-voice">be taught</span> to you. Labels are <span class="writegood-weasels">mostly</span> a thing of the past (like line numbers in BASIC were).

Do yourself a favor and forget them as soon as you are over with that chapter/have done your test.

Basically what they do is define "jump points" to where the code execution <span class="writegood-passive-voice">is rerouted</span>.

--------------------------------------------------------------------------------

these are essentially a limited form of 'goto' in Java.

There are <span class="writegood-weasels">very</span> rare cases where the use of labels could allow you to write faster control-flow - but unless you're micro-optimising something, you really shouldn't use them. I wouldn't go as far as saying you shouldn't <span class="writegood-passive-voice">be taught</span> about them, or that you should immediately forget them - you may encounter them in highly tuned, <span class="writegood-weasels">very</span> specialised code (or in cases where people optimise when they shouldn't), but their use is exceptionally rare and justified use even more so.


You can short-circuit a block of code by naming it, then using <span class="org-code">break</span> to &#8220;break out of it&#8221;:
<span class="org-code">N : {S&#8320;; S&#8321;; &#8230;; if(someCondition) break N; S&#7503;; S&#7503;&#8314;&#185;; &#8230; } &#160;&#8776;&#160; S&#8320;; S&#8321;; &#8943;; if(!someCondition) { S&#7503;; S&#7503;&#8314;&#185;; &#8943; }</span>.



A fair number of those that know about labels, don't realise that they don't just apply to loops.

Both of these are valid Java (assuming I don't have a typo).

<span class="org-block-begin-line">#+begin_src java
</span><span class="org-block"><span class="type">void</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">m1</span></span><span class="org-block">(</span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">x</span></span><span class="org-block">) {
    </span><span class="org-block"><span class="constant">X1</span></span><span class="org-block">: {
        System.out.println(1);
        </span><span class="org-block"><span class="constant">X2</span></span><span class="org-block">: {
            System.out.println(2);
            </span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (x %2 == 0) </span><span class="org-block"><span class="keyword">break</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">X1</span></span><span class="org-block">;
            </span><span class="org-block"><span class="keyword">else</span></span><span class="org-block"> </span><span class="org-block"><span class="keyword">break</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">X2</span></span><span class="org-block">;
        }
        System.out.println(3);
    }
    System.out.println(4);
}

m1(3) </span><span class="org-block"><span class="comment-delimiter">// </span></span><span class="org-block"><span class="comment">&#8658; 1 2 3 4
</span></span><span class="org-block">
</span><span class="org-block"><span class="type">void</span></span><span class="org-block"> m2(</span><span class="org-block"><span class="type">int</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">x</span></span><span class="org-block">) {
    </span><span class="org-block"><span class="constant">X1</span></span><span class="org-block">: </span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (x &gt; 5) {
        System.out.println(1);
        </span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (x &lt; 10) </span><span class="org-block"><span class="keyword">break</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">X1</span></span><span class="org-block">;
        System.out.println(2);
    }
    </span><span class="org-block"><span class="keyword">else</span></span><span class="org-block"> X2: {
        System.out.println(3);
        </span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> (x &gt; 0) </span><span class="org-block"><span class="keyword">break</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">X2</span></span><span class="org-block">;
        System.out.println(4);
    }
}
</span><span class="org-block-end-line">#+end_src
</span>
<span class="org-hide">*</span><span class="org-level-2">* Subclasses</span>

We can be more specific and create another Java class called
PlayStation4. It also belongs to the family of video games, but has
<span class="writegood-weasels">some</span> properties that are specific to the model Play Station 4,

<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Making </span><span class="org-level-1"><span class="org-code">README.org</span></span>

  Evaluate the following source block with <span class="org-code">C-</span><span class="org-code"><span class="writegood-duplicates">c C</span></span><span class="org-code">-c</span>
  to produce a <span class="org-code">README</span> file.

<span class="comment">  # :'( For </span><span class="comment"><span class="writegood-weasels">some</span></span><span class="comment"> reason using title below would not work.</span>

<span class="org-meta-line">#+NAME: make-readme</span>

Note that the <span class="org-code">blurb</span> macro <span class="writegood-passive-voice">is defined</span> by the user, to provide a terse description of the project.
   - Think the one-line statement at the top of a github repo page.

<span class="comment">#    The ~d:nil~ ensures the &#8216;drawer&#8217; ~:Hide: &#8943; :End:~ is not exported; it's there for me</span>
<span class="comment">#    as a reminder.</span>


<span class="org-block-begin-line">#+BEGIN_SRC emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">with-temp-buffer</span></span><span class="org-block">
    (insert
    </span><span class="org-block"><span class="string">"#+EXPORT_FILE_NAME: README.md
     # HTML: &lt;h1&gt; </span></span><span class="org-block"><span class="string"><span class="writegood-weasels">Easily</span></span></span><span class="org-block"><span class="string"> Making CheatSheets with Org-mode &lt;/h1&gt;
     #+OPTIONS: toc:nil d:nil
     # Toc </span></span><span class="org-block"><span class="string"><span class="writegood-passive-voice">is displayed</span></span></span><span class="org-block"><span class="string"> below at a strategic position.

     {{{blurb}}}

     :Hide:
     This project is to contain a listing of common results in X Theory.

     *The repo contains other articles I've written on X Theory;*
     *which may </span></span><span class="org-block"><span class="string"><span class="writegood-passive-voice">be read</span></span></span><span class="org-block"><span class="string"> in a blog-format at:*
     <a href="https://alhassy.github.io/blog/categories/#Xtheory">https://alhassy.github.io/blog/categories/#Xtheory</a>
     :End:

     *The listing sheet, as PDF, can </span></span><span class="org-block"><span class="string"><span class="writegood-passive-voice">be found</span></span></span><span class="org-block"><span class="string">
     <a href="file:java-cheat-sheet.pdf">[[file:java-cheat-sheet.pdf][here]]</a>*,
     while below is an unruly html rendition
     ---there is also a
     <a href="badge:beautiful|HTML_webpage|success|https://alhassy.com/java-cheat-sheet|java">badge:beautiful|HTML_webpage|success|https://alhassy.com/java-cheat-sheet|java</a> (&#8226;&#768;&#7447;&#8226;&#769;)

     # Markdown links: [title](target)

     This reference sheet </span></span><span class="org-block"><span class="string"><span class="writegood-passive-voice">is built</span></span></span><span class="org-block"><span class="string"> from a
     <a href="https://github.com/alhassy/CheatSheet">[[https://github.com/alhassy/CheatSheet][CheatSheets with Org-mode]]</a>
     system.

     #+TOC: headlines 2
     #+INCLUDE: java-cheat-sheet.org
    "</span></span><span class="org-block">)

    </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">No code execution on export
</span></span><span class="org-block">    </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">&#10218; For a particular block, we use &#8220;:eval never-export&#8221; &#10219;
</span></span><span class="org-block">    </span><span class="org-block"><span class="comment-delimiter">;;</span></span><span class="org-block"><span class="comment">
</span></span><span class="org-block">    (</span><span class="org-block"><span class="keyword">let</span></span><span class="org-block"> ((org-export-use-babel nil))
      (org-mode)
      (org-md-export-to-markdown)
      </span><span class="org-block"><span class="comment-delimiter">; </span></span><span class="org-block"><span class="comment">(package-install 'toc-org)
</span></span><span class="org-block">      </span><span class="org-block"><span class="comment-delimiter">; </span></span><span class="org-block"><span class="comment">(toc-org-mode)
</span></span><span class="org-block">      </span><span class="org-block"><span class="comment-delimiter">; </span></span><span class="org-block"><span class="comment">(toc-org-insert-toc)
</span></span><span class="org-block">      </span><span class="org-block"><span class="comment-delimiter">; </span></span><span class="org-block"><span class="comment">(setq org-toc-noexport-regexp ".*:myIgnore:.*") </span></span><span class="org-block"><span class="comment"><span class="hl-todo"><span class="custom-2"><span class="hl-todo"><span class="custom-2">MA</span></span></span></span></span></span><span class="org-block"><span class="comment">: Doesn't work.
</span></span><span class="org-block">      </span><span class="org-block"><span class="comment-delimiter">; </span></span><span class="org-block"><span class="comment">(delete "TOC" org-export-exclude-tags)
</span></span><span class="org-block">      (</span><span class="org-block"><span class="keyword">pop</span></span><span class="org-block"> org-export-exclude-tags)
      </span><span class="org-block"><span class="comment-delimiter">; </span></span><span class="org-block"><span class="comment">(org-org-export-to-org)
</span></span><span class="org-block">      (add-to-list 'org-export-exclude-tags </span><span class="org-block"><span class="string">"TOC"</span></span><span class="org-block">)
      )
)
</span><span class="org-block-end-line">#+END_SRC
</span>
