posts/java-cheat-sheet.org
* COMMENT Making artifacts for the Github Repo                               :myIgnore:

# Whenever I save, C-x C-s, a new HTML is exported and then copied over to the write directory.
#
# (lambda nil (-let [file (f-base (buffer-file-name))] (when (org-html-export-to-html) (copy-file (concat file ".html") (concat "~/JavaCheatSheet/" file ".html") 'overwrite-if-exists))))
#
# eval (progn (load-file "~/blog/AlBasmala.el") (blog/preview))
# after-save-hook (lambda nil (-let [file (f-base (buffer-file-name))] (copy-file (concat file ".html") (concat "~/JavaCheatSheet/" file ".html") 'overwrite-if-exists)))
