java-cheat-sheet.org.html
<span class="org-level-1">* </span><span class="org-special-keyword">COMMENT</span><span class="org-level-1"> Making artifacts for the Github Repo                               </span><span class="org-level-1"><span class="org-tag">:myIgnore:</span></span>

<span class="comment"># Whenever I save, C-x C-s, a new HTML </span><span class="comment"><span class="writegood-passive-voice">is exported</span></span><span class="comment"> and then copied over to the write directory.</span>
<span class="comment">#</span>
<span class="comment"># (lambda nil (-let [file (f-base (buffer-file-name))] (when (org-html-export-to-html) (copy-file (concat file ".html") (concat "~/JavaCheatSheet/" file ".html") 'overwrite-if-exists))))</span>
<span class="comment">#</span>
<span class="comment"># eval (progn (load-file "~/blog/AlBasmala.el") (blog/preview))</span>
<span class="comment"># after-save-hook (lambda nil (-let [file (f-base (buffer-file-name))] (copy-file (concat file ".html") (concat "~/JavaCheatSheet/" file ".html") 'overwrite-if-exists)))</span>
</pre>
  </body>
</html>
